{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10050",
"category": "Product > furniture: contract/systems",
"company_name": "Teknion",
"company_url": "www.teknion.com",
"description_html": "The Zones furniture offering has been expanded to include a variety of new products to promote new planning paradigms. As office dynamics undergo a major transformation with new work styles emerging and new generations entering the workforce, traditional office spaces and aesthetics no longer serve the needs of the modern office. Zones Enhancements are meant to revolutionize traditional workstation environments with forms, shapes and materials usually associated with residential/hospitality spaces. By introducing these familiar markers of home, companies can enhance productivity, motivation and fulfillment of employees. <br/><br/>New Zones freestanding screens, soft seating, casual tables and lighting allow users to create more casual settings using their own combination of Zones components. Further additions to the accessories offering such as Tech Easels, Coatcheck easels, collaborative storage and food trolleys allow users to further enhance the workshop settings to promote productivity. New soft seating enables a variety of new setting possibilities, and new tables, worksurfaces, supports and desk-edge screens integrate seamlessly with existing Teknion systems products – District and upStage. These enhancements dramatically change the aesthetic appeal and feel of existing and new spaces by adding warm, soft, residential elements to the workspace. <br/><br/>Zones Enhancements allow it to be used in a variety of new applications and settings. Each setting provides a variety of needed functionality ranging from a focus lounge area to a more dynamic workshop area. In addition, a variety of settings can be created with the furniture components that comprise the Zones enhancement collection. For example, bar-height Zones canteen tables integrate with Teknion’s District or upStage furniture products to create reconfigurable sit-stand working areas within workstations. Screens, sofas, casual tables and lighting create a variety of casual or formal lounge settings. Accessories and easels create functional activity within the workshop settings. <br/><br/>Zones accessories are freestanding and mobile, allowing them to be easily rearranged throughout the office as needs evolve. They can be grouped together or used separately to support a variety of spaces. Screens are offered in two heights to provide varied levels of privacy in lounge or workshop settings. Tables are freestanding and can be easily repositioned to create various working areas based on changing tasks and needs. <br/><br/>Zones Enhancements combine laminated wood, solid wood, aluminum and steel to achieve BIFMA and other certification requirements to ensure that, while Zones products deliver a residential aesthetic, they are ready for the daily real-world use of contract furniture. Soft linear forms represented by the Zones wooden leg, curvature of the wooden and fabric screens, and soft corners of worksurfaces add sophisticated, homey, craft-like quality to existing systems components. <br/><br/>Zones Enhancements show that function does not need to be sacrificed to achieve aesthetics. Clients looking for contemporary, residential finishes and design solutions no longer need to forgo the durability and robust functionality of contract furniture. One or all elements can be integrated into the systems product, maintaining existing specifications while enhancing the product with visually appealing characteristics that dramatically change the look and feel of the space.",
"id": "10050",
"product_name": "Zones Enhancements",
"video_url": ""
}