{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10062",
"category": "Product > furniture: contract/systems",
"company_name": "Teknion",
"company_url": "www.teknion.com",
"description_html": "Expansion Cityline is based on the concept of planning for a workplace as diverse and dynamic as a modern city. With a unique beam framework and robust accessories program, the Expansion Cityline furniture system creates workstations, collaborative spaces and mixed-use areas in which people can feel comfortable and empowered as they pursue individual and collective goals. Expansion Cityline offers a highly active setting that allows people to move, to gather and to disperse when privacy and focus is desired. <br/><br/>It provides the unique ability to go from a full, freestanding workstation to a simple, casual, beam, fence-like application integrating gathering areas. Its breadth of offering delivers a wide range of flexibility for designing office spaces, from playful to elegant and sophisticated environments. The unique flexibility of the structure enables Expansion Cityline to be designed around the building architecture and blend with its environment.<br/><br/>Expansion Cityline is a true connection between workstations and casual spaces. The beam acts as a highway, linking different zones of social interaction, fostering exchanges and collaboration. The structural beam remains the backbone, providing unlimited configurations. It can be dressed up or down as needed. Within the same area the beam seamlessly links standing-height workspaces, casual lounge seating and task-chair activity. Expansion Cityline can be configured as a distribution fence for power and data, and is ideal for reconfigurable working spaces or collaborative areas. Expansion Cityline adapts to a space and its required functions.<br/><br/>As structure, Expansion Cityline’s beam permits 90-degree planning in multiple directions and supports a wide variety of configurations, including double and single-sided formats or acting as a simple, power-enabled fence that allows for direct plug-in to the beam. Height-adjustable worksurfaces are easily accommodated. Electricity/data flow through the beam along any path, accessible directly or via a power access door, power module and grommets. The beam provides all the advantages of a panel – without the panel. <br/><br/>A comprehensive program of accessories and screens enables people to work efficiently and effectively, while also contributing to “place-making” and a distinct work culture. Accessories include elevated and mounted screens with a choice of surfaces – felt, whiteboard and magnetic metal – to meet personal needs and preferences. Sit and Slide screens allow control of visual privacy. Expansion Cityline also offers storage trays, modular drawers, elevated shelf with accessories and a range of additional tools designed to adapt workspace to specific tasks and maintain easy access to task lighting, mobile devices, mini-whiteboards and other personal items. <br/><br/>From the outset, Expansion Cityline was designed with fully integrated height adjustability and is not, therefore, an “add-on.” From layering, suspended storage to floor-length screens, Expansion Cityline hits several different aesthetic levels. Special attention has been given to offering a wide range of materials, finishes and functionality. Multiple combinations of aesthetics and functionality provide scalability in price.",
"id": "10062",
"product_name": "Expansion Cityline",
"video_url": ""
}