{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10070",
"category": "Product > lighting: architectural",
"company_name": "Zumtobel",
"company_url": "www.zumtobel.us",
"description_html": "The newest generation of ONDARIA circular ambient luminaires features an ultra-thin 2” profile, direct / indirect distributions and exquisite detailing. ONDARIA feels like a skylight, delivering unmatched homogeneous illumination with wide-area lighting that makes rooms appear larger and wider. Whether recessed, surface-mounted, wall-mounted or as a pendant luminaire – the clear geometry of ONDARIA enhances the architecture without detracting from the interior styling. This makes it just as attractive for reception and waiting areas as for break-out zones or general lighting in a retail environment. The round shape of ONDARIA means that it can be positioned at random and in any direction in a room, without compromising the constant quality of light. An unobtrusive indirect light component with separate switching brightens ceilings and produces gentle ambience.<br/><br/>ONDARIA is available in three sizes – 24”, 34” and 45”. Optical lens offerings include the Luminance-Reducing Optic (LRO) for office environments and a soft Opal Optic for multiple applications such as lobbies, healthcare, educational facilities and retail. The innovative LRO achieves a low Unified Glare Rating (UGR) &lt; 19, making it suitable for workplace applications where visual comfort is a concern. Both optics offer an unobtrusive indirect light component with separate switching, which brightens ceilings and produces gentle ambience.<br/><br/>ONDARIA is comprised of a white enamel aluminum housing with soft outlines. White is the standard finish color, but custom colors are available. The inner surface of the luminaire is painted with a highly reflective finish for increased efficiency, achieving efficacy of up to 101 lm/W.",
"id": "10070",
"product_name": "ONDARIA",
"video_url": ""
}