{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10071",
"category": "Product > seating: contract/lounge",
"company_name": "Studio TK",
"company_url": "www.studiotk.com",
"description_html": "Dual Lounge – designed by Toan Nguyen for Studio TK – plays the role of protagonist in a wide array of social environments. Its organic form expresses comfort while visually emphasizing the contradiction of light and dark. The name Dual comes from the “duality” of light and dark seen visually in the transparency of the base in partially opaque knit, and the adverse textile upholstery of the top portion. <br/><br/>“The Dual Lounge is the fruit of a balanced combination of several character traits apparently in opposition,” says Toan Nguyen. “Its monolithic and organic shape is divided in two by a clear-cut line: the upper part is enveloping and dedicated to the user comfort, while the base is a subtle counterpoint of balance, tension and transparency. With both parts customizable with any fabric or leather on the top, and fabric or three-dimensional knitted mesh on the base, Dual Lounge is suitable to either a classic tone-on-tone or a fancy, sharp contrast matching. The low-back version stimulates a dynamic attitude and a collaborative discourse whereas the high back incites rest and relaxation.”<br/><br/>The 3D knit mesh base allows for light to pass through for a balance of light and dark. The duality of materials of the upholstered seat and back and the mesh base creates a juxtaposition of materiality to create an iconic visual statement. Dual creates a balance of materiality unlike other swivel lounge chairs.<br/><br/>Dual’s relaxed, lean-back posture offers an alternative choice throughout the day to support the changing modalities, from focus applications that allow for moments of individual respite during a day of collaboration, to public spaces that promote circulation and destinations that attract social collisions. With a myriad of finish and textile options, Dual encourages personalization of these space typologies to create any mood desired.<br/><br/>Each chair is equipped with a return-to-center swivel. That subtle gesture can change a static setting into a dynamic space that keeps the conversation flowing and ensures that good ideas spread far and wide.<br/><br/>Dual introduces a residential aesthetic to create a welcoming environment for focus and recharge – so that work doesn’t feel like work.",
"id": "10071",
"product_name": "Dual Lounge",
"video_url": ""
}