{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10088",
"category": "Product > furniture: outdoor",
"company_name": "Brown Jordan Outdoor Kitchens",
"company_url": "https://brownjordanoutdoorkitchens.com/asa-d2/",
"description_html": "ASA-D2 is a contemporary, free-standing outdoor kitchen designed by architect and designer Daniel Germani. It utilizes ultra-durable materials, including Dekton by Cosentino and Brown Jordan Outdoor Kitchens stainless steel cabinetry, to beautifully withstand exposure to the elements. The grill, by Caliber Appliances, combines culinary design and innovative engineering that fit seamlessly into the outdoor kitchen. Its modular design gives consumers the flexibility to select from four finishes and choose their appliance options, while its 360-degree functionality provides access to storage and shelving on both sides of the unit.<br/><br/><br/>ASA-D2 has a modular design that gives consumers the flexibility to select from four finishes and choose their preferred appliance options; while its 360-degree functionality provides access to storage and shelving on both sides of the unit. ASA-D2 combines culinary design and innovative engineering that fit seamlessly into the outdoor kitchen. Able to withstand the most severe weather conditions the ASA-D2 freestanding outdoor kitchen features an aluminum structure and stainless steel body for strength and stability with an ultra-compact Dekton® outdoor kitchen countertop for extra durability.<br/><br/>Colors offered include: <br/><br/>•\tTrilium: A stunning pattern reminiscent of aged and oxidized steel \u2028<br/>•\tSpectra: A solid black with exceptional shine, both luminous and intense \u2028<br/>•\tAura: A sophisticated replica of Calacatta marble \u2028<br/>•\tHalo: A soft white hue married with a high-gloss finish \u2028<br/><br/>This exciting partnership continues Germani’s exploration of the unlimited potential of Dekton in bespoke outdoor furniture, as well as the unlimited applications of Dekton in outdoor kitchens. ASA-D2 is available in four separate colors from Dekton’s current offering. Brown Jordan Outdoor Kitchens utilized its innovative powder-coat process to customize the stainless steel cabinetry to replicate the pattern of the Dekton countertop.<br/><br/>Since its launch in 2013, Dekton has since transformed the world of surfacing by offering superior design and performance and low maintenance. Due to its technical properties, the material offers exceptional strength; high resistance to impact, scratches and stains; very low water absorption; UV resistance; and resistance to thermal shock against extremely high temperatures. These unique characteristics permit Dekton to be used in multiple interior and exterior applications.",
"id": "10088",
"product_name": "ASA-D2 by Daniel Germani",
"video_url": ""
}