{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10092",
"category": "Product > lighting: architectural",
"company_name": "Juniper",
"company_url": "http://www.juniper-design.com/",
"description_html": "Like a large city, design can be viewed as the outcome of an intricate collaborative system based upon influences, ideas, solutions, and opportunities. Juniper Design Studio's Metropolis Collection is representative of that very philosophy.<br/><br/>Born out of a happenstance collaboration between three partners well-versed in high design, Juniper Design Studio, designer David Meckley, and Huntsman Architectural Group, Metropolis has grown from custom lighting solution into a full residential and architectural lighting collection. Metropolis, in its simplest form, is a medley of suspended, precision-machined LED light modules. Given a closer look, the lighting system's intricately woven details become apparent, with the Bauhaus movement's strong forms and subtle nautical queues donning Metropolis' silhouette. Especially complementary to larger spaces, the system is engineered with 2x36” modules that link together, creating a comprehensive wall-to-wall system. <br/><br/>Delivering an impressive 1800 dimmable lumens per lineal foot from two independent up-down light sources, the wall-to-wall system is designed especially for conference rooms, but can be customized to fit spaces of any size. Specification for this system is simple, with room length and desired drop all that is required to include the custom fixture in the design scheme. Design preferences and flexibility are also accommodated with 2’, 3’, 4’ lengths available in three standard finishes, which include brass/black, satin aluminum/black, and full polished aluminum. Metropolis is also available as an independent linear pendant, adding to the versatility of the light source. Four, five, and six feet length variations further this notion, providing the perfect addition of light and architectural detail to residential dining spaces, restaurants, and boardrooms. The diffused frosted acrylic lens can also be outfitted with perforated hex mesh for enhanced ambiance. <br/><br/>Additional custom offerings and configurations are in the works, with the launch of wall sconces, ceiling mounts, and connectors on the horizon.",
"id": "10092",
"product_name": "Metropolis",
"video_url": ""
}