{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10091",
"category": "Product > textiles: contract",
"company_name": "Luum Textiles",
"company_url": "www.luumtextiles.com",
"description_html": "Eastern Hemisphere is the latest Luum Textiles collection designed by Suzanne Tick, inspired by her summer travels to the Tibetan Plateau region with grassland nomads and fellow weavers. Interpretations of the slow and spiritual approach to life, along with the beauty of rocky textures and traditional geometric patterns, are captured in this collection of four new fabrics. <br/><br/>The complexity of the Tibetan culture is embodied in the collection’s rich colors and textures. The nuances of handmade materials bring a contemplative aesthetic into the modern environment.<br/><br/>As well-being becomes an essential design objective, we continue to value the nuances of the natural and the handmade. The Eastern Hemisphere collection expresses these attributes while fulfilling the need for textural elements in today’s interior spaces. The collection is made up of four products: Thangka, an upholstery fabric; Ghat, a multi-purpose fabric; Dhurga, a direct glue wallcovering; and Monotex, an upholstery fabric. <br/><br/>Thangka is a large-scale weathered geometric inspired by the Buddhist mandalas or sacred diagrams of Tibet. The subtle patterning explores straight angles and half circles on a chenille ground, evoking tradition with a contemporary feel. This nimble pattern perfectly complements today’s trend of rounded design elements and curvilinear furniture. The palette embodies bright colors found in sacred Tibetan artwork as well as the region’s natural surroundings. Thangka utilizes a bleach-cleanable, core-lock polyester chenille yarn paired with a bright polyester.<br/><br/>Ghat is an irregular textural pattern that alludes to the pebbly landscapes of Tibet and the natural hand-spun yarns of the area. The multi-purpose pattern offers a distinct, perceived texture and can be used as both upholstery or wrapped wall. The blend of polyester, wool and nylon yarns utilized in this construction adds surface interest to the textural patterning. <br/><br/>Dhurga is a textural, patterned, direct-glue wallcovering inspired by the rocky Tibetan landscapes. Utilizing the same pattern as Ghat, this construction features a subtly striated yarn in the ground countered by a lustrous yarn that activates the organically patterned surface. Dhurga brings a natural material sensibility to our wallcovering offering by providing a soft textural look to vertical interior surfaces. <br/><br/>Monotex is a printed, bleach-cleanable polyurethane that takes its pattern directly from a textural woven fabric. Monotex captures the visual softness of irregular hand-spun yarn fabrics while offering the desired performance attributes inherent to a coated fabric. Monotex’s versatile and broad color palette is an ideal solution to meet the needs of a wide variety of market segments.",
"id": "10091",
"product_name": "Eastern Hemisphere",
"video_url": ""
}