{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10090",
"category": "Product > flooring: carpet/broadloom",
"company_name": "Bentley Mills",
"company_url": "http://www.bentleymills.com/",
"description_html": "Perception is everything. With Night Vision from Bentley, you’ll see carpet in an entirely new light. Leveraging innovation in yarn technology, the award-winning broadloom product features unique dimension and depth of color that shifts the design depending on the direction you’re walking. <br/><br/>Night Vision, which received one of only four Best of NeoCon Editor’s Choice awards and one of 35 #MetropolisLikes prizes, provides an experience that promises to change your perspective. Perfect for designers seeking brilliant yet surprising style, its design and color application offers an inspiring and innovative approach to the standard commercial space.<br/><br/>Like the cut of a gem, Night Vision explodes into a kaleidoscope of reflective color on the floor. The crystal- esque design reflects light as if it’s bursting through a prism, illuminating the floor in soft striations of monochromatic color. Variegated yarns alternate between low and high luster, mixing color in unexpected ways to create a subtle ombré effect – available in a range of gradient combinations. <br/><br/>With the proprietary color-changing technology of Bentley’s COLORCAST™ program, designers have access to infinite possibilities of color combinations with Night Vision (with no additional minimum order requirements). Matching color from any source, including paint chips and fabric swatches, COLORCAST empowers designers to embrace endless possibilities. From subtle neutrals to vibrant, saturated hues, the only limit to color is your imagination. <br/><br/>Night Vision utilizes advanced pattern tufting technology that produces unmatched flexibility and durability for a variety of commercial spaces. The elegant yet edgy style features Ultron® Nylon 6,6 and maintains the highest standards of commercial requirements for performance and wear. Night Vision is available in 24-inch by 24-inch and 18-inch by 36-inch NexStep® Cushion Tile and AFIRMA™ Hardback Tile and 12-foot High PerformancePC Broadloom. <br/><br/>It is Cradle to Cradle Certified™, NSF® 140 certified and CRI Green Label Plus certified, and produced in a LEED®-EBOM Gold-certified manufacturing facility.",
"id": "10090",
"product_name": "Night Vision",
"video_url": ""
}