{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10103",
"category": "Product > flooring: carpet/modular",
"company_name": "Bentley Mills",
"company_url": "http://www.bentleymills.com/",
"description_html": "Boundaries between home and office, personal and professional, are blurring more than ever. Today’s generation craves it: a subtle yet sophisticated integration of work and play no matter where they are. Bentley brings this style and culture shift into focus with The Outskirts. The collection seamlessly supports those of us traveling in between the spaces that define our lives – encouraging diversity, growth and evolution by connecting our environments in new and purposeful ways.<br/><br/>The modular carpet collection homes in on our zest to connect our environments while discovering new ways to combine texture, pattern and color. Designed as a system, its products work together or apart – inside and out of the collection – to infuse the look and feel of luxe comfort into any commercial interior. Experiment with materials; play with color; mix and match full and half plank tiles. Push the limits of design and discover the unexpected with The Outskirts. <br/><br/>Comprised of three styles, The Outskirts Collection reveals rich, textural patterns with a range of colorways that span from luxurious, edgy neutrals to vibrant, playful hues. They blur the look and feel of natural materials with the rugged performance of commercial carpet.<br/><br/>The bold geometrics of Outlier are as unique in shape as they are stunning in colors and shades. Metallic lines and insets give the pattern-over-background an unexpected elegance. <br/><br/>Bentley’s twist on organic botanicals, Ritual has the aesthetic of textured high-end wool. Broken lines resemble branches, carved from tip-sheared peaks and valleys and given life with subtle yet brilliant washes of color.<br/><br/>Repose, designed to mix and mingle with other styles – inside and out of The Outskirts line. With no specific linear direction, its all-over visual is a subtle, beautiful expression of color and pattern – a designer’s dream.<br/><br/>Featuring the latest in pattern tufting technology, all three styles are made with Antron® Lumena™ Type 6,6 Solution-Dyed Nylon for ultimate color and performance. Consisting of full and half plank tiles and broadloom options, the collection encourages innovative mixing of patterns, textures and colors, with each other and with other Bentley products. <br/><br/>The collection received multiple honors at NeoCon 2017, including a Silver Best of NeoCon in the broadloom category, an Interior Design HiP honoree award and BUILDINGS Product Innovations Merit distinction.",
"id": "10103",
"product_name": "The Outskirts",
"video_url": ""
}