{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10118",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "Bentley",
"company_url": "http://www.bentleymills.com/",
"description_html": "When Bentley designs a new collection, it’s much more than the right combination of texture, color and material. It’s an extension of the brand and what differentiates the California-based commercial carpet manufacturer. And it’s not just physical product, either. It’s a story that resonates through everything. (los)t angeles is case in point. From the pattern names to the NeoCon experience, it was never “just carpet.” (los)t angeles is a vibe. The Bentley vibe. <br/><br/>Not long ago, Bentley returned to its roots, taking a wide-angle, big picture view of Los Angeles’ (L.A.) influence on its people and products. With the launch of (los)t angeles, it contrived the next chapter of its L.A. narrative – inspired by the sprawling, open book city that somehow manages to be gritty and razor-sharp while living up to its laid-back, sun-drenched bohemian reputation.<br/><br/>The modular and broadloom collection’s branding and marketing material played on this story of reinvention, going beneath the glitz and behind the urban decay to help others discover the extraordinary and unexpected things. <br/><br/>Officially available to the market in January 2017, (los)t angeles debuted at NeoCon 2016. Known for crafting unique showroom experiences, Bentley didn’t simply display the two carpet styles (Underground and Trespass); it invited showgoers into a journey of juxtaposition. Conquest and sin; loss and growth; decay and renewal. As you moved along, the showroom’s look and feel shifted from old and run-down to moderately built to a completely renewed structure – a reflection of L.A.’s everchanging landscape. Mexican coffee, local California Lagunitas beer and branded flask water bottles (a designer favorite!) were added touches of Bentley’s (los)t angeles flare. <br/><br/>Across the street at the company’s secondary showroom, visitors discovered their own story with an aura reading/photography station. Multiple giveaways, including opportunities to receive inspirational Giving Keys necklaces – with proceeds supporting L.A.’s homeless community – reinforced Bentley’s (los)t angeles narrative. <br/><br/>The branding and marketing campaign continued into 2017 with eye-grabbing “look books” of inspiration photos shot by the product designer himself. The barren Salton Sea and the abandoned zoo, among other “forgotten places,” offered an eerily edgy yet oddly elegant view into the textures, colors and energy that inspired the collection. <br/><br/>Meanwhile, advertisements featured vibrant blue broadloom carpet draped in an industrial-looking factory, thinly veiled with smoke – a mix of old and new, forgotten and found elements. Exciting yet unexpected. The ads and collateral, PR, social media and event experiences were united by more than the one product they were designed to showcase. They were all unmistakably Bentley. <br/><br/>Every Bentley marketing and branding campaign, but perhaps especially that of (los)t angeles, serves to cement its story: the L.A. vibe, the collision of new and old, strange yet brilliant, lost but always found.",
"id": "10118",
"product_name": "(los)t angeles",
"video_url": ""
}