{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10116",
"category": "Product > flooring: hard",
"company_name": "Mannington Commercial",
"company_url": "manningtoncommercial.com",
"description_html": "A stunning, visually striking, and highly usable new collection of LVT — that speaks to lived experience as much as it does to pattern, to inspiration as much as to color.<br/><br/>Designed by Mannington Design Studio, the Portland Project began with a road trip to Oregon. The design team immersed themselves in the beauty of the region, exploring the rugged coastline and trekking through mountains and forests. Their intent was not to visually recreate what they saw, but instead to capture and communicate the experience of wilderness, the spirit of exploration. Wander and wonder. Make your own path.<br/><br/>The resulting patterns harken Oregon’s secluded ridge lines and trailheads, translated into luxurious textures, sharp linear movements, and layered striations of color. Two coordinating abstracts (Moraine and Timberline) play with overlays of geometries or fade in and out of focus, over an ombre wash of colors. <br/><br/>Two wood grains (Flume and Burnside) feature a unique, metallic graining finish that creates a mesmeric glimmer. The patterns span large and medium scale, and are all offered in 6”x48” planks. <br/><br/>The variety of styles allows for interpretation in innovative design compositions: designers can realize a unique vision for a space, whether it be a bold combination or subtle understatement. The collection’s thoughtful approach to classic and emerging color trends make it an LVT perfect for corporate, retail, higher education and hospitality projects. <br/><br/>The distinctive benefits of LVT bring durability and flexibility to commercial spaces. The Portland Project is made in Amtico 30 construction with a 30 mil wear layer, 2.5 mm overall thickness. <br/><br/>The product also features patent-pending Quantum Guard(R) Elite multi-layered protection, engineered for best in class dimensional stability, advanced stain resistance, superior impact resistance, clean cutting during installation and with the highest scratch resistance in the industry. Its easy, no-polish maintenance significantly reduces overall lifecycle cost and total cost of ownership. <br/><br/>The product has a 15-year commercial warranty and a 15-year Quantam Guard Elite Wear warranty. Fully recyclable, FloorScore® certified and made in the USA.",
"id": "10116",
"product_name": "The Portland Project LVT",
"video_url": ""
}