{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10125",
"category": "Product > seating: residential/accent",
"company_name": "Sossego | Modern Brazilian Design",
"company_url": "http://sossegodesign.com",
"description_html": "Sossego is the exclusive US distributor of Brazilian designer Aristeu Pires. Following a long and eminently successful career in computer engineering, Aristeu discovered his passion and exceptional talent for creating modern furnishings from warm Brazilian woods. For 15 years his designs have brought everyday comfort to the finest hotels, restaurants and workspaces across South America where contemporaries in the A+D community have dubbed him “King of Chairs.” It’s all about exceptional styling: comfort for the body and beauty to the eye.<br/><br/>Olivia armchair<br/>Visually striking, the Olivia armchair’s seemingly delicate, branch-like legs belie her inner strength. The wide seat ensures an easy and comfortable hours-long sit. A trend-setter, her caned back is an exquisite touch.<br/> <br/>Individually hand finished, her arms are carved like a supple fold of a palm leaf falling over. 5 axis CNC machining paired with old world craftsmanship create Olivia's seamless joinery and tactile appeal. Crafted from sustainably harvested jequitibá and louro freijó hardwoods, and upholstered in natural Brazilian leather, COM/COL, or over 100 fabric options. Jequitibá is a sustainably harvested Brazilian hardwood (akin to fine maple or royal mahogany) that features a natural luster and clear grain structure. Louro freijó is referred to as “Brazilian walnut” for its rich grain and is sustainably harvested with strict oversight by Brazil’s Ministry of Environment.<br/>Available in 14 wood finishes to grace the home, office, boutique hotels or lobbies. <br/><br/>\"I love the Olivia. For her design, I was inspired by the intertwining branches of an olive tree and incorporated a hint of Art Nouveau,” said Aristeu Pires.<br/><br/>30.7\" H 23.6\" W 22.8\" D 18.7\" SH",
"id": "10125",
"product_name": "Olivia armchair",
"video_url": "http://sossegodesign.com/designers/"
}