{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10124",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "Cosentino",
"company_url": "https://www.dekton.com/usa/",
"description_html": "Following the celebrated launch of Dekton Trilium in 2016, Cosentino added three new colors to its Dekton Industrial Collection. Drawing inspiration from the award-winning Dekton Trilium, leading architect and designer Daniel Germani envisioned three new designs that capture the organic texture and essenese of weather-worn stone and aged metals. The industrial Collection is intended to be both relaxed and modern through its rough, expressive aesthetic, reestablishing concrete, metal and brick as material protagonists in modern design. To create a rich design with varied subtle effects, the Industrial collection has a never before seen matte-gloss finish.<br/><br/>Unlike the materials that sparked the Industrial Collection’s design, Dekton is incredibly smooth to the touch and impervious to the elements, including scratches, stains, UV rays and temperature shock. Its ultra-durable performance makes it ideal solution for an array of indoor and outdoor applications, including countertops, facades, cladding, flooring, stairs and more. It is available in large format, which allows for seamless creative possibilities for architects and designers for both residential and commercial projects. <br/><br/>“The Industrial Collection celebrates the beauty of metals and cement as they transform over time,” Germani says. “Imperfections caused by oxidation and natural degradation create unique colors that capture the richness and depth of organic processes. It was only through the incomparable technology of Dekton that we were able to explore these processes and subsequently create these designs.” <br/><br/>In the spirit of Cosentino’s continued commitment to sustainability, 80 percent of the materials used in <br/>two of the collection’s four colors (Trilium and Radium) come from excess materials from the Dekton manufacturing process. Sustainability is an integral part of the Cosentino brand; a portion of all R+D funds are allocated to the creation of environmentally friendly products to help Cosentino achieve zero emissions in an effort to maintain clean air, support energy efficiency, manage water effectively and dispose of waste correctly. <br/><br/>The Dekton Industrial Collection includes the following four colors:<br/>•\tOrix mimics the industrial appearance of eroded cement: steely, cold and broken. Its multi-tonal color palette of greys, blues and greens creates contrast between old and new.<br/>•\tNilium subtly blends hues of silver and white, offering a minimal approach. It simultaneously conveys the delicate elegance and inherent strength of metal.<br/>•\tRadium resembles acid-washed steel, juxtaposing warm earth tones against cold blue and green hues. Similarly to Trilium, it is manufactured using the same sustainable production methods, using up to 80 percent recycled materials.<br/>•\tTrilium, the first of the collection, captures the visual texture and color variation of aged and oxidized stainless steel with hues ranging from deep grays and blacks to rusty undertones, giving it an incredibly genuine appearance.",
"id": "10124",
"product_name": "Dekton Industrial Series",
"video_url": ""
}