{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10139",
"category": "Product > acoustical applications",
"company_name": "LightArt",
"company_url": "www.lightart.com",
"description_html": "This year, LightArt took a bold step in lighting design with the launch of an acoustic <br/>lighting collection. The collection includes two new acoustic fixtures — Static and Echo — that each provide an architectural lighting solution, sound absorption, and natural texture to effectively create a new category of lighting possibilities. <br/><br/>Static is a beam-shaped modular lighting solution that delivers both high performance lighting and acoustic value. Using some of the highest efficiency LED modules on the market, Static offers two directional lighting and has 1% dimming capabilities. Echo, a fixture consisting of a series of angled fins, is intended to be specified as a system of fixtures to create a striking geometric ceiling landscape with the unique ability to provide both a lighting and sound solution.<br/><br/>While LightArt traditionally uses 3form materials, the Acoustic Collection features a new material for the first time in the company’s eleven year history — 50% recycled PET felt — a material that provides a contemporary aesthetic while adding softness and texture to overhead lighting. LightArt tested the acoustic performance of the material at the largest reverberation chamber in the world - NWAA Labs in Elma, Washington. Static’s material and assembly received an NRC rating ranging from .80 to 1.00, proving the fixture’s high performance capabilities. <br/><br/>Lighting offers an opportunity to put an acoustic solution closer to the source of sound, which increases the efficiency of the absorption, while also offering a more seamless way to integrate solutions into the environment. Both Static and Echo can be arrayed for significant absorption coverage in spaces where poor acoustics can be distracting such as open workplace environments, conference rooms, classrooms and restaurants. This new line of high performance lighting aims to help designers improve communication, enhance interactions and create harmony in active environments.",
"id": "10139",
"product_name": "Acoustics",
"video_url": "https://www.youtube.com/watch?v=uAPp0ESVanY"
}