{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10148",
"category": "Product > window treatments",
"company_name": "Fil Doux Textiles",
"company_url": "fildoux.com",
"description_html": "Daybreak, the first drapery collection to be released by Fil Doux Textiles, invites the outside in with its nature-inspired designs. The mill-direct fabric supplier focused on matted metallics for the extensive collection of 13 patterns in 12 colorways, which is accented by the unexpected addition of a mid-century modern inspired merino wool option.<br/><br/>“The addition of drapery rounds out the full offering of Fil Doux Textiles’ extensive options for hospitality environments,” said CEO, Leo Novik. He continues, “We’ve waited a long time to introduce this new category to our portfolio. Drapery is the finishing touch to the room and, for us, it is like we’ve just completed the masterpiece. We can now supply all the fabrics needed for a hotel room.”<br/><br/>Both romantic and emotive, Daybreak’s textural elements reference timeless artworks such as the Venus De Milo or Christo and Jeanne-Claude's epic installations. This combination of bold and dramatic patterns with soft and humble color tones creates a beautiful contrast that can help frame any space. <br/><br/>Highlights<br/><br/>Sensation: Inspired by the ancient Greek meditative labyrinth experience, where it is said that psyche meets spirit, Sensation is a modern geometric design.<br/><br/>Indelible: This pattern reflects the details of Christo and Jeanne Claude's majestic archways, layered to create an etched look.<br/>​<br/>Bloom: Resembling that magical moment when flower petals blossom and expand outward, Bloom is soft and organic. <br/><br/>Intrinsic: A colorful variation in the delicately striped design with hints of gold and silver, this pattern adds a touch of glamour to any space. <br/><br/>Finesse: Like the slightly aged look of plaster, Finesse has a weathered appearance that replicates the delicate friezes created by great artisans of the past. <br/><br/>Slumber: An effortless classic, Slumber is both elegant and inherently helps to control room temperature, thanks to its 100% merino wool construction.",
"id": "10148",
"product_name": "Daybreak Collection",
"video_url": ""
}