{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10143",
"category": "Product > textiles: hospitality",
"company_name": "Fil Doux Textiles",
"company_url": "fildoux.com",
"description_html": "A shared respect for the environment and passion for design brought Fil Doux Textiles and designer Clodagh together to create the Fil Doux Textiles x Clodagh NOMAD Collection of upholstery textiles and bed throws for hospitality spaces.<br/>The Nomad Collection provides a glimpse into the eco-philanthropic designer's journeys across the world. “Experiences create no excess baggage,” says Clodagh, who, having travelled to over 100 countries, employs the cavalcade of memories and nostalgia of the sounds, tastes, colors, shapes, light, touch and fragrances to provide her with the greatest design inspiration.<br/>“When I first met the Fil Doux Textiles team, I felt as though I had expanded my family. We speak the same language—including a dedication to nature and life-enhancing green design,” says Clodagh. Leonardo Novik, president of Fil Doux Textiles adds, “We’re proud of this collection, and working with a designer whose values mirror our own. It’s warm and thoughtful, and like all our offerings, upholds our high environmental standards.”<br/>The collection includes woven and printed cotton-blend fabrics in 15 earth-inspired colorways and a coordinating series of throw blankets. Fil Doux Textiles’ eco upholstery and multi-purpose fabrics are woven from the company's proprietary FabuTouch yarn that mixes the fibers within the yarn to create superior durability while maintaining a soft hand, reminiscent of residential products. The tactile throw blankets are pre-shrunk and machine washable, making them a perfect selection for hospitality and residential environments alike.<br/>“I’m a nomad at heart; while travelling I’m inspired not only by the weaving techniques of other countries but also architectural details, colors and smells of the local markets, the native music, and the indigenous people,” says Clodagh. “By weaving and printing with an eye on ancient traditions, in a sense we are uniting nations in our textiles.”",
"id": "10143",
"product_name": "Fil Doux Textiles x Clodagh NOMAD Collection",
"video_url": ""
}