{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10165",
"category": "Product > accessories",
"company_name": "Christofle",
"company_url": "christofle.com",
"description_html": "The marriage of beauty and functionality has always been a core value at the House of Christofle. The Jardin d’Eden collection of lights designed by Marcel Wanders is the latest example: with this new family of rare objects of High Silversmithing, Christofle brings new luster to the lifestyle universe.The Jardin d’Eden chandelier and candelabra expand on the sense of enchantment that accompanies each of the collection’s designs. Ever since design studio Marcel Wanders created this beautifully scrolled motif, each of its variants has become an icon. Produced by hand in the high-silversmithing workshops by Meilleurs Ouvriers de France (Best Craftsmen in France), these two pieces are as much the reflection of Marcel Wanders’ flair for sensuality and ornamentation as the intricacy of Christofle’s know-how. The chandelier, which hangs from a Dutch chain, features twenty arabesque branches, the candelabra seventeen. Each piece is punctuated by as many hand-carved blown crystal lampshades in either clear or smoked glass depending on the desired lighting and atmosphere. Once more, Christofle takes the marriage of aesthetics and practicality to a whole new level.<br/>Through standing lamps and votives, Jardin d’Eden is also available in smaller-scale, engraved steel variations for decorating tables, living areas and offices. Inspired by the shape of a torch, the slender table lamp transforms in function of its lampshades’ materials and colors, from fabric to carved crystal. The candlestick iteration enriches the House’s gift offerings with a refined decorative object. A fitting finishing touch for a collection brimming with strength and radiance.",
"id": "10165",
"product_name": "Jardin d’Eden Collection",
"video_url": ""
}