{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10167",
"category": "Product > wall covering: contract",
"company_name": "PolyVision",
"company_url": "https://polyvision.com/",
"description_html": "a³ CeramicSteel Flow is one of a kind. From feature walls that display brand messaging and graphics to seamless writing surfaces, this product transforms the aesthetics and functionality of any vertical wall space. With no vertical joint covers, a³ CeramicSteel Flow allows for uninterrupted design and worksurface. <br/><br/>What makes a³ CeramicSteel Flow distinct from other full-height wall coverings are its features. With concealed vertical joints and no made-to-order components, this product is easy to install. The user experience and overall aesthetic of a space is enhanced with this product’s ability to beautifully display its two standard color options as well as customizable images and designs due to PolyVision’s state-of-the-art digital imaging technology. Since the CeramicSteel surface is colorfast, the vibrant colors and designs are upheld for years. This product is also easy to clean and leaves minimal , thus improving its longevity. The durability of the a³ CeramicSteel Flow ensures the surface is resistant against scratches, bacteria, chemicals and fire. <br/><br/>In addition to these distinct characteristics, a³ CeramicSteel Flow is environmentally-friendly. As a surface that is 99.9% recyclable and made from inorganic materials, this product is safe to use for all applications. Striving for optimal environmental stewardship, the CeramicSteel material is Cradle to Certified™ Bronze level certified, the only surface in the market that has achieved this global recognition. Additionally, the CeramicSteel material is certified by SCS Global Services as Indoor Advantage Gold™ , which is the global standard for products that support a healthy indoor environment. <br/><br/> a³ CeramicSteel Flow truly is a wall covering suitable for all things collaboration and design.",
"id": "10167",
"product_name": "a³™ CeramicSteel Flow",
"video_url": ""
}