{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10197",
"category": "Product > accessories",
"company_name": "Schlage",
"company_url": "www.schlage.com",
"description_html": "Door handles, as ubiquitous as they are, have become graphic expressions for the architecture. While specifications are often made based on silhouette, little thought is given to the experience of interaction. The M Series Ergonomic (ME) lever collection changes this paradigm by considering ergonomics, design and experience as one instead of at the expense of the other. <br/><br/>ME1 ergonomic lever <br/>Designed to be soft to the touch from every angle, the ME1 uses gentle curves that contour with the hand for easy actuation. The end of the handle flattens horizontally as it approaches the door, providing a paddle-like surface that - because of its distance from the lever shaft - reduces the amount of force required to open the door.<br/><br/>ME2 architectural ergonomic lever<br/>An architectural interpretation of the ME1 design, a linear, minimalist style integrates into modern aesthetics while delivering comfort, ergonomics and efficiency.<br/><br/>ME3 easy access lever<br/>The slightly larger scale of the ME3 addresses the needs of the growing active aging population. The thicker lever diameter allows easy grasping by arthritic hands, while a lever offset angle positions the large grip surface in a way that reduces actuation force.<br/><br/>The ME Series Schlage levers is the first contract quality handle set that truly addresses how we engage the door - where we approach from any number of directions - and the needs of an active yet aging population were all factored in, resulting in an all new experience.<br/><br/>The ME levers are made of forged brass or bronze and cast in stainless steel. The three handle designs come in the following styles: bright brass, satin brass, bright chrome, polished nickel, satin nickel, matte black.",
"id": "10197",
"product_name": "Schlage M Collection Ergonomic Levers",
"video_url": ""
}