{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10209",
"category": "Product > acoustical applications",
"company_name": "MDC",
"company_url": "http://www.mdcwall.com/",
"description_html": "This year, MDC reached new heights – including the ceiling – with Zintra Acoustic Solutions, which won the 2017 Best of Show award at BD West and the Best of Competition award for the 21st Annual IIDA/HD Product Design Competition at HD Expo, standing out from the pack of hundreds of products exhibited.<br/><br/>Updates to MDC’s popular portfolio of Acoustic Solutions include new textures and geometric configurations. These stunning designs respond to market demand for high-performance sound control products that stand out yet blend in for all the right reasons: they resemble decorative architecture. <br/><br/>It’s easy to mistake Zintra Cloud for artwork hanging from the ceiling. The two new styles, Giffard and Blanchard, feature elliptical and diamond constructions with openings to let light pass through for an airy, light feel.<br/><br/>The two new patterns of Zintra Texture, Trappe and Tissage, pop out from the wall to create a dynamic, three-dimensional ambiance. The raised designs bring texture and dimension to commercial spaces and add a touch of natural elegance, resembling a stone path and woven basket. <br/><br/>Zintra on Zintra now offers a range of 20 dimensional designs that can be used for entire walls, paneling, desk dividers and concertina screens. These are created from two Zintra panels: one of which has the design cut out allowing the back panel of color to show through. <br/><br/>In the Zintra on Zintra Concertina design, the Zintra on Zintra panels connect with flexible straps to form lightweight, portable partitions. No assembly required; just stand it up and adjust the angles to suit. When it’s no longer needed, simply fold flat and store it away. Available in hundreds of options and tone-on-tone or two-tone combinations, the Concertina screens are an all-in-one sound absorbing, flexible partitioning solution that look just as good as they perform. <br/><br/>New and improved, Zintra Acoustic Baffles makes installation and assembly even easier. The new format allows for more organic, free-form structures with a different aesthetic. Gorge, the first in the new range, features an asymmetrical profile and perforated accents.<br/><br/>Zintra is 100 percent polyester and has a Noise Reduction Coefficient (NRC) rating of 0.26 to 0.95, depending on the design. The refreshed line gives designers even more creativity with updated colors, lines, shapes and functionality, while remaining a durable and effective noise solution for commercial settings. <br/><br/>Solid, unformed Zintra Acoustical solutions include half inch construction in 4-foot by 9-foot long panels as well as one-eighth inch flexible rolls of 4-foot wide material. Zintra Acoustic offers a range of colors from classic neutrals to bright limes and yellows or custom colors. More options? Choose to digitally print a graphic with Acoustic Zintra. The cost-effective sound solution for walls, panels and ceilings is easily fabricated and installed.",
"id": "10209",
"product_name": "Zintra Acoustic Solutions",
"video_url": ""
}