{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10205",
"category": "Product > technology",
"company_name": "Byrne",
"company_url": "www.byrne.com",
"description_html": "The way we work is changing. So, it only makes sense that our environments change right along with us, and work as hard as we do. Spaces today don’t do just one thing. You might use the same room for a morning conference call, impromptu lunch, a few short afternoon meetings and solo work time later on. One space can do that, or should—and our Bluetooth Speaker helps make it happen.<br/><br/>Bluetooth isn’t new to our lives, but why not take advantage of the convenience of this technology in today’s work environments? This is why we’ve integrated our custom Bluetooth®-enabled speaker into a whole range of Byrne’s favorite accessory products. Now, any workspace can double as a dedicated conference call zone, without the dedicated square feet.<br/><br/>Set up is so simple. You just press the speaker button, connect your smartphone or favorite device and you’re set. This high-quality speaker pairs easily with most mobile devices and is tuned for optimal sound, making it ideal for one-on-one calls or larger group discussions. It’s also great for enjoying your own tunes or taking advantage of podcasts and other streaming services—all controlled right there in the palm of your hand.<br/><br/>Byrne’s Bluetooth Speaker also offers the added benefit of power and USB—including new USB-C—to charge technology while you’re working. Byrne’s custom designed, stainless steel, speaker grill is available in multiple plated finishes. Its low-profile design and clean, modern interface is offered in a wide range of Byrne products, so you can choose the product that’s just right for you. <br/><br/>No more gathering the team around your cell phone for a cramped conference call huddle. With terrific speaker quality, everyone can take a seat and comfortably get down to business. And when you’re done, our Bluetooth Speaker simply disconnects, making it perfect for shared, flexible-use spaces.<br/><br/>Our Bluetooth Speaker is one amazing multitasker. Tuned for state-of-the-art sound output, it moves effortlessly from conference calls to your own music playlist and back again—all while charging smart phones, tablets and more. For a speaker solution that really works—and really rocks, too—it’s Bluetooth from Byrne.",
"id": "10205",
"product_name": "Byrne Bluetooth Speaker",
"video_url": ""
}