{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10214",
"category": "Product > furniture: contract/case goods",
"company_name": "National Office Furniture",
"company_url": "www.nationalofficefurniture.com",
"description_html": "Tessera desks and storage offer modular design with versatile storage elements, allowing the user to tailor the product to fit their personal needs. The sleek and angular aesthetic promotes a vision of sophistication, while the vast array of storage offers smart solutions. Designed to be stunning, yet functional, the complete collection of Tessera storage, desks, occasional tables, and reception stations transforms an entire space into a minimalistic haven of urbanity.<br/><br/>Tessera’s unique storage options create efficient use of space. The unique, top access filing system puts important files within arm’s reach and the convenient sliding doors simply cover the filing system to keep spaces clean. These sliding doors are available with an integrated security option to protect working files, but not take away from Tessera’s clean lines. Boost the style factor even further by adding mixed materials to the sliding door fronts. <br/><br/>Open a whole new world of possibilities with Tessera’s unique drawer features. Full drawer fronts create a seamless vertical face to further highlight the clean vibe. Reveal various drawer configurations tucked away behind these drawer fronts. The drawer interiors are white which adds another pop of design creativity and further enhances its clean lines. <br/><br/>Designed to maximize vertical space and add interest, Tessera’s distinctive wall panel provides strategic placement of storage, shelves, surfaces, and lighting, resulting in an impressive layered aesthetic. Create a stunning backdrop for any workspace and make it functional with shelves and hanging storage units. <br/><br/>Tessera’s adjustable height desk adds extra flair and functionality. The desk simply raises and lowers with an easy to use keypad and reveals complementary or contrasting legs. Raise your worksurface to new heights for standing tasks or intermediate heights to accommodate personal preferences. <br/><br/>With reception stations that can be easily modified to meet specific requirements, Tessera reduces the need for costly and permanent millwork. This comprehensive series offers a solution to create a cohesive space that is as beautiful as it is functional. <br/><br/>Occasional tables are available in a variety of shapes and sizes and can be used to complete any space. Use these additional surfaces to create quaint meeting spaces, add to executive offices, or welcome guests in lobby areas. From a simple station to an executive setting, Tessera gives you all the pieces necessary to create a cohesive space.",
"id": "10214",
"product_name": "Tessera",
"video_url": "https://www.youtube.com/watch?time_continue=3&v=7-9FT9ky1EM"
}