{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10220",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "Thompson Contract, Inc.",
"company_url": "thompsoncontract.com",
"description_html": "It’s generally agreed that the Internet gives us fast access to just about everything we want, but sometimes you also just want to be able to instantly see what you’re looking for, without having to do a “deep dive.” That’s the idea behind Spec Cheque™.<br/><br/>The new offering from Thompson Contract, the U.S. partner for several of Europe’s leading high-quality seating and table manufacturers, is as unique as it is radical in this era of e-access: having a number of full-color photos of the company’s offerings, complete with specifications and other needed info, on card-stock and in an easily searchable binder.<br/><br/>Over the last ten years, the availability of product information on the Internet has diminished the importance of paper resources for most design libraries, but that availability has not eliminated the need for something that gives designers a quick overview of a product range or collection. And so Spec Cheque was born.<br/><br/>Designed to occupy minimal shelf space while delivering maximum resources to a design library, the system is comprised of a series of ‘Spec Cheque’ Books: one for chairs, one for tables, one for soft seating, and so on. Each is filled with a collection of Spec Cheques that provide images and a brief description of the company’s products, one per ‘Cheque.’ The chair Cheque Book, for example, has nearly 60 individual Cheques. Each details a featured product with attractive photos and construction facts, information that designers appreciate having when working on a project.<br/><br/>The term “Spec Cheque” was conceived to combine the concept of a “specification” — model, assembly, materials, finish, upholstery, accessories, etc. — with the need to verify (hence, “check”) the details. The European spelling of Cheque was used to emphasize the company’s multinational heritage while simultaneously amplifying the dimensions of the promotional piece. It actually looks like an oversized check.<br/><br/>Each Cheque is punched and held in place by aluminum rings in a binder. Perforations create a stub so the Cheque can be detached while the stub remains in the Cheque Book, to remind the user that one of the Cheques is missing and needs to be replaced. At the same time, the detached Cheque can be mailed, pinned to a tack board, placed on a presentation board, hung from a sample, or distributed during casual meetings. The entire package is environmentally friendly too. The Cheque Book is just pressboard – no vinyl cover – and the Cheques are coated with an aqueous finish that makes them completely biodegradable.<br/><br/>California-based graphic artist Glenn Barry — who has created a range of upscale solutions for major clients including Walt Disney Studios, Air Bud Entertainment and Studio A Records — was the lead designer on the project.",
"id": "10220",
"product_name": "Spec Cheque™",
"video_url": ""
}