{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10224",
"category": "Product > furniture: outdoor",
"company_name": "Tonik",
"company_url": "http://tonikworld.com",
"description_html": "According to Wikipedia, GOBY “are fishes of the family Gobiidae.” Gobi is also a desert within China and Mongolia. Neither one inspired the name of this collection, but we regress and present to you this series of commercial tables and chairs that embody organic simplicity. This series of indoor and outdoor furniture with a curvaceous signature shape has interplay of concavity and convexity, bringing optimal comfort and a revitalizing pop of color to any space. We have upped the style quotient by having a single tone version or adding a secondary color to the front. Technically speaking, GOBY is made of one-piece, rotationally molded, specially formulated, high-impact polyethylene with ultraviolet light stabilizers (to reduce fading). The commercial-grade polyethylene material is also FDA-approved, making it ideal for restaurants, food courts and entertainment facilities. It’s also chemically resistant to bleach, salt solution and chlorine solution and its Premium TruColor™ material is fully compounded for superior color and quality assurance. RIPTIDE has enhanced UV resistant formulation suitable for both indoor and outdoor use and is equipped with corrosion-resistant adjustable floor glides. It’s also GREENGUARD and GREENGUARD Gold Certified by UL Environment and is certified for low chemical emissions to UL 2818. UL.COM/GG. This series is part of the inaugural collection from TONIK, a new hospitality furniture brand wrapped around a full blown design statement that pushes beyond boundaries and transforms everyday spaces into funky slices of paradise that connect people. We’re also a designer collective and work with the best and brightest minds, including the uber-cool, industrial design-guru Karim Rashid. Tonik embodies the American spirit: we come from different backgrounds, we relish deep discussions of differing opinions that bring us closer together, we work hard with a can-do attitude, and we care about being good stewards to our next generations. And we do it in comfort and style. So take a trip. Take a dip. Take a sip. The world is a lot more interesting with a splash of TONIK.",
"id": "10224",
"product_name": "Goby",
"video_url": "https://www.youtube.com/watch?v=ZQHDj5gP5Ww"
}