{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10231",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "Impact Specialties",
"company_url": "www.impactspecialties.com",
"description_html": "Create a stunning space for your brand with character, texture, and quality. A real stone masonry alternative that is lightweight, durable and easy to install. <br/><br/>Arterra is a high-quality masonry alternative wall panel made with a real stone surface. With Arterra, you get the look, feel, and durability of masonry, while reducing installation time, labor, and material costs. Choose from five beautiful collections crafted with care and designed with precision, each with their own unique design <br/>and unmistakable character. <br/><br/>SURFACES MADE FROM REAL STONE <br/>A crushed stone surface made from natural minerals is molded and laid over a layer of high-density foam to create a lightweight stone panel <br/><br/>ARTISTIC FOCUS ON DETAIL &amp; AUTHENTICITY <br/>Inspired by the built environment and manufactured by artisans. Our process allows for the consistent reproduction of traditional stone &amp; brick as well as other architectural designs. <br/><br/>NATURAL FEEL &amp; COLD TO THE TOUCH <br/>The real stone surface has an authentic feel that is cold to the touch, just like natural stone, but without the weight and complexity of installation <br/><br/>Arterra’s light weight and interlocking edge enable any contractor to perform a fast, accurate, and ultimately high quality installation. The durable real stone surface composition means that it can be installed in interior and exterior applications, with the added benefit of incredible dimensional stability. <br/><br/>TOUGH IN ANY ENVIRONMENT <br/>Arterra is resistant to rain, snow, UV damage, heat, freeze, and defrost. Arterra has a zero percent water absorption rate, ensuring protection against moisture and humidity, all with Class B fire ratings. <br/><br/>LOW MAINTENANCE, UPKEEP, &amp; REPAIRS <br/>Save time and money throughout the product lifecycle with Arterra’s extremely durable surface that is easy to clean and maintain. <br/><br/>QUICK &amp; EASY INSTALLATION <br/>Our lightweight and easy to install panels are ideal for keeping budgets low while shortening the installation timeline",
"id": "10231",
"product_name": "Arterra",
"video_url": "https://www.youtube.com/watch?v=9SlRpfEmtA0"
}