{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10253",
"category": "Product > furniture: residential/storage",
"company_name": "Desiron",
"company_url": "https://www.desiron.com/",
"description_html": "Workshop/APD by Desiron marks New York-based architecture and design firm Workshop/APD’s first commercially available furniture collection and is largely inspired by American Craftsmanship and the power of man and machine. It highlights the strength and raw beauty of natural materials as exposed to the elements overtime with blackened steel, hand-charred woods and textured basalt stones and combines those natural pieces with modern black delrin and glass. <br/><br/>In bringing the collection to life, Desiron leveraged the skills and abilities of the artisans at its 30,000 square foot New Jersey factory experimenting with the ancient Japanese art of Shou Sugi Ban to create blackened wood while also developing a raw, gradient metal finish called “oil quenched steel” that creates an amber in both color and texture. <br/><br/>“In designing this collection, we were particularly inspired by the use of materials and how they tell the story of the artisans who manipulate them,” said Matt Berman, Co-Founder and Principal of Workshop/APD. “We were drawn to the idea of the craftsperson and chose to use textured stones, metals that show a natural patina and wood that was charred by hand using Desiron’s expert techniques.” <br/><br/>One of the standouts in this five-piece collection is the Bar Cart, designed to stand alone or serve as an accent piece in a residential living space. Each piece in this collection has a thin elegance in its line - like a drawing. Whether used for storing liquor, decanters, barware, or even used as a decorative piece to house candles, blankets, or other unconventional items for a bar cart – its sophisticated, sleek lines and rugged finishes, which are entirely customizable, lend an artistic point of view to interiors.",
"id": "10253",
"product_name": "Workshop/APD by Desiron Bar Cart",
"video_url": ""
}