{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10278",
"category": "Product > flooring: carpet/rugs",
"company_name": "Edward Fields",
"company_url": "https://www.edwardfields.com/",
"description_html": "Edward Fields, one of the world’s finest makers of hand-tufted rugs and carpets, takes a bold step in the design world with the launch of Reverence, a new collection designed in collaboration with the artist Fernando Mastrangelo. Known for his sculptures, furniture and large-scale wall works, Mastrangelo expands into fibers for the first time. A series of 12 new carpet concepts that reflect the visual vocabulary of his work are paired with the exquisite craftsmanship of Edward Fields artisans. The first living artist to collaborate with Edward Fields in over a decade, Mastrangelo has created dimensional expressions for the “fifth wall,” a term that Edward Fields himself coined in the early 20th Century. The works take a conceptual approach to rug making by transforming landscapes scouted throughout the United States into unique poetic compositions. “From the beginning, I wanted Reverence to articulate the visual language of nature and to convey a sense of wonder and respect for our physical world - all while celebrating the endurance of form and color,” Mastrangelo says. Reverence is about a record of our times. The landscape-inspired pieces crack, break, and flow to evoke a kind of realism that floats between abstraction and photography, watercolor and pastels. The palette of neutrals blends seamlessly into ombre colorations. Each fiber is meticulously planned and hand-sculpted by artisans at Edward Fields - from blended silk and wool yarns, to shag with low-pile contrasts, to surprising edging that defies right angles. The collection brings the same spirit of consideration seen in each grain of material in Mastrangelo’s sculptural works.",
"id": "10278",
"product_name": "REVERENCE by Fernando Mastrangelo for Edward Fields",
"video_url": ""
}