{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10355",
"category": "Product > (NEW) automotive: overall design",
"company_name": "Land Rover",
"company_url": "https://www.landroverusa.com",
"description_html": "Joining the Range Rover family slotted between the Range Rover Evoque and Range Rover Sport, the Range Rover Velar offers new levels of luxury, refinement and all-terrain capability to the premium mid-size SUV segment.<br/><br/>Created as a clean sheet design using Jaguar Land Rover’s Lightweight Aluminum Architecture, the Velar represents the next chapter of the Range Rover success story. The Velar is defined by a visually reductive approach in its design, which evolves the Range Rover DNA and previews the next generation of Range Rover vehicles.<br/><br/>Visually, the Velar is beautifully balanced with powerful proportions; a continuous waist line rises through to the taut tapered lines of the rear and a generous 113.15-inch wheelbase contributes significantly to both its elegant design and spacious interior. <br/><br/>Large alloy wheels – in particular the range of 22-inch designs – optimize the vehicle’s stunning silhouette, while further enhancing the dramatic presence of the vehicle.<br/><br/>Advanced technology is pivotal to the contemporary design: the full-LED headlights are the most slender ever to appear on a production Land Rover vehicle. The flush deployable door handles on the Range Rover Velar help emphasize a taut, elegant design language and contribute to a coefficient of drag of only 0.32Cd making it the most aerodynamically efficient Land Rover vehicle to date.<br/><br/>The interior of the Velar reaffirms ideals of elegant simplicity, sophistication and refinement. An unwavering belief in reductionism has been fully employed, with switches being kept to an absolute minimum to help create a calm streamlined sanctuary.<br/><br/>In order to achieve this elegant simplicity, inside, designers relied on a new InControl Touch Pro Duo infotainment system; the centerpiece of the vehicle‟s interior. Touch Pro Duo features two 10-inch high-definition touchscreens integrated seamlessly behind hidden-until-lit surfaces. These slim, intuitive displays work in harmony with the cabin architecture while adding an overall sense of modernity congruent with the vehicle’s reductive exterior design approach. All of this is equaled by the vehicle’s practicality: luggage compartment volume is 34.4 cu. ft. behind row two.<br/><br/>Offering greater choice to customers, a sustainable, premium textile seat material is available as an alternative to leather. The Dapple Grey material was developed together with Kvadrat, Europe’s leading manufacturer of high-quality design textiles, and is complemented with Suedecloth inserts in Ebony or Light Oyster. The Suedecloth fibers are created from recycled plastic bottles and crafted into a textured non-woven material that’s soft to the touch.<br/><br/>The Range Rover Velar and Velar R-Dynamic range comprises of four selectively available specifications including Standard, S, SE or HSE, with three powertrain options depending on trim. Customers can also specify Black and Premium Exterior Packs for an even more distinguished appearance.",
"id": "10355",
"product_name": "2018 Range Rover Velar",
"video_url": ""
}