{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10357",
"category": "Product > (NEW) automotive: concept car",
"company_name": "Jaguar",
"company_url": "https://www.jaguarusa.com",
"description_html": "The Jaguar I-PACE Concept is one of the most visually arresting concepts ever produced by Jaguar. Taking full advantage of the packaging freedom offered by electrification, the design and engineering teams took the opportunity to rethink the vehicle’s overall proportions.<br/><br/>The result is an exceptional vehicle that combines an advanced cab-forward design inspired by the Jaguar C-X75 supercar – incorporating the smooth silhouette of a coupe, in a five-seat SUV. The I‑PACE Concept embodies the technological advances under its skin – and the Jaguar design team’s belief that consumers are ready for bolder electric vehicle designs.<br/><br/>The electric drive system afforded the design team additional freedom to achieve the dynamic proportions on the I-PACE Concept. Leveraging the technological possibilities of electric driving, the I-PACE Concept introduces big design changes and finds fresh expression for the premium, personal touches and British craftsmanship Jaguar is known for.<br/><br/>Without an internal combustion engine and transmission tunnel to package, the design of the I-PACE Concept brings the cabin forward, extends the wheelbase and shortens the overhangs. This enables the silhouette to become more aerodynamic and the haunches to develop more powerful proportions. It also enlarges the interior space and improves vehicle dynamics and visibility.<br/><br/>As a result, the profile of the I-PACE Concept has more in common with the C-X75 mid-engine supercar than conventional SUVs. The evidence is clear in the cab-forward proportions, the dynamic heart line, curve of the front fenders, powerful proportions of the rear haunches and the large, purposeful wheels. Despite this, the overall footprint of the I-PACE Concept is as compact as a conventional mid-sized SUV. The long, 117.72 inch (2,990mm) wheelbase creates a voluminous interior with a level of rear knee room usually only found in full-size SUVs and luxury sedans.<br/><br/>The five-seat I-PACE Concept is a clear statement of plans for a production Jaguar model with future-focused design, pervading the open, spacious interior. It also showcases a blend of new technologies and traditional materials that characterize a vision for what a Jaguar electric luxury vehicle could be.<br/><br/>The I-PACE Concept is a perfect example of how much interior space the Jaguar cab-forward design and electric powertrain creates.<br/><br/>Jaguar cockpits have always been driver focused; the I-PACE Concept is no different. Inside, the cockpit is complemented by intuitive interface designs and advanced materials that reflect Jaguar craftsmanship in new and innovative ways.<br/><br/>The I-PACE Concept is very much a drivers’ car but the interior has been painstakingly crafted to ensure that all occupants share the sense of being in something special – that’s what being inside a Jaguar is all about. Luxurious, contemporary materials, perfectly executed surfaces and exquisite finishes are found throughout.<br/><br/>For most customers, the I-PACE Concept will be the first electric car they have owned. Research and innovations by the engineering and design teams have simplified the ownership experience and lowered the barriers to adoption. The electric motors, battery pack and management systems give the best possible performance and a useful range for most daily journeys.",
"id": "10357",
"product_name": "Jaguar I-PACE Concept",
"video_url": ""
}