{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10362",
"category": "Product > furniture: contract/desking",
"company_name": "BDI",
"company_url": "www.bdiusa.com",
"description_html": "Executive level design meets premium functionality with innovative design firm and manufacturer BDI’s latest addition to its home office collection—Kronos. Designed with superior functionality and eye-catching style by Matthew Weatherly, the Kronos collection includes a new sit+stand electronic desk, a Multifunction Cabinet and a Mobile Credenza.<br/><br/>For the latest in adjustable standing desks, Kronos elevates the sit+stand desk to a level suitable for hardworking executives. Thanks to an easy-to-use digital keypad that can be mounted on either side, users can<br/>adjust the desk from 24.5 inches for sitting, and up to 49.5 inches for standing heights -- providing the perfect position for any user. This allows for comfortable sitting when intense focus is necessary, or raised to a height better suited for standing and enjoying the health benefits associated with getting on your feet. <br/><br/>Aside from its functionality, Kronos is also beautifully designed for the executive space. Featuring an ultra-smooth work surface in a soft white that is smooth, durable and easy to clean, the desktop is offset by warm, natural walnut veneers on the fascia. A modesty panel, in the same natural walnut, complements seated use and keeps wiring neatly concealed. A motorized base with a minimal satin white finish completes the design and focuses attention on the upper levels, providing a floating aesthetic.<br/><br/>With storage in mind, a unique mezzanine shelf helps the workspace stay neat and clutter-free, while an included storage drawer with a flip-down front and non-slip lining makes an ideal space for a keyboard and other office essentials. The desk also boasts a wire management ledge and channels for routing cables out of site and out of mind. A power strip can also be mounted under the desktop with the supplied mounting kit,<br/>providing one convenient location for plugging in all peripherals.<br/><br/>Complementing the Kronos sit+stand desk is a Multifunction Cabinet, designed to be the ideal height so it can be easily accessed whether sitting or standing. The cabinet rests on locking wheels and includes a supply storage drawer, an adjustable paper shelf, a gliding printer tray, and secure file storage for hanging folders.<br/><br/>The collection’s Mobile Credenza provides secure storage within two storage drawers and a lateral file drawer for hanging folders. The beautifully finished console also rests on locking wheels and features adjustable shelves for storage and organization.",
"id": "10362",
"product_name": "Kronos Office",
"video_url": ""
}