{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10369",
"category": "Product > wall covering: fabric",
"company_name": "Elitis",
"company_url": "www.elitis.fr/en",
"description_html": "Peace is Elitis's fifth 3D wallcovering collection since they created this innovative technology in 2012. A jersey is placed and thermo-shaped on a special foam according to the different patterns of the collection. <br/><br/>Four brand new patterns make up this new collection, fully displaying Elitis's know-how and mastery of this craft. Our internal design team has worked on those patterns for 3 years to achieve the layered looks that are on this collection (as collections came out the technical know-how in relief and layers increased). Those patterns explore natural textures and seek to replicate random patterns that can be found either in handcrafted materials or in the wilderness. <br/><br/>The patterns:<br/><br/>Cascade: evoking petals cascading down a wall, this round pattern has a soothing effect. In three neutral colors (off white, light grey and black) it plays interestingly with light and shadows thanks to its plushness. Straight match 45'', 49'' wide<br/><br/>Vibrato: honeycombs, ancient crafts or pointillism, this pattern speaks to everyone differently. The imperfect hexagonal geometry brings interest and structure to the textured dot pattern. Pattern available in 4 colors, bright white, orange, army green or slate. Straight match 35'', 49'' wide<br/><br/>Touch: a very tough pattern to pull off given the amount of details involved, Touch brings chunky knits to walls. As its name indicates, it also brings up an irrepressible urge to feel its texture. Three neutrals (off white, grey and black) plus a bright green make up the colorways. Free match, 49'' wide<br/><br/>Wood: Sanded planks of wood come to life, where the grain of the virtual wood brings a modern yet rugged depth and warmth. Wood is available in 4 neutral colors (off-white, light grey, dark grey and black), and is a free match, 49'' wide<br/><br/>Aside of their aestetics, all of these products have strong acoustic advantages and have been tested accordingly: alphaW=0.20(H) performed according to ISO 354 and evaluated according to ISO 11654<br/>They have also received an A+ grade regarding indoor air emissions. They are suitable for hospitality and contract uses and easy to install and strip thanks to a non-woven backing.",
"id": "10369",
"product_name": "Peace",
"video_url": ""
}