{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10382",
"category": "Product > flooring: carpet/modular",
"company_name": "Patcraft",
"company_url": "http://www.patcraft.com",
"description_html": "Material Paradox plays with the concept of conversing inverses and discovering harmony in tension by using light to enhance pattern and add textural and visual depth. An innovative modular collection that brings a rich, tactile feel to the built environment, products are available in 18” x 36” and 9” x 36” planks and 10 colors. Within the collection, the patterns of each style, Back Lit, Nocturne and Color Filter, have been designed to coordinate, creating transitions and contrasts that offer designers flexibility in exploring combinations to punctuate spaces and create moods. <br/><br/>Using contrast to enhance the pattern, Back Lit features a soft ombre pattern muddled with hints of light and shadow. Nocturne uses tip-shear to create textural patterning that portrays visual depth, and shadow creates the pattern where lack of light enhances the texture. Playing with contrast that helps us achieve balance and dictate how we view texture, Color Filter combines an overlay of pattern on an ombre base where color filters are applied to create scale and pattern. <br/><br/>Material Paradox products are combined with color filters that are overlaid creating scale and contrast to achieve balance within a space. Cradle-to-Cradle Certified with guaranteed reclamation and recycling, materials have been assessed for human and environmental health, ensuring they are safe for use across multiple lifecycles. Featuring an extreme TARR rating, Material Paradox offers a beautiful design option within high-demand environments.<br/><br/>A delicate, powerful balance of elements, Material Paradox highlights how whole worlds are brought to life in black and white and in light and shadow.",
"id": "10382",
"product_name": "Material Paradox",
"video_url": "http://neocon-dev.patcraft.com/wp-content/uploads/2017/06/Material-Paradox-no-titles-20mbps.mp4"
}