{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10459",
"category": "Product > lighting: chandelier (multiple bulbs)",
"company_name": "Maple Lighting",
"company_url": "http://www.maplelighting.ca/",
"description_html": "Vancouver has a number of features that define its physical beauty, including its parks, the surrounding local mountains and bodies of water, as well as the stars that light up the sky during the night. In order to reproduce this stunning view of stars, a radiant light fixture was created to leave an impression on visitors of the presentation centre. This seven-chandelier showpiece design is based on the seven Asteres Planetai of ancient Greek myth, referring to the planets that are visible to the naked eye. To illustrate this, each four-pointed star chandelier is surrounded by a circular inlay of metal trims. Suspended from polished black metal, the seven chandeliers allude to our neighbouring planets shining brilliantly in the night sky.<br/><br/>The seven repeating chandeliers convey a seamless motion across the ceiling, prompting viewers to follow along with the design. The black mirror plate provides a distinct contrasting backdrop --adding emphasis to the lights. The light design spreads further into the physical space by manifesting downwards through illuminated columns, culminating into its own reflection in a polished marble floor. The fluid light movements across the room help achieve a sense of unity and balance. <br/><br/>As the primary space in the presentation centre, the sales area plays a multifaceted role. It provides an excellent first impression while simultaneously serving as a business space. This feature scales perfectly with the grand room. With the extensive use of naturally appealing, luxurious finishes in the open sales area, it was only appropriate to complement this with the right quality and energy of lighting; working to embrace the centre's visitors with open arms.<br/><br/>A chandelier of this magnitude had two primary issues: time and cost. Our extensive experience has taught us that good planning and preparation is always key. The design and installation of the chandeliers needed to be realistically achievable within a relatively short time frame. To ensure a timely completion, we maintained a constant line of communication with project consultants to coordinate key items as quickly as possible while providing an efficient, sensible construction schedule to prevent delays. In using a tried and true design feature repeatedly, it ensured that production and installation costs were curtailed. Practical elements such as the mechanical air supply and return grills were designed to be almost invisible. They were structured to flow seamlessly with the light fixture, while the inlay of metal trims was designed simultaneously as a core visual element and essential structural support.",
"id": "10459",
"product_name": "Intergalactic",
"video_url": ""
}