{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10493",
"category": "Product > (NEW) packaging",
"company_name": "Hennessy",
"company_url": "http://hennessy.com/",
"description_html": "Hennessy, the world’s best-selling Cognac, was proud to reveal the Hennessy X.O 2017 limited edition bottle by Marc Newson in June 2017. As distinctive as a work of modern architecture, the new design amplifies the blend inside – unchanged since 1870 – while placing Hennessy X.O on a modern aesthetic frontier. Hennessy X.O is the original “Extra Old” Cognac, created by Maurice Hennessy in 1870. <br/><br/>Hennessy X.O Limited Edition by Marc Newson is a modern take on a classic bottle and a timeless blend.<br/>Internationally renowned designer Marc Newson has reinterpreted the classic Hennessy X.O bottle, with the elegant simplicity that forms his signature style. The result is a modern twist on the iconic shape, a sleek design that embodies the essence of the original X.O Cognac. His challenge: how can a bottle tell the story of taste and awaken the senses? His answer: a design that makes us experience the blend, even before pouring a drop. A subtle series of curved lines catch the light, revealing infinite warm shades, hinting at the odyssey of flavors that awaits within.<br/><br/>Newson’s limited edition design gives the signature Hennessy X.O bottle a wholly unexpected twist. Once he had pared the bottle’s shape to its purest form, the designer chose to reprise its traditional decorative motifs – grapes and leaves – in a corrugated relief. These striations are perhaps the most daring design elements ever incorporated on the iconic Hennessy X.O bottle. <br/><br/>To reinforce the modern spirit of the new Hennessy X.O bottle, Newson and Hennessy reached beyond the usual confines of spirit bottle design to create a modern gift box presentation. To dramatize the fusion between the blend and the glass, Newson designed a clear transparent gift box, requiring cutting-edge manufacturing. The outer packaging design perfectly conveys Hennessy X.O’s forward-looking spirit. The clear, ergonomic shape is molded in a complex plastic more typically used for perfume bottles.<br/><br/>The limited edition design perfectly complements the Hennessy X.O multi-faceted, sensorial taste experience. Simultaneously both elegant and complex, the original X.O Cognac is aged and blended to be bold, rich and persistent.",
"id": "10493",
"product_name": "Hennessy X.O Marc Newson",
"video_url": "https://youtu.be/iZoY0kP4sZ8"
}