{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10508",
"category": "Product > flooring: tile and stone",
"company_name": "Fireclay Tile",
"company_url": "www.fireclaytile.com",
"description_html": "Handmade in California using time-honored techniques, Fireclay Tile’s Agrarian Collection is a tribute to the place the company calls home. <br/><br/>“Inspiration for the Agrarian Collection was right in our back yard,” said Jamie Chappell, Creative Director at Fireclay Tile. “Looking to the rich heritage of agriculture that surrounds our factory in Aromas, CA, the Agrarian Collection pays homage to a place that brings our story to life.”<br/><br/>In designing the collection, Fireclay’s team was moved by aerial photography of geometric crop formations in Aromas, and the diverse agricultural patterns that are revealed when seen from a bird’s eye view. From 10,000 feet above the earth, a variety of shapes, colors and sizes come together to make an idyllic patchwork quilt-like scene, which directly inspired Fireclay’s designers. <br/><br/>The collection’s eight bold patterns, ranging from linear grids to circular pivots, highlight the dynamic yet structured patchwork of fields, while its three colorways are representative of land use in the region, as well as the elements of nature that are key to agricultural production: the Warm motif pays homage to the earth and soil, the Cool motif the rain, and the White Motif the sun and sky.<br/><br/>The Agrarian collection also represents Fireclay’s commitment to sustainability, environmentally friendly manufacturing processes, and the preservation of Aromas’ natural beauty by using resourced local materials. <br/><br/>These large-format 8x8” tiles are painted by hand with 100% lead-free glazes on a Fireclay's signature Recycled [red] clay body, which is made up of a minimum of 50% recycled products including post-consumer recycled porcelain and glass, as well as pre-consumer recycled granite dust. In addition, the brand recycles their own tile and glaze waste to be re-incorporated into their recycled clay bodies. <br/><br/>The collection's geometric designs are ideal for creating impactful focal points in residential and commercial environments alike – mix-and-match for a unique tile landscape, or choose a single pattern to create a striking feature installation. <br/><br/>The Agrarian Collection is suitable for both indoor and outdoor use in temperate climates, and for flooring as well as wall surfacing applications. However one chooses to use Agrarian, the collection’s versatile patterns and color motifs offer endless possibilities for self-expression, while simultaneously telling the story of Fireclay Tile and the place that makes its story possible. <br/><br/>For more information and images, please visit: https://www.fireclaytile.com/handpainted/agrarian/.",
"id": "10508",
"product_name": "Agrarian Handpainted Collection",
"video_url": "https://vimeo.com/225273230"
}