{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10518",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "California Faucets",
"company_url": "www.californiafaucets.com",
"description_html": "When launching their new line of single-lever bath faucets, California Faucets wanted to rise above the “noise” of today’s competing marketing messages. This inspired the company to create Aqua Pella, a memorable video campaign that stands head and shoulders above other messages in today’s chaotic media.<br/>Aqua Pella depicts the new single-lever faucets endowed with human voices and personalities in a The Voice-like singing audition. The headliners stepping up to the stage in the video include the clean-lined Arpeggio, the geometrically inspired Bel Canto, and the sleek Zen-like Morro Bay. <br/><br/>With a personality to match their distinctive design, each of the Pixar-character inspired faucets “comes to life,” determined to achieve its goal of making the pages of the California Faucets product catalog. When the camera zooms in on Arpeggio, the cylindrical standout in Satin Nickel, and Morro Bay, an architecturally bold style in Oil Rubbed Bronze, both faucets contribute their Bass and Contralto voices to the harmony. Also playing a leading role is the Bel Canto, which in Polished Nickel sublimely uses its deep Baritone voice á la Barry White.<br/><br/>Inspired by the success of the Pitch Perfect film series and popular musical TV comedies like Glee, Senior Vice President of Marketing and Sales, Noah Taft, a former writer and TV/film producer, focused on humor to captivate the audience. “It struck me: Why not let a group of animated faucets create the same type of a cappella magic?” Taft says. “The video stands out among the typical marketing messages in our industry that are designed to sell first and entertain last.”<br/><br/>Goals for the video included: increase product and brand awareness among California Faucets retailers, designers, architects, custom builders, and the consumer; have Aqua Pella “go viral” via social media and within the typically conservative Kitchen &amp; Bath industry; make the leap from electronic media and in-showroom videos to television in all major U.S. markets. Aqua Pella accomplished all of this, and more. <br/><br/>The ad has run on multiple local TV markets, primarily on HGTV and the Food Channel, in select areas of New York, California, Arizona, Oregon, New Jersey, and others. It has also run in New England on NBC during a timeslot preceding The Today Show. Thanks to the Aqua Pella video, a record-breaking number of California Faucets resellers feature the new faucet collection in their showrooms. Plus, assisted by the company’s Social Media and PR campaigns, the video has resulted in an overwhelming increase in “word of mouth” brand awareness for both California Faucets and its Single-Lever Bath Faucet designs. <br/><br/>In a market not typically known for using CGI animation and guerilla marketing tactics, producing the Aqua Pella video was a bold move. The remarkable results of the Aqua Pella video marketing campaign has proven that bringing a product to “life” by creating characters that inspire an emotional connection is an engaging, memorable, and fun way to promote an everyday commodity.<br/><br/>View the Aqua Pella video here: https://www.youtube.com/watch?v=fiMal20GaUE",
"id": "10518",
"product_name": "Aqua Pella",
"video_url": "https://www.youtube.com/watch?v=fiMal20GaUE"
}