{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10510",
"category": "Product > seating: contract/lounge",
"company_name": "BuzziSpace",
"company_url": "www.buzzi.space",
"description_html": "Created by Dutch designers Wiebe Boonstra and Marc van Nederpelt of DUM Office, BuzziCane is a soft lounge collection that combines modern comfort with fun, retro materials and updated aesthetics. <br/><br/>With a woven cane back, wood base, and plush upholstery, the BuzziCane sofa brings a fresh, vintage-inspired look into contemporary environments. <br/><br/>Conceived around DUM Office’s design philosophy, “Sprezzatura,” which is defined by “a certain nonchalance, so as to conceal all art and make whatever one does… appear without effort,” BuzziCane has a simple, welcoming appearance that invites one to sink back and relax. <br/><br/>Also a hallmark of both DUM Office and BuzziSpace is the sofa’s playful and clean, yet edgy design – with a firm, elevated structure and natural rattan inserts that harmoniously contrast with the soft, comfy seat and back cushions, BuzziCane successfully walks the line between vintage and contemporary, formal and informal, making it an innovative and incredibly versatile piece. The design achieves this balance through the untraditional way in which natural rattan — BuzziCane’s most traditional material — is incorporated into the seat’s design, by emphasizing its openness and braided structure. Additionally, by having BuzziCane’s sleek curved ash wood frame “drip off” into the loose, informal pillows of its seat and back, the sofa provides an enticing, welcoming atmosphere, without entirely shedding its formal characteristics. <br/><br/>As a result of its multi-faceted design, BuzziCane is well-suited for many different types of environments, from lounge seating in private offices and collaborative workspaces, to hospitality settings and residential homes. It is also available as a one, two, or three seater, and in a wide range of colorful upholstery options, to meet the spatial and aesthetic needs of any space. In addition, its frame can come either in an ash natural, or an ash black stained finish. <br/><br/>With a highly adaptable personality and appearance, BuzziCane was designed in direct response to the changing state of the workplace – companies are gravitating away from the formal, and towards more comfortable, residential-inspired spaces that foster wellbeing, collaboration, and personal expression. BuzziCane’s reassuring, unpretentious atmosphere not only facilitates these values, but also addresses the larger, growing necessity for flexible designs. As the line between work and life becomes increasingly blurred, versatile and highly functional products that can meet the needs of both have become crucial to the modern workforce. BuzziCane represents BuzziSpace’s shift towards such products that can toe the line between residential and contract, without sacrificing aesthetics or functionality.",
"id": "10510",
"product_name": "BuzziCane",
"video_url": ""
}