{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10540",
"category": "Product > accessories",
"company_name": "TWYLA",
"company_url": "www.twyla.com",
"description_html": "Twyla is on a mission to change the way people discover and buy art. The company, which launched in October 2016, offers exclusive, museum-quality limited edition prints by artists hand selected by Twyla’s expert curators. They collaborate with premier artists from around the world, using cutting-edge technology to produce stunning fine art prints that range from $250 to just over $5,000. The company prides itself on their personalized art advisory, framing, packaging and home installation available in over 20 cities. Twyla’s also offers a trade program, where it not only provides its member interior designers and architects a competitive discount on Twyla pieces but also dedicated account managers, access to top curators and complimentary rendering services. <br/><br/>Twyla’s limited edition prints are available in a range of styles, from figurative painting and photography to multimedia collage and abstract works. The company’s international roster of artists have shown in prominent museums and galleries around the world including the Gagosian Gallery, LACMA and The Whitney Museum. <br/><br/>Twyla is dedicated to working with both emerging and established artists, as evident through our unique collections and blue-chip artist releases. In July 2017, Twyla released their first official collection in partnership with Pharrell Williams’ multi-media creative company, i am OTHER. The Twyla x i am OTHER collection includes accessibly priced limited edition prints from M. Tony Peralta, Angelica Hicks and Freegums. Each has a singular voice, but they are connected through their graphic, pop-infused work and unique journeys to becoming artists. <br/><br/>At this year’s Context New York art fair, Twyla debuted a limited edition print from Stanley Casselman’s Luminor series of paintings created in the manner of Gerhard Richter. This series and his Inhaling Richter series followed Casselman’s response to New York Magazine’s art critic Jerry Saltz’s call to artists to paint a “perfect fake” Richter painting. Casselman’s ensuing body of work proved wildly successful, with one piece earning approximately $210,000 at auction. The company is currently working with renowned artist and poet John Giorno to release an exclusive series of signed prints. Giorno has always used his poetry to push beyond the page, and he’s known for transforming his words into ground-breaking performances, installations and multimedia experiences since the 1960s. <br/><br/>Twyla generates a new, incremental revenue stream for its artists through the collaborative creation and sale of fine art editions. Twyla has participated in numerous live artist-led activations at art fairs including Art Wynwood in Miami, interior design fairs including High Point Market in North Carolina and Design Industries Foundation Fighting Aids’ (DIFFA) Dining by Design and design shows including Sight Unseen OFFSITE and Market Art + Design. Twyla differentiates itself from competitors by either participating in art fairs in unexpected ways or participating in engaging experiences outside of the traditional art market, inviting a wider audience to discover and buy contemporary art. Twyla’s exhibits at DIFFA and OFFSITE garnered impressive media attention and positive feedback from both consumers and trade professionals.",
"id": "10540",
"product_name": "TWYLA.com",
"video_url": "https://twyla.box.com/s/17vxw03vyybkr53jnv5yfzqkr891kmcv"
}