{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10559",
"category": "Product > furniture: healthcare",
"company_name": "The Habit Furniture",
"company_url": "www.thehabitfurniture.com",
"description_html": "Owing to the scant space and limited time, Hong Kong people are less motivated to exercise daily. Combining the elements of fitness and furniture, interior designer Glory Tam &amp; home doctor Albert Au from Hong Kong designed the Habit Furniture series in order to encourage people to workout at any moments they want in the comforts of their own homes. <br/><br/>Recently, this product is live on Kickstarter as a crowdfunding project from 28 August to 12 October, 2017. Through crowdfunding, we hope to share our creativity with the whole world and get ready to launch more fitness furniture in the future.<br/><br/>TheHabit bench is a multifunctional furniture which can be served as a coffee table or a fitness bench. People can workout whenever and wherever they want by just flipping the bench at home. The modern polygonal design and natural colour scheme make it more compatible with different home styles. On the v-side of the bench, a charcoal grey vinyl elastic cushion is installed for the workout purpose. It is easy-cleaned and perfect for workout. <br/><br/>TheHabit bench is made of plywood, arranged in a direction perpendicular to each other with walnut veneer cover. We chose to use plywood not only because it retains the texture of the natural wood, but also of its high strength, which is effectively resistant to deformation. The plywood-made bench is also light in itself -- it weighs only about 25kg so you need not worry if it is too cumbersome to flip. At the same time, in order to ensure theHabit bench can safely support the user during workout, stronger plywood with higher density -- blockboard is used.<br/><br/>Dimensions of the bench: W135cm x D35cm x H45cm",
"id": "10559",
"product_name": "TheHabit bench",
"video_url": "https://youtu.be/S-3vY054Mqk"
}