{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10596",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "Glen Raven Custom Fabrics",
"company_url": "sunbrella.com",
"description_html": "The fabric industry hasn’t seen a revolution in sample making in a long time – until now. Glen Raven Custom Fabrics is changing the way its line of Sunbrella® fabrics is displayed and sold with the new Elements fabric book and swatch card.<br/><br/>Elements is a curation of essential textiles. The 220 fabrics in this collection are the foundational pieces for design and are featured in the Elements fabric book on a three-year rotation. <br/><br/>Traditionally organized in coordinated groupings, the new fabric book showcases the foundational fabrics by color to make it easier for designers and consumers to quickly locate fabrics in their desired palette. Three stacks of large sample sizes feature solids, stripes and jacquards, and textures.<br/><br/>The fabric book was specially engineered for tabletop display with the front cover folding out allowing the book to stand on its own like an easel. This concept was inspired by the large ‘show horses’ the Sunbrella design team uses to present new fabrics.<br/><br/>The branding was inspired by the periodic table. Just as the elements in the periodic table are foundational to our existence, the fabrics in this collection act as foundational elements in design. The simple, clean typography plays with metallic and natural finishes and is screen printed on Arrestox® for a natural cloth feel. The design is intentionally understated, allowing the fabrics to speak for themselves.<br/><br/>The swatch card is a smaller sales tool ideal for portability. The card folds out, featuring small fabric swatches of solids and textures, and printed images of jacquard and stripe patterns that have larger repeats. The swatch card utilizes PLIKE® Papers, unique stock that embraces touch with an enticing texture. The choice of this material was also intentional, representative of Sunbrella’s fiber whose color goes all the way to the core.",
"id": "10596",
"product_name": "Sunbrella® Elements: a Curation of Essential Textiles",
"video_url": ""
}