{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10608",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "Glen Raven Custom Fabrics",
"company_url": "sunbrella.com/makers",
"description_html": "The Makers Collection embodies principles shared between time-honored handweaving and modern manufacturing, bringing the character of traditional artisan techniques to the industry. Fabrics in Makers incorporate the performance qualities of Sunbrella with authentic designs tied to generations of makers. The collection portrays the importance of preserving the conventional element of craft while advancing technologically. By combining new, experimental techniques with traditional style, the artisan fabrics are perfectly suited for both indoor and outdoor upholstery.<br/><br/>Organized in coordinated groupings or trend stories, the fabric book shows how the fabrics might be used or paired together. The fabric book was specially engineered for tabletop display with the front cover folding out allowing the book to stand on its own like an easel. This concept was inspired by the large ‘show horses’ the Sunbrella design team uses to present new fabrics.<br/><br/>The fabric book’s cover features blue magenta Arrestox® for a natural cloth feel, with magenta red text screen printed on top for a modern, makers feel. The design is intentionally understated, allowing the fabrics to speak for themselves.<br/><br/>In conjunction with the fabric book, the swatch card acts as a smaller sales tool ideal for portability. The card folds out, featuring small fabric swatches of solids and textures, and printed images of jacquard and stripe patterns that have larger repeats. The swatch card utilizes PLIKE® Papers, a unique stock material that embraces touch with an enticing texture. The choice of this material was also intentional, representative of Sunbrella’s fiber whose color goes all the way to the core.",
"id": "10608",
"product_name": "Sunbrella® Makers Collection",
"video_url": ""
}