{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10602",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "Vanderbyl Design",
"company_url": "www.vanderbyl.com",
"description_html": "Design Does Matter: The True Measure of a Space is How it Makes Us Feel is the latest publication from leading international furniture manufacturer Teknion. The volume is an anthology of essays by noted design professionals, scholars and writers – each with his or her own angle of vision, but who hold in common the conviction that design does, indeed, matter. Authors were chosen specifically for their diverse backgrounds and perspectives in order to give readers a multi-faceted picture of the elements that influence how spaces make us feel. Human psychology and memory, as well as color and materiality are some of the lenses contributors used to convey their ideas. The book was published with a goal to advance awareness and understanding of the various roles design plays in the workplace and why the investment in design can benefit a company’s culture, productivity and financial performance. <br/><br/>The True Measure of a Space expands upon the conversation currently taking place around workplace design, one proposing that human factors such as wellness and happiness are crucial elements of workplace design. The book is centered around the idea that how we apply elements of design to a space can change the way we feel. Design can create a more positive experience, one that nurtures creativity and productive collaboration. Featuring a discussion across the types of spaces encountered in the modern office over the course of a workday, The True Measure of a Space, proposes that feeling welcome, empowered, connected, calm and comfortable helps people do their best work.<br/><br/>Photography created for the book illustrates the proposition that materials and forms, colors and textures, influence our experience of a space by communicating ideas and evoking emotions. In 1997, Teknion debuted a new corporate identity and developed advertising and collateral featuring the “Rocket Man,” who became an icon of the company’s focus on the future of business. Since that time, Teknion has often used whimsical illustrations and sophisticated concept-driven photography to accompany and provide visual commentary on the text of books like “Co-Create” and “Higher Learning.” Teknion continued that tradition in the first of the Design Does Matter series, which relied on light hearted sketches to support the concepts. Photography, rather than hand drawings, illustrates concepts or specific feelings in The True Measure of a Space as the text references real environments and thus, required the rich sensory connection that photography provides. Each image has multiple layers of meaning, as well as a wit and charm that makes the subject matter accessible and appealing. These stylized images also carried over to Teknion’s spectrum of marketing initiatives including showroom displays, advertising and website.",
"id": "10602",
"product_name": "The True Measure of a Space is How it Makes Us Feel",
"video_url": ""
}