{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10604",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "Studio TK",
"company_url": "www.studiotk.com",
"description_html": "Studio TK offers contemporary office furniture to the corporate, hospitality and academic markets, with an exclusive focus on social applications. Following a rebranding, Studio TK’s Social Spaces IQ-EQ Magalog was introduced in 2017, with two goals. First, the magalog needed to establish the brand’s point of view on why social spaces are important for promoting the work culture. Second, Social Spaces had to also showcase the brand’s portfolio of products and emphasize new introductions. It was this combination, one of perspective and product, serving as both thought leadership piece and sales tool, that became the motivation to create the Social Spaces IQ-EQ magalog. <br/><br/>The magalog is divided into two thoughtful sections — IQ and EQ. The logic – IQ – and the poetics – EQ – of product and space are what begins to outline Studio TK’s design approach, which in turn became the opportunity to frame the larger brand narrative. This structure served not only as the basis for the magalog content, but also the physical construction of the entire magalog. Much like the ideas behind IQ, there was logic in how the narrative was paced out and how readers would experience it. By utilizing a mixture of uncoated color paper stocks, the magalog introduces ideas around craft and materiality that bring an EQ-inspired resonance to the entire reading experience. As a subtle nod to Studio TK’s belief that no two workplace cultures are alike, varied color combinations in the opening pages, accompanied by a mixture of bold and thin faces of the brand typeface, create a natural hierarchy, affecting the narrative flow and cadence. While most of the layouts show consistency, each editorial piece takes on a life of its own, leaving room for expression to further carry out the story’s message.<br/> <br/>The overall theme of Social Spaces was further developed by Studio TK’s leadership, product development and sales teams to better understand how the market was reacting to each new product launch. Visually, the photographic assets show the breadth and versatility of each product line, as well as the spatial context for using each product, reinforcing the notion that Studio TK’s portfolio is flexibly considered to serve the diverse needs of different work cultures.<br/><br/>Social Spaces signals a seriousness and maturity for the brand — a provocative, inherent confidence is recognized from the cover and throughout the pages that follow. With this magalog, Studio TK makes it clear that spaces and products do not make a workplace culture, but instead contribute to it. Addressing this first hand allowed the brand to put forward a differentiated vision for how the products can facilitate and encourage a thriving work culture, further reinforcing the underlying truth that Studio TK is driven by a bigger north star and seeks to understand the power and potency of the work culture in order to inform how it can design products and spaces that unlock a work culture’s innate potential.",
"id": "10604",
"product_name": "Social Spaces IQ-EQ",
"video_url": ""
}