{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10613",
"category": "Product > wall covering: contract",
"company_name": "Resource Furniture",
"company_url": "http://resourcefurniture.com",
"description_html": "We are proud to introduce Botanicals, a new wallcovering collection from celebrated Norwegian creators of ConcreteWall, Art Director Lena Johnsen and Photographer Tom Haga. Both striking and serene, Botanicals captures the beauty of Mother Nature in 700 unbelievable Megapixels. Available in ten dramatic motifs, Botanicals offers infinite possibilities for residential and commercial spaces.<br/><br/>Botanicals is a one-of-a-kind wallcovering collection with the power to transform any space from blasé to extraordinary.<br/><br/>•\t700 Megapixel images<br/>•\tMax 16’ x 45’ without repeat<br/>•\t10 exclusive styles<br/>•\tZoom and crop for unique look<br/>•\tResidential or commercial use<br/>•\tEasy to apply and remove<br/>•\tScratch-resistant, light-resistant <br/>•\tNon-flammable, washable<br/>•\tQuick lead time<br/><br/>The collection features five different plants, including:<br/><br/>Alocasia<br/>Native to rainforest regions, Alocasia is characterized by giant heart-shaped leaves that are often used as impromptu umbrellas in tropical downpours.<br/><br/>Papaver<br/>Throughout history, Papaver has been widely used for its medicinal purposes. It has been believed to promote sleep, relieve indigestion and ease respiratory ailments.<br/><br/>Helleborus <br/>Defined by its dramatic flowers, the Helleborus has made a name for itself in myths and legends. In Greek Mythology, Helleborus was used to cure the madness of King Midas’ daughters after being cursed by the god Dionysus and on the flip side, is rumored to have been used to poison Alexander the Great.<br/><br/>Nelumbo<br/>Nelumbo, sacred to both Hindus and Buddhists, is an aquatic plant that is also a symbol of wellness. Plus, it’s a source of food! The rhizomes and seeds can be popped and eaten like popcorn.<br/><br/>Eryngium <br/>Eryngium is a symbol of admiration. In addition to their ornamental nature, Eryngium is used as an anti-inflammatory supplement, herb for food and an essential oil. It’s even used as a remedy for scorpion stings.<br/><br/>Botanicals is a one-of-a-kind wallcovering that has the power to transform any space from mundane to extraordinary.",
"id": "10613",
"product_name": "Botanicals",
"video_url": ""
}