{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10621",
"category": "Product > window treatments",
"company_name": "MechoSystems",
"company_url": "mechosystems.com",
"description_html": "The MechoSystems WhisperShade® DC Electronic Drive Unit is the powerful and very quiet low-voltage motor for shades that’s compatible with the MechoNet™ operating system used in roller shade automation. The WhisperShade DC motor offers addressing, customizable preset shade positions and rotation speed. The motor features built-in networking capability and can be used in locations where other MechoSystems motors are used or in areas that require a DC powered motor. The special bracket system insures virtually silent operation.<br/><br/>The WhisperShade DC Electronic Drive unit offers designers and specifiers another motor to choose from when specifying shading systems. Now, in addition to line-voltage, the new low-voltage motor will offer superior lifting capability (40 pounds, shade at a max height of 24 feet), while being super quiet! <br/><br/>The addressing functions and compatibility with MehcoNet™ ensure shade automations for office or whole-building can be done effectively. The DC motor will enable many more installations of motorized or automated shades due to easier installation and not needing electrical service at 120VAC. Shade control can be done automatically, by wired switch, or by wireless switch. The motor features a soft start and stop and a variable speed control and 16 preset positions for precise shade alignment. The motor is virtually silent and tests &lt;38Db. Control can be done via local switching (wired or wireless) or via commands sent on the network via the unique address each motor will have. Networking also easily enables zoning of motors when under central control. A complete family of power supply options are available ranging from discrete power supply transformers to a ten-unit power panel. <br/> <br/>The low voltage WhisperShade DC Electronic Drive Unit enables shade automation to occur in spaces where the installation of line voltage motors was difficult due to professional electrician labor expenses or due to construction issues dictated by the pre-wiring for 120 VAC powered roller shade motors. Shade automation fosters daylight integration which saves energy and the use of daylight promotes circadian rhythm and combat Seasonal Affective Disorder (SAD). Promoting Daylight is often an earned LEED point.<br/><br/>The unique DC motor offers support, tight edge clearance and is designed to minimize vibration and noise via coupling to building structure. The minimal edge clearance (7/8 inch) is same at drive, idle, and center support brackets resulting in a symmetrical placement on the window. The movement of the shade motor when installed with the special DC bracket results in a noise measurement of &lt;38db. The matched sound-absorbing brackets are available with or without a clip for Fascia.",
"id": "10621",
"product_name": "MechoSystems WhisperShade® DC Electronic Drive Unit (motor)",
"video_url": "https://app.frame.io/f/2xg4zlcJ"
}