{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10626",
"category": "Product > textiles: residential",
"company_name": "Glen Raven Custom Fabrics",
"company_url": "sunbrella.com/pendleton",
"description_html": "Born from the idea of bringing two heritage brands together, the Pendleton by Sunbrella® collection combines Pendleton Woolen Mills’ distinct Native American-inspired aesthetic and the enduring performance qualities of Sunbrella fabrics –easy care, fade proof, and bleach cleanable.<br/><br/>The Pendleton brand is deeply rooted in American heritage and is synonymous with quality and craftsmanship. Those qualities are also at the core of the Sunbrella brand as a pioneer and leader in the textile industry.<br/><br/>The collection is comprised of 53 fabrics and is grounded by five hero patterns: Lahaina Wave, Eagle Rock, Canyon Lands, Zapotec and Mountain Majesty. The hero patterns are supported by a range of textural solids and coordinating patterns.<br/><br/>Lahaina Wave combines traditional tribal-influenced designs from the Hawaiian mainland with blue and turquoise representing the waves of the beaches near Lahaina, Maui. Outlined in a sawtooth design, the pattern evokes the power and challenges of the surf.<br/><br/>Named after a mountain summit in Apache County, Arizona, Eagle Rock incorporates Native American design elements and weaving traditions of the Southwest. The pattern features a defined center element highlighted against a solid background and reflected side motifs on a striped ground, exhibiting an artful sense of movement.<br/><br/>Inspired by Utah’s tall pinnacles of rock that form breathtaking vistas along the skyline, Canyon Lands uses a modern ombré weave to create rich layers that mimic the movement of sunlight dancing across the canyons.<br/><br/>Zapotec gets its name from the Zapotec Indians of Oaxaca, Mexico, who established a tradition of weaving colorful cloths using natural dyes from plants and animals. The pattern features classic geometric designs and elegant simplicity.<br/><br/>Symbols derived from Navajo Native Americans are complemented by quiet colors that evoke the evening light in Mountain Majesty. The pattern symbolizes the mountains of the western landscape and their significance to the Navajo tribe.<br/><br/>The collection – whose story unfolds across the plains of American history – is available to the trade through Pindler.<br/><br/>“Partnering with both Pendleton and Sunbrella is a designer’s dream,” said Elise Connor, director of design for Pindler. “We are very excited to present this collection to the design trade which combines two major design trends, the iconic designs from our American heritage and performance fabrics, both in high demand within the marketplace.”",
"id": "10626",
"product_name": "Pendleton by Sunbrella®",
"video_url": ""
}