{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10622",
"category": "Product > textiles: outdoor",
"company_name": "Glen Raven Custom Fabrics and Thibaut",
"company_url": "thibautdesign.com",
"description_html": "Bring the outdoors in with Oasis, a collection of Thibaut’s coordinated Sunbrella® indoor/outdoor soft and luxurious fabrics. The high-performance fabrics in this vibrant collection are lightfast and stain resistant, offering long-lasting beauty and durability.<br/><br/>Boardwalk is a simple and dimensional nautical stripe, with an almost rope-like yarn and a woven textured ground.<br/><br/>Better than a basic plain, Lido is a textured chenille with a contemporary/retro vibe.<br/><br/>West Palm Woven is a densely woven natural palm leaf pattern that is big in scale and makes a bold statement. The ground is woven with a special bouclé yarn, updating this classic motif. The pattern is non-directional which makes it versatile anywhere.<br/><br/>Named for an exotic animal preserve, Shambala is an upbeat and playful take on a leopard pattern that is easy on the eyes. The mix of colorful weaves is softened by textures.<br/><br/>Soft and luxurious Talisman is an allover diamond pattern that can be used anywhere. It is simple enough for large upholstery and special enough for a dining room chair. The tone-on-tone chenille yarn gives this fabric a nice, supple hand.<br/><br/>Windsong is a multi-colored texture with a visible weave effect that offers just the right amount of interest and dimension. The heathered yarn is reminiscent of a handwoven raffia.<br/><br/>Inspired by our Danube Ikat wallpaper, Danube Ikat Stripe is a soft woven fabric that pairs nicely with other patterns in the Oasis collection. Vertical breaks in the ikat give it a handmade look.<br/><br/>Delray Diamond is a simple, large-scale 3-color pattern that emulates a dyed textile. The perfectly sized layout is ideal for pillows or cushions.<br/><br/>Linea Chevron is a mid-size chevron pattern which mixes varying shades of one color and white to give a softened graphic effect.<br/><br/>Trinidad makes use of a new Sunbrella yarn that is evocative of a natural fiber. The detailed concentric diamonds make for an especially beautiful interior upholstery fabric.<br/><br/>An impressionistic moire or woodgrain pattern, Soundwave has been softened to give the fabric that luxurious hand. Although it has a large repeat, it makes a subtle statement with its tone-on-tone coloring.<br/><br/>Like finding a treasure on a beach, Beachcomber is a simple chenille with a horizontal texture. This densely woven plain was designed for use on a whole outdoor setting or as a basecloth for interior sofas and sectionals.<br/><br/>Parquet is a graphic geometric that brings to mind decorative wooden floors or unique tiling patterns. Look closely and you will see this pattern creates a vertical stripe effect. This fabric has an interesting mix of raised bouclé yarn with a flat weave.<br/><br/>An addition to Thibaut’s other Sunbrella sheer offerings, Windswept is a simple variegated vertical stripe. It can be used inside or outside to soften light.<br/><br/>Fabrics in the Oasis collection can withstand intense light, so while they are great for poolsides and terraces, they can also be used in indoor spaces like sun-filled porches and window seats. Thibaut’s Sunbrella fabrics can be cleaned with all types of detergents, including bleach.",
"id": "10622",
"product_name": "Sunbrella® Oasis Collection exclusive to Thibaut",
"video_url": ""
}