{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10631",
"category": "Product > flooring: carpet/rugs",
"company_name": "Obeetee, Inc.",
"company_url": "www.obeetee.com",
"description_html": "Brocade Garden<br/> 65% silk, 30% wool, 3% other fibers<br/>hand-knotted<br/>8x10 - other sizes are available to order<br/><br/>Proud to be Indian<br/><br/>A movement combining the créme of India’s creative Ident, together with Obeetee’s century of experience in rug making, to iender an inspired seriesof the modern Indian carpet.<br/>Renowned for his aesthetic of inspired reinvention, Tarun Tahiliani helms the series of this campaign with his quintessential aesthetic of understated opulence. The three collections that span his series reflect the distinct nuances of Lucknavi Chikankari, Rajasthani Miniature Paintings &amp; his origins Abstract Art. Each creation unravelling a hand-woven work that pays tribute to indegenous India, as it tells its own story.<br/><br/>Miniature Paintings Collection<br/><br/>Beyond Borders &amp; Symmetry/ The Asymmetry of Borders: Drawing from the ancient art of miniature painting, Tahiliani encapsulates his vision of modern India.<br/>The miniature paintings of northern India are capsules of history, romance &amp; folklore captured within the symmetry of frames and borders. Garden motifs &amp; gold-tinted Persian scripts are highlighted against backdrops of royal blue, rich burgundy &amp; verdant green as they take you on a journey through India’s culture &amp; history. <br/>And, as history leaves its tales behind in search for newer spaces to fill, so do the borders that once framed it. Interpreted anew by Tarun Tahiliani, these frames are rendered as minimalist carpets, anchored in those archaic works of art. <br/>Classic motifs are lifted out of their canvases and brought into Tahiliani’s contemporary vision of distressed weaves, antiquated washes &amp; distorted symmetry. Edged with metallic thread embroidery, these elegant carpets carry the signature Tarun Tahiliani statement of India Modern – all that we are today.",
"id": "10631",
"product_name": "Brocade Garden/Proud to be Indian with Tarun Tahiliani -Miniature Paintings",
"video_url": "https://www.youtube.com/watch?v=pwNpPZ9HHJg"
}