{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10694",
"category": "Product > furniture: outdoor",
"company_name": "Tidelli Outdoor Furniture",
"company_url": "www.tidelli.com",
"description_html": "Tidelli Pendulo, Full Motion Swing<br/> <br/>The swing is no longer restricted to a straight back and forth movement. Through Ruy Ohtake's creativity and Brazilian identity, it gained a full motion, with a fluid multidirectional pendulum motion - as the name suggests. <br/><br/>Entirely handmade in nautical rope by Tidelli, and with a high grade powder coated aluminum structure, the exclusive design can be customized in over 70 colors.<br/><br/>Perfectly balanced in size, movement and simplicity, the seating experience was recreated with comfort, durability, and... with a high dose of fun in mind!<br/><br/>Video 1: https://youtu.be/R_z1TZMl1Fs<br/>Video 2: https://youtu.be/IKgeqzGj-Vg<br/><br/>............<br/>The Nautical Rope, the perfect outdoor material for Tidelli Pendulo Swing<br/> <br/>The outdoor furniture market lacked quality material for the high-end products Tidelli wanted<br/>to produce. Thus, the nautical rope became Tidelli's signature material. With its own full<br/>operation, Tidelli turns the finest raw material, exported from Europe, into miles and miles of<br/>rope. All of this is achieved in-house.<br/>After much research and investment, Tidelli developed it's own proprietary manufacturing<br/>system. With different colors, patterns, thickness and weave, you can create the product you<br/>want. <br/> <br/>The Nautical Rope:<br/>- is weather resistant<br/>- is extremely durable<br/>- is made with polyester<br/>- does not absorb heat or liquids<br/>- is easy to clean<br/>- requires minimal maintenance<br/>- contours to the body<br/>- may be customized with a choice of 60+ color options<br/><br/><br/>.........<br/><br/>Brazilian Soul, Hands and Hearts<br/><br/>A specialist in high-end hand-made outdoor furniture, we create products for those who seek to live closer to nature. Leader in the use of nautical rope, with our own proprietaty system, Tidelli constantly invest in research, partnerships with the best Brazilian designers, and the use of new materials to develop the ideal outdoor piece. But certainly, our team is our biggest differencial. <br/><br/>Craftsmanship: the solution for a better product and country <br/><br/>An isolated community of Salvador/BA, the Moradas da Lagoa, became Tidelli's home. <br/><br/>Through a partnership with the local goverment, the company lead the way to generate work, income and, most important, to restore dignity to the community - where good ideais, work and dedication trace new futures.<br/><br/>Currently, with a skilled team of more than 300 employees, mostly residents of the region, their craftsmanship became Tidelli signature - and pride.<br/><br/>Video: https://www.youtube.com/watch?v=cJdl-j9EA-U<br/><br/>.........<br/><br/>The Creative Mind of Designer Ruy Ohtake<br/><br/>The son of Japanese artist Tomie Ohtake, Ruy Ohtake was born an artist. Known for his unusual architectural designs, Ruy manifests his creativity in the most important and exciting architectural works of the country. He explores the universe of colors in a spectacular way. <br/><br/>Praised by Oscar Niemeyer for his plastic vision, his work lead him to win over 25 prestigious awards and can be seen in the streets and on avenues of important Brazilian cities and abroad. He majored in Architecture in 1960 at the University of São Paulo.",
"id": "10694",
"product_name": "Tidelli Pendulo Swing",
"video_url": "https://youtu.be/R_z1TZMl1Fs"
}