{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10716",
"category": "Product > (NEW) tabletop",
"company_name": "Sempli",
"company_url": "www.sempli.com",
"description_html": "In a design inspired by the snowy peaks of the Alps, these sibling pair of wine decanters aerates your red wines and elevates your tabletop. Decanting wine allows the flavors to develop in seconds, for a brighter bouquet and clearer tasting notes. When you pour your wine into the decanter, the liquid first hits the center “peak” at the bottom, immediately beginning the aeration process as it cascades down the sloping sides. No one will ever know if it's two-buck chuck. From a small hill to a big Alpine mountain the Italian name for mountains named this collection with the given name of Monti.<br/><br/>The Monti-Decanter is a uniquely compact and elegant wine decanter that not only can hold a magnum size bottle (1.5 liters!) with ease, it also is the first decanter that you can pour the wine straight into the decanter without tilting the whole piece using it, as the wine will be decanted by pouring down the inner mountain peak in the center by pouring it staring down. After the decantation the decanter can easily be held with one hand from the bottom and easily poured into your glass for your enjoyment looking like a true sommelier. <br/><br/>As a even more compact companion to its big sister the Monti-Decanter, the Monti Mini Decanter is hand blown crystal decanter uses a design that’ll steal the show at your next dinner party, and noticeably change your pours for the better and still holding a full bottle of vino!<br/> While pouring, the wine falls on top of the peak and aerates in a beautiful cascade down the mountain. Holding up to a full standard 750ml bottle of wine, the decanter and its glass center peak showcases the inspiration of the Italian Alps for this creation.<br/><br/>Nix, the hand-made walnut wooden stopper is made by Amish in a small Ohio village. Noix is a one size fits all design that will crown both decanters seamlessly.",
"id": "10716",
"product_name": "Monti Decanters",
"video_url": "https://www.facebook.com/semplidesign/videos/1547712668620684/"
}