{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10766",
"category": "Product > furniture: outdoor",
"company_name": "Sutherland Furniture®",
"company_url": "www.sutherlandfurniture.com",
"description_html": "Continuous Line is a collection designed by the renowned SheltonMindel℠. The collection is named for its clean lines and seamless connectivity of premium teak wood.<br/> <br/>Inspired by the organic modernist styles of architect and designer Alvar Aalto and furniture designer Gerald Summers, the collection is driven by the principles of simplicity and nature, as well as the rigors of form and function. This dynamic combination is what guides each piece in the collection. Every component is vital and works in harmony – nothing can be added, nothing can be taken away.<br/> <br/>Alvar Aalto's Paimio Chair and Gerald Summers' infamous 1935 Bent Plywood Armchair were revolutionary due to the use of laminated plywood. Mindel notes that the success of Aalto and Summers' work originated from exploring the possibilities of this new material and exploiting its inherent ability to be molded and bent into organic forms without resorting to the use of surface ornamentation.<br/> <br/>The challenge posed in the creation of outdoor furniture is that the most suitable and sustainable materials, teak and mahogany, cannot employ the form-making techniques of bent plywood. Computer Numerical Control (CNC) technology enables the cutting of the teak in organic curved slices that are held together through threaded steel bars. Through this technique the chair transcends the material and, without applied ornamentation, finds an inevitable form, function and beauty that is inspired by the rigor and honesty of Aalto and Summers' design philosophy.<br/> <br/>The pieces in the Continuous Line collection follow this same design concept and distinctive minimalistic aesthetic. The lounge chair is enhanced by 316 stainless steel joinery, which is not only critical to its function but also augments its graceful, lithe design. The lounge chair was inspired by Gerald Summers' Bent Plywood Armchair, which Mindel describes as \"seemingly derived from a single plane of wood and cut and manipulated into a chair like origami.\" The chair echoes this principle with fluid, parallel lines of teak wood that flow and connect seamlessly to form the chair's iconic silhouette.<br/> <br/>The chair features wide arms, a comfortable pitch angle and a bit of movement. It is offered in both natural and weathered teak wood finishes.",
"id": "10766",
"product_name": "Continuous Line Lounge Chair",
"video_url": ""
}