{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10774",
"category": "Product > window treatments",
"company_name": "Glen Raven Custom Fabrics and The Shade Store",
"company_url": "theshadestore.com/sunbrella",
"description_html": "The Sunbrella® Ventana™ Collection seamlessly blends the legendary performance of Sunbrella fabrics with the artisanal craftsmanship of The Shade Store®.<br/><br/>Sunbrella is the first performance fabric The Shade Store has offered giving way to high style, worry-free window treatments. Like Sunbrella, The Shade Store is also a family owned and operated business, founded in 1946. The companies’ shared heritage of style, quality and values create a perfect marriage for exceptional products.<br/><br/>“We understand that life can be messy, but that doesn’t mean you need to sacrifice style, quality, design or performance,” said Ian Gibbs, Co-Founder and Chief Creative Officer for The Shade Store. “We work closely with our customers to create custom window treatments that fit each individual’s lifestyle and offering Sunbrella performance fabrics allows us to provide even more options that stand up to busy family life.”<br/><br/>The collection includes 45 versatile, fade-resistant materials including textural solids and patterns for custom-made drapery, roman shade and cornice styles.<br/><br/>“As we design for the whole home, the appeal of Sunbrella for window treatments continues to grow,” said Benji Bagwell, market manager, Glen Raven Custom Fabrics, the manufacturer of Sunbrella fabrics. “The fade-resistant qualities of Sunbrella are especially important for window treatments, which are subject to strong UV rays.”<br/><br/>The Sunbrella Ventana Collection is available at The Shade Store showrooms nationwide as well as online at theshadestore.com/sunbrella. All of the custom window treatments from The Shade Store are hand-crafted by skilled artisans in the USA.",
"id": "10774",
"product_name": "Sunbrella® Ventana Collection™ for The Shade Store®",
"video_url": ""
}