{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10791",
"category": "Product > flooring: carpet/modular",
"company_name": "Dickson® Woven Flooring by the makers of Sunbrella®",
"company_url": "https://www.dickson-constant.com/en/UK",
"description_html": "Each room raises new challenges. That’s why Shape Lab allows unprecedented scope for testing and modulating floor surfaces. From offices to hotels to homes, each space is unique. Available in four shapes, the Shape Lab program replaces standard layouts or complements them by mixing products to create rhythm, perspectives and reflections to transform interiors. With six ranges and a palette of unique colors to choose from, Shape Lab allows for the ability to design and control a floor in ways that were never possible before.<br/><br/>Random Joint Pattern is an English technique, making installation easy and cost-effective since it generates very little waste. When laid lengthwise, the strips lengthen a room. When laid widthwise, they widen it. <br/><br/>When Herringbone Pattern is placed at the right angles, a room can obtain a graphic result that is compatible with both traditional and contemporary styles. This is ideal for highlighting large rooms such as the living room or dining room. <br/><br/>Hexagonal Pattern is a trendy look that’s suitable for any room, giving interiors a retro feel and vintage touch. <br/><br/>Diamond Cube Pattern creates three nuances and a 3D effect using a single color. <br/><br/>Burlington Pattern allows for the ability to create compositions that alternate between different tones using several colors in a diamond shape. Best paired with neutral furniture, this pattern will accentuate the floor. <br/><br/>Monolithic Pattern is the perfect solution for an attractive, uniform result. <br/><br/>Designed for heavy residential and commercial use and woven from revolutionary fibers, Dickson® floor covering options combine the remarkable durability of vinyl with the aesthetic appeal and texture of traditional carpeting. A true technical innovation developed for the most demanding public areas, such as hotels, offices, shops and restaurants, this flooring is durable, comfortable, easy to maintain and attractively designed.",
"id": "10791",
"product_name": "Dickson® Woven Flooring by the makers of Sunbrella®",
"video_url": "https://www.youtube.com/watch?v=ecQkeHVy-yY"
}