{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10809",
"category": "Product > bath: cabinetry",
"company_name": "Robern",
"company_url": "www.robern.com",
"description_html": "AiO Medicine Cabinet originally launched in January of 2016 and expanded the line with 40\" high cabinet options that included the Bluetooth audio feature. In addition, the interior of the cabinet was updated to accommodate integrated electrical outlets and USB ports, magnification mirror that adjusts to the height you need it and magnetic storage strip, razor holder, accessory trays, and adjustable shelving easily accommodate your must-have essentials. <br/><br/>AiO Wall Mirror launched in August 2016. In January 2017, the audio version of the wall mirror launched. In addition, the 70\" wall mirror launched in January 2017 offering LUM Lighting Technology to a full length mirror.<br/><br/>In September 2017, both the medicine cabinet and the mirror are available in the new warm, relaxing tones (2700K) replicate indoor light or the existing cool, invigorating tones (4000K) simulate bright daylight. Robern integrated the warm LED lighting into the AiO Collection based on customer demand for lighted mirrors and cabinets that match the existing lighting in their styling spaces and bathrooms. Warmer lighting and the AiO were a natural fit for Robern customers: customers in the United States generally prefer warmer lighting, and demand for the AiO Collection has grown – especially in urban areas such as New York, Florida, California and Chicago.<br/><br/>The AiO Lighted Wall Mirror combines thin-profile, minimalist design with flawless functionality and connectivity. LUM™ Lighting technology offers on-mirror, one-touch dimming to tailor your lighting for any task. OM™ Audio lets you connect with Bluetooth® to the embedded speakers, while integrated USB ports make it easy to recharge your technology. The result: a sophisticated furnishing that simplifies your life.<br/><br/>AiO Lighted Medicine Cabinets merge sleek design with state-of-the-art features to enhance your routine. LUM™ Lighting technology with one-touch dimming creates the perfect level of illumination, and the built-in, Bluetooth®-enabled OM™ Audio transforms your medicine cabinet into a sound system. The moisture-resistant interior features adjustable shelves and additional lighting, along with two magnification mirrors for fine-tuning tasks. Razor holders and magnetic storage strips keep styling tools organized. This is the medicine cabinet with everything.<br/><br/>Product Innovation:<br/>Combining precise task lighting with a minimalist aesthetic, the AiO Lighted Mirror is an eye-catching design element that doubles as an energy-saving lighting fixture. Its thin profile conceals a wealth of technology, including a capacitive-touch dimming switch, built-in audio, and Bluetooth® connectivity. And with lighting built directly into the mirror, installation is simple and straightforward, for sophistication that’s built to last.<br/><br/>With updated features designed to meet your changing needs, the AiO Medicine Cabinet combines timeless style with cutting-edge technology. Integrated electrical outlets and USB ports make multi-tasking a breeze. An Entice magnification mirror highlights the finer details of your daily prep. The magnetic storage strip, razor holder, accessory trays, and adjustable shelving easily accommodate your must-have essentials. Whether you’re getting ready for a morning meeting or a night on the town, the AiO Medicine Cabinet brings effortless ease to your routine.",
"id": "10809",
"product_name": "The AiO Collection",
"video_url": "http://www.robern.com/inspiration/video-gallery/#?video=m9yAMiHkjlw"
}