{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10806",
"category": "Product > textiles: residential",
"company_name": "Perennials Fabrics®",
"company_url": "www.perennialsfabrics.com",
"description_html": "Perennials has a new collection in collaboration with renowned designer Martyn Lawrence Bullard. Just in time for fall, the new collection of 29 bold fabrics boasts striking patterns and vibrant colors. Martyn Lawrence Bullard for Perennials® introduces eight new designs, inspired by Martyn's worldly design aesthetic. Featuring rich reds, vintage blues, tea-stained tans and nuanced greys, the collection debuts four new colorways: Red Dawn, Spring Fling, Black &amp; Tan and Madder.<br/><br/>As a consummate designer and tastemaker, Martyn has been widely acclaimed for his trademark glamour and flair for the exotic when curating sophisticated and inviting interiors. The collection blends ethnic moments with Martyn's contemporary point of view. Think Palm Springs mid-century vibe with African and Indian influences. Martyn’s impressive mastery of a broad range of styles, paired with his unrivaled attention to detail and quality, makes him the perfect collaborator for Perennials.<br/><br/>Martyn Lawrence Bullard for Perennials® seamlessly mixes mosaic-inspired patterns with classic textured elements. With a handwoven feel, Sultan Swing is a nod to traditional ikat textiles, perfect for indoor and outdoor upholstery; available in four colorways. With its woven stitched detailing, Bedouin Stripe simulates authentic pieced textiles; available in five colorways. Harem Shuffle draws inspiration from ikat techniques, typical of hand-made artisanal textiles; available in four colorways. Old-world nuances are apparent in Market Paisley, a structured arrangement of a traditional paisley motif; available in three colorways. <br/><br/>Star Power and Jali add versatility to the collection with their reversible constructions. Reminiscent of Eastern architectural accents, the lattice-inspired Jali adds structure to any environment; available in three colorways. Inspired by a traditional tile pattern, Star Power adds dimension with its heavily textured ruggedness; available in three colorways. The variegated color blending of Souk Stripe evokes the aged, well-loved appeal of a vintage textile; available in three colorways. Tribal Trellis conjures up the image of ancient mosaic walls with crumbling grout lines; available in four colorways.<br/><br/>Woven from fine 100% solution-dyed acrylic yarn, these fade-, mildew- and UV-resistant fabrics not only survive, but thrive in life's everyday environments. All Perennials fabrics are independently tested and certified in accordance with industry standards, including resistance to soil, water, UV radiation, tearing and abrasion. Perfectly suited for both indoor and outdoor environments, Perennials fabrics are also bleach cleanable and easily maintained. All of the fabrics in this collection feature Perennials' Nano Seal™ finish as well, which provides long-lasting protection even after repeated washings.",
"id": "10806",
"product_name": "Martyn Lawrence Bullard for Perennials®",
"video_url": ""
}