{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10808",
"category": "Product > wall covering: contract",
"company_name": "JAB Anstoetz",
"company_url": "www.jab.de",
"description_html": "JAB Anstoetz/ WALLCOVERING GRANDEZZA DOLCE VITA<br/><br/>The Dolce Vita wallcovering collection from JAB Anstoetz <br/>celebrates the bright side of life. Five articles in total <br/>provide the perfect palette for the creative <br/>design of sophisticated interiors with a fashionable, elegant twist.<br/><br/>The epitome of the collection thrills with an<br/>opulent rose motif. DOLCE VITA transforms<br/>the individual details of the motif with an<br/>ingenious embossing technique a look<br/>that is amazingly close to textile wall<br/>coverings. DOLCE VITA appears like a<br/>painting on a coarse painters linen canvass.<br/><br/>DOVIZIA presents an elegant damask look.<br/>Its oversized tendril ornament evokes an<br/>amazing textile impression, which has<br/>been possible only through the highly<br/>artistic hand engraving of the embossing<br/>rollers from Italy. <br/><br/>DELIZIOSO features rich yet restrained damask motif. Due to<br/>its earth-colored tones and the interesting<br/>embossing it resembles a shadow velvet<br/>and thus becomes a perfect semi-plain.<br/>Glistening flecks that appear to have been<br/>scattered lend DELIZIOSO an additional,<br/>special touch. <br/><br/>Graphic clarity dominates<br/>the character of DELICATO. Here softly<br/>rounded rhombs unite to form a grid-like<br/>design that is enlivened by a fine matt/<br/>brilliant contrast and a rib-like structure.<br/><br/>DOLCE completes the exclusive collection<br/>as a kind of semi-plain. The sophisticated,<br/>all-purpose plain with its linen-like surface<br/>structure, which has been possible thanks<br/>to hand engraving, and the subtle shimmer<br/>is available in 18 shades.<br/>All wallcoverings meet the flame retardant",
"id": "10808",
"product_name": "Dolce Vita",
"video_url": ""
}