{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10821",
"category": "Product > textiles: outdoor",
"company_name": "Glen Raven Custom Fabrics and Pindler",
"company_url": "pindler.com",
"description_html": "The Seaside collection of Sunbrella® fabrics, by internationally acclaimed furniture and textile designer Richard Frinier, is named for the many iconic coastal resort destinations and locales around the world that served as inspiration for these distinctive and exceptionally executed performance textiles.<br/><br/>“As a native Southern Californian, I have lived in and around a coastal region my entire life and am naturally drawn to seaside destinations and lifestyles,” Frinier said. “There is an inherent allure to seaside cities and resort villages that compels us to come closer and linger, leaving a lasting mark on our memories and spirits long after we have returned home.”<br/><br/>The Seaside Collection is comprised of: two base cloths – Stonebrook and Bayshore; two stripes – Coastview and Fairharbor; and, three patterns – Palma, Freeport and Southpoint.<br/><br/>Stonebrook is a lightweight, textured plain weave made from ratiné yarns with the appearance of beach sand. Bayshore is a box weave construction woven on a common warp allowing for a beautiful range of coastal hues.<br/><br/>Coastview is woven using the Stonebrook construction, illustrating a classic and spirited espadrille stripe. Fairharbor is a cabana stripe in soft, sun-washed pastels which complements the Bayshore construction.<br/><br/>Palma is a banana leaf pattern on a jacquard construction inspired by the botanical gardens and landscapes of seaside retreats. Freeport is a woven jacquard with an oversized, open basketweave pattern enhanced by a slightly distressed and hand-woven appearance. Southpoint, with its softly distressed jacquard diamond pattern, evokes imagery of more nostalgic and classic seaside resort architecture in a stylized reference to decorative tiles.<br/><br/>The Seaside collection by Richard Frinier for Sunbrella is available exclusively through Pindler.",
"id": "10821",
"product_name": "Seaside from the Richard Frinier Collection for Sunbrella® exclusive to Pindler",
"video_url": ""
}