{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10829",
"category": "Product > textiles: outdoor",
"company_name": "Arc|Com",
"company_url": "www.arc-com.com",
"description_html": "The Arc-Com Design Studio channels the spirit of two of the world’s most beautiful islands to create patterns Bali and Fiji.<br/><br/>Engineered using Sunbrella solution-dyed fibers, both patterns were designed specifically for indoor and outdoor use.<br/>The twelve colorways that are offered for pattern Bali utilize a common sand colored ground that anchors both bold and bright accents as well as sophisticated colored neutrals.<br/>Pattern Fiji is a simple textured plain that supports the gorgeous color story found in pattern Bali. The twenty-four colorways coordinate directly with the accent colors found in pattern Bali.<br/>Both patterns are Greenguard Gold certified for indoor air quality and FACTs Silver certified.<br/>Bali’s turquoise and green waters, soft pink sands, dark volcanic mountains, and dramatic fiery sunsets inspired the dynamic color combinations found in pattern Bali’s simple intertwined geometry. The twelve colorways that are offered for pattern Bali utilize a common sand colored ground that anchors both bold and bright accents as well as sophisticated colored neutrals.<br/> <br/>Pattern Fiji is a simple textured plain that supports the gorgeous color story found in pattern Bali. The twenty four colorways offered in pattern Fiji coordinate directly with the different accent colors found in pattern Bali. Pattern Fiji will also act as a versatile coordinate plain as Arc-Com continues to add patterns to this important product category. <br/><br/>Both patterns Bali and Fiji are manufactured using Sunbrella solution dyed fibers. The performance feature that sets Sunbrella fibers apart from regular polyesters or acrylics and makes them appropriate for outdoor use is their incredible lightfastness rating. <br/><br/>Both patterns Bali and Fiji are Greengaurd Gold certified for indoor air quality.<br/>These patterns are also FACTs Silver certified. FACTs is a multi-attribute environmental standard that takes into consideration not only the products composition but how it is manufactured as well. <br/><br/>Some of the additional attributes that are assessed include fiber sourcing, safety of materials, water conservation, water quality, energy usage, air quality, recycling practices and social accountability. Products that are FACTs certified conform to the rigors of the NSF/ANSI 336 standard and are third party certified. A FACTs sustainability rating means that the product has been evaluated for environmental, economic and social aspects across its life cycle.<br/>Environmentally sound, performance driven and aesthetically superior, patterns Bali and Fiji will undoubtedly be used to beautify spaces both inside and out!",
"id": "10829",
"product_name": "Bali/Fiji Collection",
"video_url": ""
}