{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10832",
"category": "Product > furniture: outdoor",
"company_name": "DEDON GmbH",
"company_url": "https://www.dedon.de",
"description_html": "Having firmly established itself as a poolside and lounging favorite, MBRACE by Sebastian Herkner now brings its welcoming embrace to the dining area. The new additions are characterized by the same joyful unconventionality, deep comfort and rich material mix that has made the MBRACE collection such a hit in the first place, winning it the prestigious ‘Best of Best’ prize at the Iconic Awards 2016.<br/><br/>Like the original loungers, the new MBRACE dining chairs feature a solid teak base and wrap-around seating that cocoons users in cosy comfort. The seats themselves are woven in the collection’s distinctive, mesh-like triaxial weave of DEDON Fiber, which gives them a breezy openness. As Herkner notes, this allows the chairs to “embrace their surroundings, becoming one with the environment.”<br/><br/>Made of solid teak and available in two sizes, the dining table shares the design language of the chairs, from the construction of the base to the surfboard-like curves of the tabletop. Made of slats, with small gaps between them, the tabletop also shares the open, breezy quality of the woven seating. “Not just a closed surface, the table interacts with the garden,” Herkner explains, “same as with the chairs.”<br/><br/>One of Europe’s leading young design talents, Herkner approached the dining extensions with characteristic thoughtfulness: “A dining table today is not just for dining—it’s for communicating, playing and working, also outdoors. The chairs had to be upright, of course, but not too formal. And it was very important that the table be narrow, only 90cm deep, to create a space for real togetherness with others.”",
"id": "10832",
"product_name": "MBRACE Dining Table and Armchairs",
"video_url": ""
}