{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10840",
"category": "Product > furniture: outdoor",
"company_name": "DEDON GmbH",
"company_url": "https://www.dedon.de",
"description_html": "DEDON’s first collection in teak, TIBBO by Barber &amp; Osgerby combines meticulous craftsmanship, superior comfort and remarkable lightness in a design that’s distinctive, elegant and pure, just as you’d expect from its internationally renowned creators. With its material mix of teak, textiles and woven fiber for the seats, the collection conveys an exceptionally rich and luxurious feel.<br/><br/>The TIBBO chairs are distinguished by round arms and legs and the sail- like three-dimensional curve of its thin, formed seat back. “The beauty of turned wooden has a tactile quality like no other material,” the designers explain. “Because of the oily nature of teak, the wood feels especially soft, and so we set out make furniture that would accentuate these properties.”<br/><br/>Overall, the collection conveys a sense of architectural rigor in its both its construction and its proportions. A spectacular 3.5 meters in length, the largest of the dining tables stands on just four legs, accommodating 10 diners with ease. But the rationality of TIBBO’s design is balanced by the warmth of the wood, the comfort of the cushions and the soft touch and natural look of the fiber, specially developed for the collection.<br/><br/>TIBBO is hand-crafted from slow-growth premium teak sourced from sustainable plantations. Premium teak offers great weather-resistance and durability even in extreme conditions. Consisting of a dining chair, four sizes of dining table, two sizes of bench, a lounge chair, a coffee table and a side table, the collection is equally at home outdoors, where it will naturally acquire a silver-grey patina, or indoors, where it will retain its golden hue.<br/><br/>The TIBBO collection represents DEDON’s first collaboration with the award-winning designers Jay Osgerby and Edward Barber. Since founding their London studio in 1996, the partners have won worldwide acclaim for their industrial design, furniture, lighting, site-specific installations and public commissions, including the London 2012 Olympic Torch. The elegant directness of their work is a perfect fit with DEDON’s design-driven approach.",
"id": "10840",
"product_name": "TIBBO Dining Table and Armchairs",
"video_url": ""
}