{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10859",
"category": "Product > kitchen: appliances",
"company_name": "Thermador",
"company_url": "www.thermador.com",
"description_html": "As a true visionary and innovator in built-in refrigeration,Thermador originated the built-in modular refrigeration concept in 2006 with the Freedom® Collection, and it has truly become the next generation of refrigeration. In 2017, Thermador unveiled a completely refreshed line of Thermador Preservation Columns with three new column additions: 36” single door refrigerator column, a 36” freezer column and a 23 ½” single door column. Completely redesigned, the new Thermador Culinary Preservation Collection features new and modern finishes as well as a long list of innovative new features designed to bring culinary stories full circle. The columns boast new and modern finishes, and include innovative features that ensure optimum preservation:<br/><br/>- Open Door Assist uses Auto Door Opening technology to open the refrigerator door with either a push or a pull, adding a luxurious touch and the option for a sleek, handle-less design.<br/>- ThermaFresh System is the ultimate solution for extending the freshness of meat and produce for longer periods of time. Independently controlled from the rest of the refrigerator, the bottom drawer within the refrigerator provides optimal humidity.<br/>- Delicate Produce Bins are easily removable storage bins that provide ample space for fresh fruits and vegetables. Soft-close technology also allows for bins to open and close smoothly.<br/>- Theater Lighting throughout the luxury columns are designed so that ingredients stored in the extra-wide refrigerator and freezer are visible and accessible. <br/>- Soft-Close Drawers provide a gentle, quiet glide each time they are opened or closed.<br/>- New, Redesigned Bins with an all-new railing system that enable bins to be placed anywhere on the refrigerator door; each bin having been redesigned to provide better visibility.<br/>- FreeFlow® Cold Air System helps ensure items placed on door shelves will be kept cold at all times by quickly adjusting the temperature of the doors to match that of the interior. <br/>- Super Cool Feature returns food to its ideal preservation temperature after being placed in the refrigerator. <br/>- Cool Air Flow Technology makes Thermador refrigerators and freezers more energy efficient. Cool Air Flow—upgraded with a new, quieter fan—is proprietary Thermador technology that optimizes and evenly distributes cold air throughout all parts of the unit. <br/>- Three-Zone Temperature Control within the Thermador 24-Inch Wine Column provides three separate zones for precise temperature control, giving more flexibility for storing different vintages at their optimum temperatures.<br/><br/>Exceptional design is a signature feature of the new Freedom® Collection, providing an abundance of options for every individual’s unique culinary lifestyle. Crafted with high quality materials, a customizable interior, all-glass shelving with metal trim, sleeker handles or the option to be handle-less, the new columns provide an added touch of luxury to the kitchen.",
"id": "10859",
"product_name": "Freedom® Collection – Culinary Preservation Columns",
"video_url": ""
}