{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10876",
"category": "Product > seating: contract/stool",
"company_name": "Allseating",
"company_url": "http://www.allseating.com/",
"description_html": "The result of a meeting of the minds, the Astute chair exemplifies the sleek quality and versatile nature for which its creators, award-winning design firm, busk+hertzog, and Allseating are best known. <br/><br/>As a firm, busk + hertzog designs products that are sculptural, with clean lines and minimal embellishment. Ironically, the simplicity of their designs create a bold expression — with timeless forms that are embraced across every sector in today’s modern global landscape.<br/><br/>Astute was purposefully crafted to fit in a variety of settings, which can range from healthcare waiting rooms, to higher-education classrooms, and executive office suites. With inspiration drawn from nature and classical architecture, the chair’s signature arms organically flow into the seat frame’s back, creating a seamless and beautiful detail that is subtle, yet visually intriguing. <br/><br/>“By carefully designing every single part from scratch, considering both aesthetics, durability, and material consumption, we’ve tried to create a series of chairs are not only functional and pleasing to the eye, but are also extremely customizable so they can be used in any unthinkable interior design concept,” says Flemming Busk and Stephan Hertzog regarding the concept behind the collection.<br/><br/>Astute, as a collection, is characterized by soft undulations and gentle curves that meet a symmetrical base for a design that is both simplistic and elegant. Bow-shaped arms are available to further emphasize the chair’s rounded elements, while an A-line base provides a supportive frame. Versatility and customization are also inherent to Astute, with an extensive range of back, seat, frame, and upholstery offerings available to match hospitality and commercial spaces. 16 hue options can alter the aesthetic of Astute, including the popular, office-friendly favorite, Finished Chrome. Arm styles operate in the same manner, with penguin, loop, and armless variations possible in polished, painted, or finished lacquers, as well as Smoke and Black Matte. Astute’s bases are also customizable, with five bases for a variety of applications, including a four-leg base, four-leg caster, sled base, counter, and bar. <br/><br/>Essential to Allseating’s brand mission to supply designers with resources that harness their creativity, the collection was created to be highly customizable with over 84 possible variations.",
"id": "10876",
"product_name": "Astute",
"video_url": "https://vimeo.com/223821123"
}