{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10878",
"category": "Product > flooring: carpet/modular",
"company_name": "Shaw Contract",
"company_url": "shawcontract.com",
"description_html": "The need to connect, to reflect, to simply stand still and be in the moment, is ever more compelling. As our schedules leave little time for reflection, and our digital lives remove us from our senses, we yearn for the calming power of a soft surface, the visual harmony found in nature, for physical connection. Off the Grid is a deeply textural collection, of undulating patterns that mirror the natural world, contour lines that dip and yield, boundaries that blur the edges, abstract forms, forging deeper connections to the world around us.<br/><br/>The team explored natural environments completely disconnected from their daily roles and technology. Immersing themselves in the journey and drawn, with a sense of curiosity, to details often overlooked, they found themselves marveling at micro and macro environments. From grand landscapes to delicate and intricate patterns in moss, spider webs, and trails carved by beetles, the passion for design was reignited. The designers interpreted their observations into patterns and created textures that are reminiscent of their journeys. This collection is a product of our design team’s experience of reconnecting to their craft by disconnecting from their routine.<br/><br/>This collection is deeply textural and can be used to create subtle or dynamic shifts in scale and texture density. These designs evoke colors, textures and pattern from nature and brings the human touch indoors – answering the human desire for connection with nature. Off the Grid, is a product that can bring Biophilic element to our built environments. The increased need for quiet and contemplative time in the workplace is answered by this collection that draws you in and calms through its palette and ever-changing, irregular textural landscape. <br/><br/>Off The Grid is a very flexible collection. The modularity of the tiles and the multiple coordinating styles and colors offer the choice to create a variety of unique spaces. By mixing textures and patterns together, spaces can easily transition from one function or purpose to another. Or by using the styles individually spaces can be delineated to create moments of focus or respite. There is also a level of neutrality that can be achieved to make it an excellent partner for another co-specified material.<br/><br/>By connecting to the human element, a need for mindfulness, and the growing desire for reflective calm spaces, Off the Grid answers the increased need for quiet and contemplative time in the workplace. It draws you in and calms through its palette and ever-changing, irregular textural landscape.",
"id": "10878",
"product_name": "Off the Grid",
"video_url": ""
}