{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10885",
"category": "Product > flooring: carpet/broadloom",
"company_name": "Brintons",
"company_url": "www.brintons.net",
"description_html": "ATLANTA, Sept. 26, 2016 – Brintons, a leading designer and manufacturer of woven axminster carpet,<br/>has once again partnered with designer Stacy Garcia to launch an exclusive new design collection, Altered<br/>Gravity.<br/>Altered Gravity is the 8th collaborative collection from Brintons and Stacy Garcia. The collection, which<br/>includes 14 patterns, draws inspiration from diverse disciplines of the art universe; abstract<br/>expressionism collides with contemporary graphic design, and digitally rendered textures melt between<br/>layers of mixed media paintings.<br/>“Altered Gravity is about exploring the boundaries of experimental design techniques and mediums.<br/>We're bringing it back to the basics of fine art and melding it with new technologies,\" says Stacy Garcia.<br/>\"Like my design aesthetic, the art process is ever evolving. We're constantly adapting, rearranging,<br/>adding and subtracting – creating layers that form into something beautiful,\" Garcia adds.<br/>The precision-weaving process of Axminster carpet combined with Brintons’ ability to achieve<br/>unparalleled depth and texture with up to 32 colors, brings Altered Gravity to life.<br/>This collection is perfect for use in every market – from hospitality and retail to marine and gaming.<br/>Following the launch at Boutique Design New York (BDNY) on November 13-14, the collection will be<br/>immediately available and can be fully customized to fit each project.<br/>“Original works of art are translated into expressive Axminster carpet designs using complex color and<br/>textural overlays,” states Nadia Burton, Design Director for Brintons Americas. “Wild graphic strokes<br/>and frenzied paint splats marry with translucent floral forms to create boldly scaled designs catered to<br/>the hospitality market. Altered Gravity, with pattern repeats varying from 6‘ to 48’ is presented as an<br/>extremely versatile collection and one to watch in 2017,” adds Burton.",
"id": "10885",
"product_name": "Altered Gravity by Stacy Garcia for Brintons",
"video_url": ""
}