{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10881",
"category": "Product > seating: contract/guest",
"company_name": "Allseating",
"company_url": "http://www.allseating.com/",
"description_html": "Designed by one of the most acclaimed minds in industrial design, Carl Gustav Magnusson’s, Lyss™ is a stunning chair created in collaboration with Canadian based furniture manufacturer, Allseating. Elegant and unconventional, yet functional and accessible, Lyss embodies the ‘think outside the box’ mentality, pulling in organic materials and smart silhouettes for a chair as unique as it is beautiful.<br/> <br/>The chair's name is a reflection of its one-of-a-kind design. Derived from the Swedish word, 'lysnna,' meaning 'to listen,' Lyss was appropriately designed to facilitate intimate conversations and meaningful connections between its users. Furthered by each and every one of Lyss' carefully considered components, the chair makes for the perfect seating selection in boardrooms, lobbies, lounges, libraries, and ideation spaces. <br/> <br/>The versatility of the chair can be largely credited to Lyss' sophisticated yet contemporary aesthetic made possible by a flexible poly shell carved with subtle undulations at its summit for an eye-catching detail and added support. A delicately curved cutout in the seat's back, complemented by an A-line base, exudes modern appeal, while tactile upholstery offerings and a real oak wood base enhance the upscale styling of the chair. Juxtaposing uncommonly matched materials - a real oak wood base with an outer poly shell backing - Lyss can be celebrated for its thoughtful design and ingenuity. <br/> <br/>Lyss can also be defined by its versatility, with an aluminum base also available for spaces that follow a more traditional office design scheme. Four different base styles for four incredibly unique finished products, including refined guest and lounge design, a 4-prong glide, and flexibility-focused caster version. As customization is inherent to the chair, Lyss’ poly shell is also crafted to order, with three stylish options: cotton outer poly back/smoke inner poly back, cotton outer poly back/upholstered inner back, fully upholstered outer and inner back.<br/> <br/>The handsome design comes at an accessible price point, additionally contributing to its appeal and stretching its accessibility to applications of all sizes and statures. Carl Gustav Magnusson’s experience as an industrial designer, as well as an educator, is reflected in this latest body of work. With a refined eye for high-design, Carl was able to create a chair that is approachable in any setting, and embodies all of the users desires for comfort, quality, and style. Lyss was created to be timeless and not limited to a particular passing trend or design era.",
"id": "10881",
"product_name": "Lyss",
"video_url": "https://www.dropbox.com/s/jv10oqyk7m7n73q/Allseating_Lyss_Interior%20Design%20Video.mp4?dl=0"
}