{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10886",
"category": "Product > seating: contract/lounge",
"company_name": "Haworth, Inc.",
"company_url": "www.Haworth.com",
"description_html": "Riverbend Lounge and Pebble Ottoman are solutions designed for short-term spaces to support people’s needs for a variety of purposeful work settings, including open collaborative spaces, lounge areas and cafes. <br/><br/>The broad statement of line including high back, mid back and no back sofas, convex and concave options, multiple widths, optional power modules, one common ganging bracket, and four Pebble sizes work individually or in tandem to create this variety of settings.<br/><br/>The variety of configurations offered by Riverbend and Pebble support many tasks across a floorplate. The high back lounge minimizes distraction so people can focus on their work while the midback sofa and ottoman support an open environment to encourage interaction and collaboration. Embedded AC and USB power help people stay connected and keep devices charged. These applications of Riverbend and Pebble suit commercial, educational and healthcare environments<br/><br/>Organizations that value innovation understand people need the time and space to think and work alone, balanced with time and space for collaboration. Environments that support people’s work processes for creative performance are crucial to innovation. People desire a variety of work settings for these activities, including spaces that support contemplation, face-to-face interactions, serendipitous meetings and larger group collaboration. <br/><br/>One of the top five challenges for organizations is employee engagement – the connection people feel with their organization that motivates them to accomplish work with excellence. To engage workers, it’s necessary to create an environment that supports a culture of collaboration so people can innovate, work efficiently and perform their best. Riverbend lounge and Pebble ottoman have a modern geometrical design that draws people in to encourage face-to-face interaction. The classic design is neutral enough to complement any environment without competing with other design elements.<br/><br/>With real estate costs on the rise, the individual workspace continues to shrink. At the same time, the demand for ancillary spaces that facilitate collaboration or quiet contemplation is growing. Organizations are continually driven to optimize their facilities with cost effective, multi-functional solutions to help their workforce stay productive. Riverbend and Pebble offer a versatile solution that enables a variety of applications created from the same set of pieces to maximize investment. The simple, scalable design makes it easy to specify and reconfigure while maintaining consistency across a floorplate. Riverbend and Pebble complement and integrate with other products from the Haworth portfolio to create complete solutions.",
"id": "10886",
"product_name": "Haworth Riverbend and Pebble",
"video_url": ""
}