{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10897",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "Interface",
"company_url": "www.interface.com",
"description_html": "POP is a new, inventive tool Interface conceived to share simple floor design solutions that suit the practical needs of the busy interior designer. Presented as a beautiful and tangible print piece/magazine as well as online as a digital design guide, POP Issue 1 features 25 of our most popular products and nearly 80 floor designs that solve frequent design challenges. <br/><br/>POP Issue 1 is the first of many to come. In fact, design of POP Issue 2 is underway. Each issue will follow a different theme based on current trends, challenges and opportunities for floor designs in the workplace, or that can be extended to where you live, learn or play. POP Issue 1: Flow explores designs for Entryways, Pathways, Decisions and Destinations. <br/><br/>The print and digital edition are supported by POP's interactive design tool, allowing designers to customize the readied floor solutions to pop. It’s a great way to experiment with our most popular styles — configured to the individual’s taste and available for delivery in a hurry.<br/><br/>Knowing that designers are often constrained by time or budget, all POP featured floors are available for quick delivery at cost-effective price points. The styles featured in POP complement our Quick Ship program, but highlight the newest and most popular Interface products that can be delivered in the Quick Ship timeframe. Each issue will be timed with an update to our POP list, offering a new, fresh product mix reflecting our trending styles and enhancing our Quick Ship offering in quantity and design aesthetic – all with the same promise of up to 2,000 square yards shipping within 10 business days. <br/><br/>All of this inspiration and practicality are packaged in one program proven to grab attention and provide value to designers on the go. POP Issue 1 was launched in North America, but the success of and engagement with POP has been so high that the concept is being taken global by Interface and will soon be available in all regions throughout the world.",
"id": "10897",
"product_name": "POP",
"video_url": ""
}