{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10892",
"category": "Product > textiles: outdoor",
"company_name": "Glen Raven Custom Fabrics",
"company_url": "sunbrella.com/makers",
"description_html": "Representing innovation, precision and heritage, the new Sunbrella® Makers Collection by Glen Raven Custom Fabrics is centered around the principles shared between time-honored handweaving and modern manufacturing, bringing the character of traditional artisan techniques to the industry. The collection tells the story of what lies beneath the product to connect consumers to the fabric, from the yarn to the finished piece.<br/><br/>Fabrics in Makers incorporate the performance qualities of Sunbrella with authentic designs tied to generations of makers. The collection portrays the importance of preserving the conventional element of craft while advancing technologically. By combining new, experimental techniques with traditional style, the artisan fabrics are perfectly suited for both indoor and outdoor upholstery.<br/><br/>Exemplifying Sunbrella design innovation and technological advancements, jacquard pattern Adaption juxtaposes matte and shiny with PVC yarn. The pattern is reminiscent of hand-forged metal designs with a simple geometric pattern in tonal colors.<br/><br/>Midori is inspired by traditional Japanese Shibori dyeing. A process which involves folding, twisting or bunching fabric, binding it and then dyeing it, Shibori dyeing creates one-of-a-kind pieces, in which no pattern is the same. The Sunbrella design team recreated this look with modern weaving equipment, making the fabric look more primitive and handmade, while preserving Sunbrellla’s legendary performance.<br/><br/>A traditional menswear-inspired pattern, Paradigm pairs well with the contemporary patterns throughout the collection. Makers nurtures an inclusive community of makers, challenging them to create extraordinary spaces with the fabrics.<br/><br/>In addition to jacquard patterns, the collection adds new stripes and expands colorways for some of the company’s most trusted solids. A standout among the new stripe patterns is Artistry. Inspired by Mayan backstrap weaving, this fabric represents the custom woven pattern of vintage textiles. A new texture, Blend, is made of a heavier yarn for a soft, textured hand in a wide range of colors.<br/><br/>With dedication to the smallest details, the collection is rooted in a deep connection to a community of makers, like those on the Sunbrella design team. With a combined 145 years of experience in textile design, these makers live and breathe design. They collect inspiration from many different sources including travel, personal experiences, art and other forms of craft, weaving these inspirations into their textile designs.<br/><br/>The Makers Collection of Sunbrella fabrics is currently available to the manufacturing trade and will be at retail this fall. Like all Sunbrella fabrics, the textiles in Makers are easy to care for, fade proof and bleach cleanable.",
"id": "10892",
"product_name": "Sunbrella® Makers Collection",
"video_url": "https://www.youtube.com/watch?v=czyP_vZyhHw"
}