{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10903",
"category": "Product > (NEW) automotive: interiors",
"company_name": "Maserati",
"company_url": "www.Maseratiusa.com",
"description_html": "The Maserati of SUVs<br/><br/>At IAA Cars 2017, Maserati presents the Levante MY18 that has adopted a new range strategy with two distinct new trims: the luxury-orientated GranLusso and the red-blooded GranSport.<br/><br/>GranLusso featuring Zegna Silk interiors<br/><br/>Irrespective of its powertrain, every Levante can be upgraded to the GranLusso trim, which adds additional refinement through its exclusive Ermenegildo Zegna Silk upholstery, Radica open-pore dashboard wood and leather steering wheel.<br/><br/>The Ermenegildo Zegna silk in dark grey anthracite combines with three different shades of luxurious fine-grain leather (black, tan and red) and 100% natural fiber Zegna mulberry silk inserts on the seats, door panels, roof lining, sunshades and ceiling light fixture.<br/><br/>Silk, an inherently sophisticated material, is further embellished by the hand- stitched macro-chevron. On the door panel, the matching salt and pepper silk jersey is enhanced by alternating rib embroidery.<br/>As for the seating, the extra fine-grain leather with contrasting light grey stitching comes with a central silk insert with a micro-chevron weave of vertical rolls on the central seat and backrest area.<br/><br/>On the door panels, the central parts are covered with Zegna silk jersey and embellished by a diagonal roll pattern, with tone-on-tone ornamental stitching and alternating rib embroideries. The same fabric is used to cover the car's roof lining and sunshades.<br/><br/>The sophisticated, luxury finish of the car interior can also be seen in the headrests, which feature an embroidered Trident emblem and contrast stitching. This unique and exclusive silk is made using a patented process in Trivero, Italy by the Zegna wool mill.",
"id": "10903",
"product_name": "Maserati Levante GranLusso Zegna Interior",
"video_url": ""
}