{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10909",
"category": "Product > lighting: floor",
"company_name": "ART + ALCHEMY",
"company_url": "www.artandalchemydesign.com",
"description_html": "The Pivot Plug-In was designed with an articulating assembly of hexagonal bars (either brass rods; or distressed threaded steel rods), bearings and joints that carry current to seven LED lux capacitors. These articulations were originally developed for stop-motion animation. The design allows for a significant range of adjustability, articulation and movement, with an exceptional level of customization. Three brass shields are included and can be mounted with any of the glass capsules that contain the LEDs. The Brass version features Opal glass; the Steel version features Amber and Smoke glass capsules. The Pivot is a floor lamp that is ceiling mountable with its base that rests on two brass balls. The light is turned on/off with a foot switch connected to the 10’ power cord. The Pivot Plug-In is offered in two versions: Waxed Brass + Blackened Steel; or Mixed Steel + Brass (images of both versions shown). Dedicated LED, 2700K, Dimmable.<br/><br/>ART + ALCHEMY began as an opportunity to elevate lighting design using exquisite, artisan-made, hand-finished materials. The designers’ mission was simple—remove all restraints and create the most beautiful, one-of-a-kind pieces that they could envision. No longer bridled by a defined set of materials or finishes, our designers were free to explore their ideas. What resulted was an eclectic gathering of unique pieces for extraordinary spaces, and the launch of an entirely new lighting design atelier, called ART + ALCHEMY.<br/><br/>Designers: David Kitts + Andy Morter<br/>An extroverted introvert, David Kitts strives to solve more problems than he creates. His education and experience in both design and engineering have taught him to never let your ego get in the way of a good, solid design. His passion for seeing an idea come to life is only surpassed by being able to do so successfully, here, in Vermont. A quiet collaborator, David pulls inspiration from the designers, engineers and the artisans he works with every day.<br/><br/>As the son of two entrepreneurs in the decorative lighting business, Art + Alchemy Design Developer Andy Morter learned the importance of craftsmanship early, balancing engineering with beauty. Andy’s passion for all things mechanical was derived from watching his father build and restore hot rods and motorcycles – his version of moving works of art. This informs his view on everything he builds today. Andy might envision an LED platform as the “chassis” where the beauty of the piece is defined by its purpose. Constantly pushing himself to explore both the oldest and newest materials available, Andy works to blend and push the limits of what’s possible.",
"id": "10909",
"product_name": "Pivot Plug-In",
"video_url": ""
}