{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10919",
"category": "Product > flooring: carpet/rugs",
"company_name": "Louise Carrier for Rug Couture",
"company_url": "https://www.rugcouture.com/",
"description_html": "The Sumi 墨 Collection of exclusive, hand-made rugs takes its name from the Sumi ink used to create the original designs. Inspired by Louise’s love of Japanese aesthetics and the natural world, the eight designs in this concept collection are brought to life in hand knotted form through the luxurious combination of colour and material lustre. New Zealand wool and art silk are used together so that each design is not only delineated by colour but by the differing light reflecting properties of the materials themselves. <br/><br/>Drawing was used as a form of notation in direct response to the eight natural phenomena that inspired the designs. In the River – Kawa 川 rug the abstract motif almost records the play of light on the water's surface. The process of Suminagashi 墨 流 し or “floating ink” was explored to create the Mountain 山 rug, a homage to Fuji-San. Whereas the practice of drawing Ensō 円 相 or circles with ink inspired the Rocks 岩 pattern. The making of repeated drawings led to an appreciation of the irregular forms in accordance with the concept of wabi-sabi 侘 寂 or the beauty of imperfection. <br/><br/>In this way, Sumi 墨 seeks to continue the long-established tradition in rug design of utilising symbolic motifs. A contemporary take on this practice, Louise has included non-figurative motifs throughout the collection which aims to impart something of the beauty and essence of the natural phenomena that inspired it into the interior. All the patterns in this concept collection will sit well together, as it was conceived of as a whole making them ideally suited to multi-room schemes and larger projects which require a theme.<br/><br/>All the designs in the collection are available in four carefully chosen colourways, five sizes and in New Zealand wool and art silk via Rug Couture. They are also available in hand tufted form for contract use. Louise offers a bespoke design service giving customers access to individual colour and material combinations and custom size options.",
"id": "10919",
"product_name": "The Sumi 墨 Collection",
"video_url": ""
}