{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10915",
"category": "Product > flooring: carpet/modular",
"company_name": "Interface",
"company_url": "www.interface.com",
"description_html": "One of Interface’s most recent global flooring collections, Global Change™ creates a sense of wellbeing and engagement through a multitude of colors, patterns, textures, formats and materials that celebrate the sensory experience. This premier collection includes unique carpet tiles in a mix of 50cm squares and 25cm x 1M Skinny Planks™ formats, with a range of lush-soft and crisp-delineated constructions. <br/><br/>Global Change is comprised of seven styles available in six earthy, mineral-based colorways: Eclipse, Evening Dusk, Desert Shadow, Fawn, Daylight and Morning Mist. Progression™ I, Progression II and Progression III, the collection’s foundational Skinny Planks, offer three gradated base textures at different pile heights. Glazing™ and Shading™ take inspiration from the tree canopy with foliage appearing as positive shapes against striations of texture. The texture and pattern of Progression I is incorporated into the background of the crisp foliage pattern within Shading, The same is true of Progression III, which creates that background for the more diffused organic patterning in Glazing. The result is the ability to transition from a beautifully simplistic base texture into the organic pattern of your choice in a smooth organic flow, or to mix and match to create more distinction within a space.<br/><br/>The two 50 cm square format styles featured in the collection, Ground™ and Raku™, round out the collection. Ground has a scaled down, tight construction like that of Glazing and Progression III but with a non-literal pattern reminiscent of branches or exposed roots. In contrast, Raku offers a plush, modeled interpretation of cracked, dried earth and can be installed as non-directional squares to create a monolithic appearance on the floor.<br/><br/>Global Change not only provides a beautiful aesthetic, but is also an environmentally-friendly product. The collection’s modular design makes it easy and affordable to replace worn carpet, and the system was created to be attainable at all price points. The collection’s styles are designed to harmoniously blend and coordinate with the patterned tiles, but also can be combined to play up contrasting texture and varying pile heights. The collection provides the flexibility to use one coordinating collection to respond to different needs within a space with varying looks, scales of pattern, textures and price points. Its variety makes it ideal for a range of customer environments, including corporate office, hospitality, multi-family and senior living, and education.<br/><br/>Global Change is available in all Interface markets, around the world and employs a solution-dyed Universal nylon-6,6 yarn system. It is remarkably lightweight, thereby reducing the ecological footprint of shipping. The total recycled content ranges from 26-69 percent.",
"id": "10915",
"product_name": "Global Change",
"video_url": ""
}