{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10923",
"category": "Product > flooring: carpet/modular",
"company_name": "Interface",
"company_url": "www.interface.com",
"description_html": "The most positive spaces offer variability and choice. Human Connections supports the design of positive spaces with eight different styles, which can be used alone or easily combined in unique ways to create paths, intersections, collision zones and destinations. Sett in Stone™, Kerbstone™, Paver™ and Flagstone™ are four textures that recall the well-worn streets of the city, while Moss™ and Moss in Stone™ attach seamlessly to Sett in Stone or Kerbstone to introduce the greenery we crave in a very organic way. The collection is rooted in four neutrals – Granite, Slate, Flint &amp; Onyx, which serve as the background to the infusion of the green accent in aptly named MossTM and Moss in StoneTM. To complete the collection, we have included two styles from FLOR® by Interface, Rue™ and Stone Course™. These highly patterned and colorful styles add a lively graffiti-like impact. Each of these styles offer a mosaic aesthetic with Rue being the more graphic pattern featuring two tones of each bold accent color including Red, Pink, Purple, Teal, Green, Yellow, Orange and a slightly softer approach with color Grey. Stone Course offers a slight downsize in scale and the amount of color but maintaining the mosaic interpretation in the same eight color ways as Rue.<br/><br/>The collection is designed to work as a coordinating, but varied system that may be used throughout an environment and respond to the needs within the space and the way people live/work/play. The system of Human Connections products can support areas of focus for energy and collaboration, as well as aid in flow by combining styles to create pathways and intersections. The collection has the flexibility to create distinct division of space, or more subtly define areas with organic transitions. This versatility lends itself to creating a positive space that mimics transitions in nature and one that can be adapted to the needs of occupants over time.<br/><br/>Human Connections will be available in all Interface markets, around the world. Consistent with Interface’s ongoing approach to design, Human Connections not only provides a beautiful aesthetic, but also has biophilic attributes, which research indicates contribute to positive emotional and physiological benefits for those occupying the space. The collection combines long-term performance and is environmentally friendly. All six Interface styles within the collection are designated as i2, offering a mergeable dyelot benefit that simplifies selective replacement and supports the long-term beauty of the floor. The yarn system is Aquafil Type 6 Nylon – fully solution-dyed and comprised of 100 percent recycled content.",
"id": "10923",
"product_name": "Human Connections",
"video_url": "https://www.youtube.com/watch?v=apsdFeytRms"
}