{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10926",
"category": "Product > bath: cabinetry",
"company_name": "Kohler",
"company_url": "www.us.kohler.com",
"description_html": "The Verdera collection now offers lighted mirrors and medicine cabinets. They provide even, optimally bright lighting, which eliminates harsh shadows and hot spots. Adding a dimmer switch gives you even more control over your lighting and the atmosphere of the room. An electrical outlet included within the medicine cabinet gives you more convenience when getting ready for your day. So if your daily routine includes primping, plucking, shaving, brushing or applying makeup, install a Verdera lighted mirror or medicine cabinet and see yourself in a whole new light.<br/>The design of this high quality mirror with LED technology embedded behind the glass allows for effortless cleaning and robust performance in humid bathroom environments. The 90CRI LED assembly with improved optics provides 1500 lumens of light focused on the user with perfect diffusion and edge to edge illuminance so there are no hot spots or dark spots. Verdera Lighted has an approximately 3,000 Kelvin light appearance that delivers a neutral light ideal for overall bathroom aesthetics as well as tasks (lower Kelvin has yellow tint; higher Kelvin have bluer tint). Verdera Lighted's minimum 90 CRI lets you see yourself in the truest light - the closest thing to natural light on the market - for makeup application, grooming, and skin care. <br/>The Verdera medicine cabinet can be surface-mounted, cutting down on the time and work required for installation. It is essentially the same process as hanging a picture frame, as opposed to the bottom-up installation required for most cabinets.<br/>The easy installation makes the cabinet ideal for both DIY and professional installation projects. Several of the cabinet models can open with a left- or right-hand swing for more space-planning options. And the cabinets can also be recess-mounted.<br/><br/>Verdera medicine cabinets and mirrors are available in a wide range of sizes and options. They’re made with rust-free aluminum-ideal for moist bathroom environments. They also offer high-end features such as slow-close hinges, which prevent the door from slamming, and outlets within the medicine cabinet for added convenience. Verdera is available with an optional exposed shelf that provides quick access to the grooming items you use most.",
"id": "10926",
"product_name": "KOHLER Verdera Lighted Mirrors and Medicine Cabinets",
"video_url": "https://www.youtube.com/embed/zHNJO1cIm8E?rel=0"
}