{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10922",
"category": "Product > lighting: sconce",
"company_name": "ART + ALCHEMY",
"company_url": "www.artandalchemydesign.com",
"description_html": "The Stacks Sconce’s beauty borne of simplicity and elegance. It features an LED light source encased in machined solid brass and layered with exquisite hand-poured clear glass blocks created by renowned glassmaker, Simon Pearce. A brass outcrop projects from the back plate. Two cables hang from the projection threading through the strata of brass and glass below. These low-voltage cables power the dimmable LED source housed within the center brass layer. Its up- and down-light, creates a soft glow that emerges from the center of the cast glass blocks. The Stacks Sconce is available in an exquisite hand-rubbed finish, in a choice of Waxed Brass or Blackened Brass. Adjustable hanging height from 10” to 60”. ADA Compliant.<br/><br/>Available exclusively to the trade, ART + ALCHEMY designs are both sculptural and distinctive. Our curation is an eclectic gathering of unique pieces, grounded in a reverence for the art of good design. In creating our lighting designs, ART + ALCHEMY draws from a rich palette of materials—brass, steel, stone, wood, cast metals, artisanal glass, and more. Alchemy is a tradition practiced throughout Europe, Egypt and Asia for centuries. It is aimed to purify and perfect; to transform something in a mysterious way. It is what our designers do each day in the Workroom.<br/><br/>Designers: David Kitts + Andy Morter<br/>An extroverted introvert, David Kitts strives to solve more problems than he creates. His education and experience in both design and engineering have taught him to never let your ego get in the way of a good, solid design. His passion for seeing an idea come to life is only surpassed by being able to do so successfully, here, in Vermont. A quiet collaborator, David pulls inspiration from the designers, engineers and the artisans he works with every day.<br/><br/>As the son of two entrepreneurs in the decorative lighting business, Art + Alchemy Design Developer Andy Morter learned the importance of craftsmanship early, balancing engineering with beauty. Andy’s passion for all things mechanical was derived from watching his father build and restore hot rods and motorcycles – his version of moving works of art. This informs his view on everything he builds today. Andy might envision an LED platform as the “chassis” where the beauty of the piece is defined by its purpose. Constantly pushing himself to explore both the oldest and newest materials available, Andy works to blend and push the limits of what’s possible.",
"id": "10922",
"product_name": "Stacks Sconce",
"video_url": ""
}