{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10934",
"category": "Product > (NEW) packaging",
"company_name": "HAVN SPIRITS",
"company_url": "www.havn.com",
"description_html": "Created by Steve Symmons (the founder and owner of BuzziSpace) and his partner Sas Adriaenssens, HAVN SPIRITS is a new luxury beverage brand, conceived with the world traveler in mind. <br/><br/>HAVN is more than a spirit, it's a mindset. HAVN is that safe place to be after a turbulent journey -- a home, a shelter, a refuge. It's a place where people meet to share their travel adventures, show each other their finds, and prepare for their next trip. It's about having time to drink, eat and talk, talk about the new flavors of other cultures and distant travels. <br/><br/>Echoing the ethos of the brand, HAVN is inspired by old shipping routes and harbor towns, and the ancient ships that transported spices and valuable materials such as gold, silver, copper and black coal. These ancient treasures from the ship belly inform both the exterior packaging design, as well as the product itself. Each bottle reflects one of the four ores. Inside, you'll taste a delicious blend of traditional spices used to flavor the gin. <br/><br/>HAVN offers four distinct products, each with its own character and flavor, representative of the in the four corners of the world -- which is also reflected in its packaging. Gins that, through their flavors, take you to different places, different customs, rituals and people. <br/><br/>Sas Adriaenssens is behind the product packaging and was also the chef and chief mixologist behind creating the HAVN's flavors. The glass bottles are hand-sprayed by hand, then finished with a proprietary technique to achieve a frosted effect. Each bottle is different and unique, communicate quality and high value with a distinguished design. <br/><br/>Sas came up with the design to clearly differentiate between different flavors within the product line, and to create definite visibility on the shelf. HAVN strategically launched with four flavors to ensure a wide position on the shelves of its retailers, with a sophisticated, minimal look.",
"id": "10934",
"product_name": "HAVN SPIRITS",
"video_url": "https://www.youtube.com/watch?v=7AbTO2wpyk0"
}