{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10931",
"category": "Product > seating: residential/accent",
"company_name": "O&G Studio",
"company_url": "www.oandgstudio.com",
"description_html": "Designed by Jonathan Glatt and Sara Ossana of O&amp;G Studio, the Wayland Continuous Snake Armchair fuses traditional stylistic influences – a hallmark of the brand – with exquisite detailing and artisan hand-craftsmanship. Taking approximately 40 hours to complete from start to finish, the result in a one-of-a-kind accent chair built to last for generations. <br/><br/>An homage to the wisdom and inventiveness of traditional American design, the Wayland Snake Armchair is inspired by the form and silhouette of the classic early American-Windsor chair. This style, which originated in the 18th century, emerged as a simplified and visually lighter interpretation of the British Windsor chair – American craftsmen eliminated its extraneous details, and slenderized the splats and legs for a more delicate, airy appearance. <br/><br/>O&amp;G’s Wayland Snake Armchair shares the same characteristics -- featuring a spindled back uninterrupted by a central splat, slim proportions, and a streamlined silhouette, the piece can be described as a continuation of the American-Windsor’s legacy. It also features a “continuous arm,” in which a chair’s arms and back rim are made of a single, bent piece of wood. This development also arose with the birth of the American-Windsor, strengthening the chair while also giving it a lighter, more balanced look. In addition, O&amp;G’s Wayland Snake Armchair also draws from the American-Windsor’s legacy of hand-craftsmanship, with continuous, hand-carved arms and a hand-shaped saddle seat.<br/><br/>Meanwhile, the snake motif of O&amp;G’s chair pays tribute to another part of traditional American design, American folk art. Animals were a favorite subject for naturalistic and allegorical carvings during the 18th and 19th centuries, and were frequently incorporated into walking sticks and sculpture. This was in part due to the prevalence of nature in day-to-day life during this time, but also the influence of Native American design traditions and their frequent incorporation of animal motifs. Consequently, the hand-carved snake motif of O&amp;G’s Wayland chair is not only a preservation of this rich legacy, but also modernizes the piece with exquisite detailing that would have been viewed as too time-consuming and therefore, unnecessary, by early American-Windsor craftsmen.<br/><br/>O&amp;G’s Wayland Snake Armchair is made by local artisans at the studio’s headquarters in Warren, Rhode Island, and is available in their Ebony, Beet, or Azimuth stained finishes. <br/><br/>The Wayland Snake Armchair is a synthesis of two incredibly important and influential American design traditions – when fused together, the result is distinctly contemporary, without sacrificing either’s historical significance or defining characteristics. From a larger perspective, this idea of keeping the traditions American design alive by updating them for modern day is a hallmark O&amp;G Studio’s approach towards design as a whole, and why their pieces are not just aesthetically beautiful, but historically and culturally significant as well.",
"id": "10931",
"product_name": "Wayland Snake Arm Chair",
"video_url": ""
}