{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10938",
"category": "Product > bath: fittings",
"company_name": "Kohler",
"company_url": "www.us.kohler.com",
"description_html": "The Artifacts faucet collection was inspired by turn-of-the-century charm and backed by the Kohler Company’s 140 years of quality craftsmanship. The faucet collection is offered in both bathroom and kitchen styles; kitchen faucets offer modern functionality in a traditional design and bathroom offering brings a new level of personalization to the space through choices in spouts and handles. The Artifacts collection extension brings to market a kitchen bridge faucet, a bathroom flute spout and the collection’s foray into lighting. <br/><br/>The Artifacts bridge faucet is a chic twist on a classic, turn-of-the century design; it conveys a striking style that is both nostalgic and modern. The deck-mount bridge faucet comes in four models: one for kitchen sinks and a more compact style for secondary or bar sinks, and both can employ either lever or six-prong handles. The faucet features a matching dual-function sidespray that offers both the powerful Sweep spray for cleaning and the gentler BerrySoft spray options for fast, convenient rinsing of fruits and vegetables. KOHLER’s proprietary ProMotion technology employs a quiet braided hose and swiveling ball joint to make sidespray usage uncomplicated and comfortable. And the kitchen sink faucet has a tall swing spout that rotates a full 360 degrees, providing the necessary clearance to allow for easy filling and cleaning of larger pots.<br/><br/>The Artifacts flume spout and cross handle additions provide consumers with expanded spout and handle options in the bathroom collection allow for a unique personalization. The bathroom sink spout has an open flume design that channels water beautifully into a graceful, elegant waterfall. The cross handles feature easy-to-install and leak-free UltraGlide™ valves.<br/><br/>Artifact’s foray into lighting comes in the form of three sconces: single wall, double wall, and single wall sconce with adjustable cord. True to the original inspiration of this collection, the new sconces are reminiscent of antique candle lanterns, paying homage to the vintage industrial trend.",
"id": "10938",
"product_name": "KOHLER Artifacts Collection Extension",
"video_url": ""
}