{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10930",
"category": "Product > bath: fittings",
"company_name": "Kohler",
"company_url": "www.us.kohler.com",
"description_html": "To replicate the gentle building of a rain storm, Real Rain is designed with a water reservoir that relies on gravity at its core rather than a pressurized spray to shape the individual drops of a rainfall. When the reservoir fills, water spills into the remainder of the showerhead, covering 775 nozzles. Gravity does its job, and raindrops begin to fall softly, slowly through concave nozzles. They grow in strength and speed until the shower feels, sounds and looks like a warm summer rain. In our exploration of rain, we wanted to push the design a bit further and capture that moment in a storm when the sky opens in a sudden energetic burst of heavy rain. The deluge feature is designed to store a gallon of water while the primary rain feature is running. And then, with the push of a button, an exhilarating deluge of water is released in a warm drenching burst, a half-gallon of water pouring over you for eight seconds. A byproduct of the reservoir design, the nozzles at the center of the showerhead are engaged only when the deluge feature is operating. This allows us to provide a circular, rain-free zone for the face, allowing the person to stay within the experience. Real Rain is a truly unique take on how we use water to create desirable experiences. Real Rain is a testament to what can be achieved when we ask the right questions and deliver authentic answers to those questions; not the easy, fast, or preconceived answers. While aesthetically intriguing, the real design of this product is about the experience that it gives, it's about the visceral reaction one gets, it's about fostering a mental transportation and respite from the day's stresses. Rain's natural feel is deeply intertwined with our humanity. Because of the reservoir and gravity dynamic, we also are able to provide the full experience of a rainfall while keeping the water use to an exceptionally efficient 2.0 gallons per minute. Thinking beyond traditional pressurized sprays, Real Rain's use of gravity allows the water experience to be spread over a large surface area to create a warm enveloping rainfall. Other traditional overhead sprays may use up to 4 times as much water to produce a standard pressurized shower. The other unique element of a gravity fed rain is that the water's heat energy transfer to the skin is dramatically better than the traditional sprays. Traditional sprays; because of their velocity tend to ricochet off the skin, while gravity fed droplets softly land on the skin efficiently transferring most of their heat to the person. This allows less water to be used while not sacrificing the comfort and cleansing functionality of a proper showering experience. At Kohler, we are very cognizant of water's preciousness and continually seek ways of delivering unique experiences with minimal ecological impact. With this always in mind, innovations like Real Rain are fostered and allowed to be realized.",
"id": "10930",
"product_name": "KOHLER Real Rain shower panel",
"video_url": ""
}