{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10978",
"category": "Product > flooring: tile and stone",
"company_name": "American Olean",
"company_url": "http://americanolean.com/",
"description_html": "Theoretical Bold™ by American Olean makes a splash into the tile market with bright and spirited colors. Designed to complement the existing Theoretical™ series, this collection features graphic variation for visual depth and richness that can be used on floors for an eye-catching flare. Laying a stunning foundation for designers in commercial and residential settings, this outgoing surfacing is sure to turn heads for all of the right reasons. <br/>Available in six standout hues, ranging from Academic Red to Electric Blue, Theoretical Bold bolsters projects in higher education buildings and hospitality settings. With the use of unexpected colors emerging as a top design trend, Theoretical Bold stands out for its dynamic palette. This collection allows designers to take their projects to new heights without feeling limited by color selection. <br/>With two field tile sizes to choose from, 12x24 and 24x24, this series can serve as the star of the design or the complementing feature. Because this tile is also water, chemical and scratch resistant –<br/>customers can trust Theoretical Bold to endure in high-traffic areas. <br/>Produced with Reveal Imaging® and TruEdge™ technology, this porcelain series delivers in style and durability. Through years of impact and exposure, this tile will preserve its new and vivacious look. Reveal Imaging ensures that this series imparts the modern look of stone – with all the benefits of porcelain. Reveal Imaging also provides supreme color definition, detailing and sharp veining. With TruEdge technology integrated into this product, grout lines are less apparent to those walking across the tile on a daily basis. Overall, smaller grout lines result in a smoother finish and improve cleanability. Colorbody™ technology infuses every layer of tile with rich color to maintain its appearance over time.<br/>Through the Greenworks™ program, American Olean strives to contribute beautiful and sustainable design in every way possible. Theoretical Bold is manufactured using a mix of pre-consumer and post-consumer recycled resources. Specifically, this series is created with a blend of 48.30% pre-consumer recycled metals, stone and clays. Additionally, pre-consumer recycled materials combined with only naturally occurring ingredients means that, at the end of its lifecycle, Theoretical Bold tile can safely assimilate back into the environment. <br/>Theoretical Bold brings your design vision to life through exciting color, performance and the promise of American Olean at your side.",
"id": "10978",
"product_name": "Theoretical Bold",
"video_url": ""
}