{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10972",
"category": "Product > wall covering: tile and stone",
"company_name": "American Olean",
"company_url": "http://americanolean.com/",
"description_html": "Inspired by the organic, woven look of fabric, Elemental Canvas™ by American Olean uses rich colors and graphics to create the illusion of texture. Perfect for hospitality settings and urban residential applications, Elemental Canvas integrates natural beauty with contemporary design. This tile stands apart for its interlaced surfacing, which takes modern design to the next level. Adding a hint of intrigue, Elemental Canvas creates a welcoming and relaxing atmosphere in a multitude of public and private venues.<br/>A popular trend in 2017 is experimentation with texture and gradient. Elemental Canvas adds subtle texture to walls transforming monochromatic surfaces into rich works of art. Available in five color options, ranging from ivory to dark gray, this tile can lay the foundation for a broad spectrum of design styles. Also offered in 1” x 3” glazed ceramic mosaic options, this series gives designers the ability to customize their projects without sacrificing performance.<br/>Designed with Reveal Imaging® and TruEdge™ technology, this porcelain series delivers classic wall tile and linear mosaic accents for sleek, fashionable combinations. With TruEdge technology at the helm, grout lines become less apparent to the average eye. Colorbody™ technology infuses every layer of tile with rich color to ensure that its appearance is maintained and durable for years to come. The porcelain composition of this tile also means that it is resistant to moisture damage, chemicals and scratches. Through years of wear and tear, these unique features will work together to keep your surfaces looking new, vibrant and chic. <br/>State-of-the-art Reveal Imaging ensures that this series imparts the modern look of canvas – with all the ease of porcelain. Using this innovative printing technology creates minimal pattern repetition for a more authentic appearance. Providing unmatched color definition and sharp details, designers can use this series as the star of their project or to harmonize with other features. <br/>Whether you are a commercial architect, homebuilder or interior designer, American Olean has a variety of beautiful products that can bring your vision to life in an environmentally responsible manner. Elemental Canvas falls into this category as the series is composed of a blend of 48.30% pre-consumer recycled materials, minimizing the use of raw materials in its production. Pre-consumer recycled ingredients combined with naturally raw materials means that, at the end of its lifecycle, Elemental Canvas tile safely assimilates back into the environment. <br/>With eco-friendly projects growing in demand, Elemental Canvas not only delivers a high-end product, but also helps designers demonstrate their commitment to sustainability, durability and sophistication.",
"id": "10972",
"product_name": "Elemental Canvas",
"video_url": ""
}