{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10985",
"category": "Product > wall covering: tile and stone",
"company_name": "Marazzi",
"company_url": "http://www.marazziusa.com/",
"description_html": "For a modern twist on timeless stone, the Classentino Marble™ series by Marazzi delivers the bold look of marble with all of the benefits of porcelain. The intricacies and veining reproduced in this series create an authentic marble appearance without the high cost and maintenance. Classentino Marble helps designers looking for a cohesive look achieve an elegant and seamless transition from floors to walls. <br/>In addition to its stunning beauty, Classentino Marble is low maintenance, which is ideal for high-traffic residential or commercial areas. Because porcelain is naturally water, liquid and stain resistant, this tile will sustain its appearance through years of impact. Combining these porcelain qualities with proper installation – designers can rest assured that this collection will last for years and require minimal repairs during its lifespan. <br/>As trendy as it is sturdy, Classentino Marble meets designer needs for realistic marble patterns with a variety of finishes, mosaics and trims. The color palette for Classentino Marble boasts five versatile options in both matte and polished finishes. The signature veining of marble is intricately reproduced using Reveal Imaging® technology. This state-of-the-art digital printing allows tile to perfectly emulate surfaces and textures found in nature. When combined with other technologies during the glazing process, Reveal Imaging can develop 3D-style visuals that are almost indistinguishable from real minerals. Incredible color and detail come to the surface of every tile through this process, setting these products apart from industry competitors. TruEdge™ technology reduces the overall appearance of grout lines in the surfaces, resulting in a sleek and lavish façade.<br/>The Marazzi design team focuses on both design and creativity when curating collections to deliver the best-in-class wallcovering and flooring solutions to customers. Classentino Marble offers an aesthetic rooted in Italian heritage and artistically combines the best of both old and new marble surfaces. The matte and polished finishes give customers the ability to find a look that takes their designs to new heights. <br/>Classentino Marble is also available in classic weave and linear hex mosaic styles. Making a profound statement on walls, these mosaics can be used as an accent to the collection or to add a personal touch to surfaces. The available coordinating trims also give contractors the ability to seal off the tile edges, providing a cleaner finish to project spaces. <br/>Whether you are designing your dream kitchen or a bathroom oasis, Classentino Marble serves as the ultimate tile choice for trusted performance and a luxurious touch.",
"id": "10985",
"product_name": "Classentino Marble",
"video_url": ""
}