{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10984",
"category": "Product > flooring: tile and stone",
"company_name": "Marazzi",
"company_url": "http://www.marazziusa.com/",
"description_html": "The Urban District MIX™ collection from Marazzi offers designers and customers alike a variety of eclectic, reclaimed wood-looks in glazed porcelain. Designed for commercial and residential spaces, Urban District MIX can be installed on floors as well as walls, backsplashes and countertops. <br/>Mixing old with new, Urban District MIX emphasizes industrial design and explores the timeless quality of raw materials. Inspired by urban spaces found in downtown warehouse buildings, this collection offers aged, painted woods to cater to a broad range of style preferences such as rugged chic, coastal and farmhouse. <br/>With variations in size, texture and color, Urban District MIX provides designers with numerous options, allowing them the freedom to add a personal touch to their project. Included within the Urban District line, MIX is available in six modern colors based on matured, painted wood. The depth of detail in each surface combines seamlessly with organic colors. Delivering in performance, a resistant facial finish fuses to the porcelain body ensuring that this collection will stand the test of time. <br/>Wood-look tile has been popular in the industry for years, and Marazzi has focused on designing bold, stylish collections to meet this trend. Because of the versatility of this material, it is expected that demand for wood-looks will continue to increase from 2017 into 2018. This series takes a fresh approach to a classic look, showcasing the blend of rustic wood graphics with trending colors. The plank size, 4” x 28”, also helps designers integrate this style more seamlessly into their vision. With the demand for wood-look only increasing within the industry, the flexibility of Urban District MIX helps this collection stand apart from competitors.<br/>State-of-the-art Reveal Imaging® technology enables Marazzi to replicate the look of wood, adding in color variations and knots so it is nearly indistinguishable from authentic planks found in nature. With random variation graining and fine canyon-lines, the texture of this tile creates a warm and lavish atmosphere that designers will love.<br/>Because this collection is composed of porcelain, it delivers benefits such as resistance to frost, stains and scratches. Durable and easy to maintain, Urban District MIX offers the luxury of porcelain at a more economical cost than comparable real hardwood flooring.<br/>These properties of glazed porcelain make this series an ideal solution for designers that desire a high-end, detailed look without the stress of maintenance. Other high-performing characteristics of this series include a greater than .05% moisture absorption, less than 275 lb. breaking strength and chemical resistance.<br/>Today, this porcelain tile not only possesses the authentic look of wood, but also the organic feel of the natural material that designers will crave in their rustic projects.",
"id": "10984",
"product_name": "Urban District MIX",
"video_url": ""
}