{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10999",
"category": "Product > seating: contract/lounge",
"company_name": "Bernhardt Design",
"company_url": "bernhardtdesign.com",
"description_html": "Lilypad represents exactly what its name suggests. The floating leaf of the water lily is culminated by a blooming lotus flower. The Egyptian sky god Horus was often depicted in ancient art sitting on the Egyptian Blue Water Lily. This image inspired the unique combination of an oval table, with a beautiful chair which appears to be a blossom rising above the table. <br/><br/>The Lily Chair takes it cue from the sinuous form of the Lilypad. It features a continuous unbroken line that traces the exterior of the chair which encases a soft circular cushion much like the center of a blooming flower. The chair subtly converges from an open bloom at the top, to a perfect circle at the base.”<br/><br/>Lilypad is 60”W x 33”D and features a lounge chair that incorporates a self-returning swivel mechanism, which rests on a solid American walnut platform. The platform also incorporates a circular insert, which is available in three Silestone colors in subtle suede finishes. The walnut platform can be selected in a number of walnut finish colors and the chair may be specified in Bernhardt Textiles leather and fabrics, or the customer’s own material.<br/><br/>The Lily chair is available on a stationary base or a base with a self-returning swivel mechanism. Lily is a fully upholstered lounge chair that may be specified in Bernhardt Textiles leather and fabrics or the customer’s own material. Top stitching is employed around the perimeter to highlight the continuous loop of the chair’s design.<br/><br/>Lilypad improves on incorporating a swivel chair with a surface space for lounge into one compact unit.<br/><br/>Ideal for a variety of public spaces, lounge areas, and office, both Lilypad and Lily Chair feature adaptability components.<br/><br/>Lilypad + Lily Chair designs adapt to a variety of spaces, creating practical solutions to meet the evolving spatial needs for today’s interior environments. The designs include lounge and tables systems that are sleek and streamlined while being comfortable and welcoming.<br/><br/>In keeping with the exceptional resources of Bernhardt Design, each design in the Modern Family collection meet all BIFMA standards for use in contract spaces.<br/><br/>Lilypad is 60”W x 33”D and features a lounge chair that incorporates a self-returning swivel mechanism, which rests on a solid American walnut platform. The platform also incorporates a circular insert, which is available in three Silestone colors in subtle suede finishes. The walnut platform can be selected in a number of walnut finish colors and the chair may be specified in Bernhardt Textiles leather and fabrics, or the customer’s own material.<br/><br/><br/><br/>The idea to merge a \"lilypad\" surface with a chair into a sleek design, creates a new twist for an innovative product.<br/><br/>Both pieces are GREENGUARD certified. Bernhardt Design and Bernhardt Textiles is an EPA Climate Leading Partner, and facilities are certified and level audited. Made in the USA.",
"id": "10999",
"product_name": "Lilypad",
"video_url": ""
}