{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10993",
"category": "Product > seating: contract/conference",
"company_name": "Bernhardt Design",
"company_url": "Bernhardtdesign.com",
"description_html": "The Chantal armchair and Chloe side chair were created as companion pieces to add gracefully rounded forms to collaborative workspaces. The seats offer a substantial cushion while maintaining a streamlined look with modern lines. Successfully merging function and style, Chantal and Chloe are suitable for an array of architectural spaces ranging from open public areas, waiting rooms and cafeterias to boardrooms, executive suites, and home offices. Both chairs are available with three distinctive base options: a tapered cast aluminum base, a minimal round tube base, and a five-star swivel base with casters. Each base option is offered in matte black powdercoat or polished metal finish. Chantal and Chloe provide remarkable back support as one is enveloped in the curved shell. The chairs are available in any fabric or leather from Bernhardt Textiles or the customer’s own material.<br/><br/><br/>Successfully merging function and style, Chantal and Chloe are suitable for an array of architectural spaces ranging from open public areas, waiting rooms and cafeterias to boardrooms, executive suites and home offices. The seats offer a substantial cushion while maintaining a streamlined look with modern lines.<br/><br/>Both chairs are available with three distinctive base options: a tapered cast aluminum base, a minimal round tube base, and a five-star swivel base with casters. Each base option is offered in matte black powdercoat or polished metal finish. The designs adapt to a variety of spaces, creating practical solutions to meet the evolving spatial needs for today’s interior environments. Offered in a multitude of bases for different spaces.<br/><br/>In keeping with the exceptional resources of Bernhardt Design, each design meets all BIFMA standards for use in contract spaces. Pieces are crafted from materials including: American walnut, American maple, and fabric or leather from Bernhardt Textiles or COM.<br/><br/><br/>The seats offer a substantial cushion while maintaining a streamlined look with modern lines. Successfully merging function and style, Chantal and Chloe are suitable for an array of architectural spaces ranging from open public areas, waiting rooms and cafeterias to boardrooms, executive suites, and home offices. Both chairs are available with three distinctive base options: a tapered cast aluminum base, a minimal round tube base, and a five-star swivel base with casters. Each base option is offered in matte black powdercoat or polished metal finish. Chantal and Chloe provide remarkable back support as one is enveloped in the curved shell. The chairs are available in any fabric or leather from Bernhardt Textiles or the customer’s own material.<br/><br/>Centered on the idea of what a “family” means, continuing to change, and becoming more open, the Modern Family collection is composed of pieces that each express its individuality while sharing a common bond. Each speaks the language of simplicity and graceful lines while maintaining universal forms, allowing to be paired comfortably with different styles of furniture and setting.<br/><br/>Both pieces are GREENGUARD certified. Bernhardt Design and Bernhardt Textiles is an EPA Climate Leading Partner, and facilities are certified and level audited. Made in the USA.",
"id": "10993",
"product_name": "Chantal + Chloe Chair",
"video_url": ""
}