{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/10995",
"category": "Product > seating: residential/accent",
"company_name": "Bernhardt Design",
"company_url": "Bernhardtdesign.com",
"description_html": "The Catia bench brings refinement and sophistication to a category of product that is often monotonous in a space. Catia incorporates a sleek, yet substantial cushion, which creates a streamlined silhouette. Light and airy in appearance, the bench features an elliptical fin base combined with a gently curved top. The upholstered seat is accented with a welt around the perimeter and a saddle stitch through the center of the seat on leather and non-railroaded fabrics. The seat is seamless when fabrics are railroaded. Catia can be selected with a frame in solid American walnut or solid American maple and is available in any fabric or leather from Bernhardt Textiles or the customer’s own material.<br/><br/>Catia's refinement and sophistication to a category of product that is often monotonous in a space. Catia incorporates a sleek, yet substantial cushion, which creates a streamlined silhouette. Light and airy in appearance, the bench features an elliptical fin base combined with a gently curved top. The upholstered seat is accented with a welt around the perimeter and a saddle stitch through the center of the seat on leather and non-railroaded fabrics. The seat is seamless when fabrics are railroaded. Catia can be selected with a frame in solid American walnut or solid American maple and is available in any fabric or leather from Bernhardt Textiles or the customer’s own material.<br/><br/>In keeping with the exceptional resources of Bernhardt Design, Catia meets all BIFMA standards for use in contract spaces. Pieces are crafted from materials including: American walnut, maple, Corian, aluminum, and fabric or leather from Bernhardt Textiles or COM.<br/><br/><br/>Catia speaks the language of simplicity and graceful lines while maintaining universal forms, allowing to be paired comfortably with different styles of furniture and setting.<br/><br/>Catia is GREENGUARD certified. Bernhardt Design and Bernhardt Textiles is an EPA Climate Leading Partner, and facilities are certified and level audited. Made in the USA.",
"id": "10995",
"product_name": "Catia Bench",
"video_url": ""
}