{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11004",
"category": "Product > (NEW) automotive: interiors",
"company_name": "Rolls-Royce Motor Cars",
"company_url": "www.rolls-roycemotorcars.com",
"description_html": "The Rolls-Royce Phantom is widely regarded as the world’s most luxurious automobile. So when the marquee designed the first new Phantom in more than a decade, it knew it had to produce a vehicle unmatched in style, status and sophistication. Rolls-Royce Motor Cars knew that to sustain its moniker as the “pinnacle of automotive luxury,” it could not merely update the Phantom’s aesthetic appearance, but needed to reimagine luxury travel as a category. <br/><br/>One of the main updates in the new Phantom was the vehicle frame, coined the “Architect of Luxury.” The all-new aluminum underpinning added lightweight features while still providing the stability and grace to maintain Rolls-Royce’s “magic carpet” smooth riding experience. <br/><br/>In addition to an all-new architectural design, the vehicle doors were automated with a press of a button located on the handle, which allows for an assistant or valet to effortlessly embrace the rider within the vehicle. <br/><br/>In addition, a central nervous system connects and controls all the various advanced intelligence systems of the Phantom, making it the most advanced luxury motor car available on the market. Some, but not all, assistance systems on-board New Phantom include: Alertness Assistant, a 4-camera system with Panoramic View, all-round visibility including helicopter view, Night Vision and Vision Assist, Active Cruise Control, collision warning, pedestrian warning, cross-traffic warning, lane departure and lane change warning, an industry leading 7x3 high-resolution head-up display, WiFi hotspot, and of course the latest navigation and entertainment systems.<br/><br/>The advancement of the new Phantom doesn’t end with the architecture or exterior, but is further amplified with updated features on the interior. It is the most silent motor car in the world. Extensive research and development ensured this, including 6mm two-layer glazing all around the car, more than 130kg of sound insulation, the largest ever cast aluminum joints in a body-in-white for better sound insulation, and use of high absorption materials. It is a perfect 360° cocooning effect in a motor car that is approximately 10 per cent quieter than its predecessor at 100km/h.<br/><br/>Additionally, for the first time, the motor car’s dashboard was redesigned, allowing patrons to commission artwork that spans the width of ‘The Gallery’ in their new Phantom. Rolls-Royce worked with several acclaimed artists, spanning from porcelain artists to gold welders, to develop galleries for future Phantom owners to select from, creating another element of luxury unknown in today’s vehicles. The artwork within ‘The Gallery’ are enclosed in a continuous case of toughened glass that runs the full width of the dash area. The instrument digital dials are framed with chrome, adding a degree of jewelry and continuity throughout the front of the interior.<br/><br/>All in all, the new Rolls-Royce Phantom offers customers with the most distinguished taste the pinnacle of luxury. From the re-imagined exterior, to the most minute interior detail, were careful designed to offer the most luxurious vehicle ever created.",
"id": "11004",
"product_name": "Phantom",
"video_url": "https://www.press.rolls-roycemotorcars.com/rolls-royce-motor-cars-pressclub/video/detail/PF0005575/b-roll-new-phantom-exteriors-and-interiors-with-music"
}