{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11013",
"category": "Product > acoustical applications",
"company_name": "Arktura",
"company_url": "www.arktura.com",
"description_html": "Soft Sound® Wood Texture Acoustical Systems expand on Arktura’s Soft Sound® Family of acoustical products, first introduced February 2015, to offer naturalist detail like never before. Achieve the same type of high-performance sound attenuation, but now with the tones and textures of authentic wood-grains. With Soft Sound® Wood Texture, we’ve built a perfect solution for those looking to enhance the acoustics of spaces, but also looking for the aesthetic qualities of wood, including assortments of beechwood, walnut, and oak, without the implementation and maintenance issues.<br/><br/>Soft Sound® Wood Texture acoustical systems combine the warmth and character of natural wood, and the sound attenuating properties of an engineered, high-performance acoustical material, in beautifully designed forms. Sustainably sourced and manufactured (100% recyclable PET plastic with up to 60% recycled content), Soft Sound® Wood Texture’s acoustical material is NRC rated as high 0.9, light-weight, durable, and fully-recyclable. Systems are available in a variety of textures and tones, as well as form factors. <br/><br/>Available form factors include Standard, ready-to-install modules, as well as highly Customizable formats, to fit your design vision and budget. Standard systems, such as SoundEdge™ and SoftGrid®, offer affordable building blocks for design and acoustics. Our Customizable Atmosphera® family, meanwhile, allows for the custom tailoring of fins under a number of parametric frameworks, including linear, undulating, and voronoi configurations. Fully custom applications of Soft Sound® Wood Texture Acoustical Systems (including customization of forms and grain-textures) are also available through our Solutions Studio® division. Whether you choose from our Standard range of natural looking, faux wood-grain textures, or work with Arktura to build one to your needs, Soft Sound® Wood Texture acoustical systems make it easy to achieve diverse naturalistic visual effects, while reducing the impact of noise across spaces. All without sacrificing a single tree.",
"id": "11013",
"product_name": "Soft Sound® Wood Texture",
"video_url": ""
}