{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11023",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "NY2O LLC",
"company_url": "www.ny2o.com",
"description_html": "Esther Behar Slubski career started in Cuba, earning her degree in Architecture from Georgia Tech in the 1960’s in the very first graduating class with women. After her apprenticeship with Marcel Breuer, her career and work ultimately took her New York City; working on hundreds of projects ranging from Bronx Community College, to Battery Park City, and the renewal of the St Regis Hotel in 1991. Celebrating her memory and designs: Sensitive, beautiful and always with a sense of purpose, NY2O, a family owned company, continue her design centric legacy with ongoing work to honor the precious resource that is water. <br/><br/>Her patented design of the bottle features an impressive groove running along the entire vertical length. The beauty is created with asymmetric dimensional planes. Form following function, beauty was indeed paramount to encourage reuse and sustainability for an everyday product. A sense of duty to the end-user to ensure recycling and find creative uses. This groove presented a design challenge for the label. <br/><br/>Taking inspiration for Esther’s personal collection of colored pencil artwork she created for many decades, the label is a marriage with the design of the bottle. The groove, is an ergonomic masterpiece for a drinking vessel. It also wonderfully bends light. <br/><br/>The label needed to emphasize the bottle, all the while possess meaningful branding. With geometric lines and patterns, it evokes the architecture of New York and at the same time, through the lens of the groove, creates a fluid and always changing landscape that is playful to the eye. Angle and lines are transformed into a prism of imagination. <br/><br/>Two patterns have been designed so far. One consists of diagonal lines that bends to look like wave patterns. The second pattern is a grid, that bends into a shimmering effect of water as seen through crystalline oceans and waterways. <br/><br/>These patterns distortions are unique and purposefully studied. It invites future exploration of design and art, all the while having continuity in product branding. It lends itself to further subtle changes for specific markets and cultures around the globe.",
"id": "11023",
"product_name": "NY2O Artesian Water",
"video_url": "http://www.nytimes.com/1971/04/11/archives/fighting-the-system-in-the-maledominated-field-of-architecture.html?mcubz=3"
}