{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11040",
"category": "Product > accessories",
"company_name": "Robern",
"company_url": "www.robern.com",
"description_html": "Reflecting your design in the perfect light. Our collaborative team will provide quality crafted design and cutting edge engineering solutions that perfectly reflect your vision.<br/><br/>Use Robern's sleek design and state-of-the-art technology to create a unique solution for your customer. With our Custom Lighted Mirror Program, you can choose the perfect size, shape, and high tech features to enhance your layout and customer's experience. Dimmable task lighting, hidden speakers, TV and USB connectivity, night lighting, automatic defogging and automation, such as voice activation and motion sensors — our innovative features will transform the everyday routine for your customers.<br/><br/>Beyond the Expected: Go beyond the basic mirror. From touchscreen controls to motion-sensing technology to digital displays, our features add unexpected convenience and luxury to your custom design.<br/><br/>1) Large sizes up to 70\" x 120\"<br/>2) Flexible lighting and etching<br/>3) Custom framing<br/>4) Add state-of-the-art features like LUM Lighting, one-touch dimming, OM Audio, defogging, USB ports, and integrated television<br/>5) Automation &amp; Smart Control Options<br/>6) Occupancy sensing and daylighting<br/>7) Voice activation<br/>8) Motion sensing<br/>9) Timeclock events<br/>10) Mobile device control<br/>11) Seamless integration with BMS, home and hotel automation systems<br/><br/>Custom Lighted Wall Mirrors can also be equipped with our popular Robern Experience Enhancers™ to elevate the everyday routine:<br/><br/>Subtle night light and wall glow<br/>Dimmable lighting technology and color tuning capability<br/>Mirror defogging<br/>USB charging ports<br/>Automation technology, including motion sensors<br/>Code compliance<br/><br/>With our Custom Lighted Wall Mirrors, you’re no longer limited by what you find in a catalog. Our design and engineering team will work with you to create the ideal mirror for any hotel, condo or other commercial project.<br/><br/>From custom sizes and shapes to decorative etching and beveling, Robern Custom Lighted Wall Mirrors can be designed to perfectly complement your space. Our team will work with your sketches, provide shop drawings, build mock-ups and ensure you receive the finished product you envisioned.",
"id": "11040",
"product_name": "Custom Lighted Mirrors",
"video_url": ""
}