{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11069",
"category": "Product > flooring: hard",
"company_name": "Chateau Napoleon",
"company_url": "www.chateaunapoleon.com",
"description_html": "IN THE MIDDLE OF THE PALETTE, NOYER BRULÉ SHOWS TONES OF CENDRÉ AND LEATHER, WITH JUST A HINT OF BLUSH. BATHED IN OUR FRENCH PLANT EXTRACT OIL FOR A SILKY SMOOTH TEXTURE...<br/><br/>Noyer Brulé hardwood flooring demonstrates the art of oxidizing and oiling techniques perfected by French master craftsman Bertrand. His unique process was developed over 40 years to seamlessly blend new and ancient wood and timber in French museums.<br/><br/>In 2015 Bertrand agreed to share his exclusive techniques with us. In the years since, his French oxidizing process has been applied to English Oak, Black Walnut, and American Oak flooring boards, creating the world's most beautiful hardwood flooring. Our master craftsmen initially began by applying the French techniques to Black Walnut with magical results! Noyer Cendré, one of our finest pieces, was born out of that early period. The Chateau Napoleon team continued to develop the process to suit other wood species, finally achieving our goal of creating a depth of beauty in our flooring that met the world's highest standards for durability and style. <br/><br/>Since our inception, our French oxidizing and oiling techniques have captured the imagination of home owners and designers around the world and a loyal following has developed. Our French oxidized Oak flooring can be found in Mel Gibson's Malibu home (Coupe Supérieure collection), French oxidized reclaimed flooring has been installed in the 25 million dollar Michael S. Smith designed home of a billionaire hedge fund manager in Beverly Hills (Réclamation collection), and numerous large homes in the famed Yellowstone Club in Big Sky Montana (Cendré collection). Noyer Brulé is also specified in the most luxurious condominium project in San Francisco's history, (the 706 Mission Street Building), and we just received a Noyer Brulé order for the home of the owner of Valor Farms. Valor Farms is best known for breeding and training Kentucky Derby winner Alysheba, the highest earning thoroughbred in history.<br/><br/>We hope that you find Noyer Brulé as captivating a work of art as we did on the first day we perfected the complex formula to make it! It is our most popular style; a timeless, captivating confluence of art and flooring...<br/><br/>Rob Malins<br/>Creative Director<br/>Chateau Napoleon",
"id": "11069",
"product_name": "Noyer Brulé within the Cendré Collection",
"video_url": ""
}