{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11076",
"category": "Product > (NEW) automotive: overall design",
"company_name": "Bentley Motors",
"company_url": "www.BentleyMotors.com",
"description_html": "Designed, engineered and handcrafted in Britain, the new third-generation Bentley Continental GT combines spirited, focused performance with handcrafted luxury and cutting-edge technology, to create the finest Grand Tourer ever produced. The exterior design is based on a bold new vision that is unmistakably Bentley. The all-new body and materials save more than 80 kg over the previous Continental W12 body. To allow for such a bold reimagining, the aluminium skin has been crafted using Super Formed technology – a precision technique working with aluminium heated to 500°C which has previously been used on Bentley fenders. This method allows designers to invoke more complex, sharply defined body lines and a deeper, sculpted haunch muscle. The Continental GT is the first production car ever to have an entire body side made from the Super Formed process. The lighting on the Continental GT uses the latest LED Matrix technology, but it is the design of the head lamps that truly sets them apart. Inspired by the finest cut-crystal glasses, the internal surfaces are transparent with sharply defined edges that catch the light like a diamond. The interior of the new Continental GT showcases Bentley’s unrivalled expertise in the authentic use of materials, from the highest-quality natural leathers, to rare, sustainably sourced veneers – including Koa, Bentley’s newest veneer – and hand-polished chrome details. For the first time, unique dual-veneer options are offered. Over 10 square metres of wood are used in each Continental GT, and it takes nine hours to create and fit the wooden inlays by hand. Another hidden delight is the addition of bronze inserts between surfaces on the primary controls, which adds a level of fine detailing never seen before. The 20-way adjustable seats in the new Continental GT set new industry standards in comfort and refinement. A new, unique quilt is also available: called a ‘diamond in diamond’ quilt, the effect is of a floating quilted surface in a sea of leather, which is extraordinarily soft to touch. The new interior pattern features both stitching and embroidery. The inner diamonds are embroidered, using a specially-designed machine that balances high speed with quality. Eighteen months were spent developing the embroidery, individually optimising and programming the exact alignment of each one of the 712 stitches that make up each diamond shape – an unrivalled attention to detail. A Naim system is built into the front seats and eight sound modes is offered for the true audiophile. Laminated acoustic glass is used for the windscreen and side windows, resulting in a nine-decibel reduction in exterior noise ingress versus the outgoing model. The driver-orientated instrument panel is now fully digital and configurable by the driver. While the main dials appear to be real, they are in fact digital graphics designed to look three-dimensional. The innovative and industry-first Bentley Rotating Display first shows no screen in the centre of the dashboard, instead, the veneer flows uninterrupted across the dashboard, while a thin chrome bezel behind the steering wheel surrounds a digital instrument display.",
"id": "11076",
"product_name": "2019 Bentley Continental GT",
"video_url": "https://www.bentleymedia.com/en/newsitem/784#videos"
}