{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11070",
"category": "Product > accessories",
"company_name": "Genuwine Cellars",
"company_url": "http://www.genuwinecellars.com/",
"description_html": "The RING System represents the zenith of cable-tension wine racking, born from the demand for “free-floating” wine bottle displays. It provides the best solution for near-invisible wine racking to date.<br/><br/>This contemporary wine racking system has clean lines and a minimalist style. It is intelligently attractive while offering a unique display experience.<br/><br/>Aircraft-grade steel cable is affixed floor-to-ceiling, supporting brushed-aluminum rings with embedded rubber bottle holders. When the system is mounted within a glass-enclosed cellar, or as a dividing wall, the effect is stunning. <br/><br/>It is offered as a pre-assembled modular system complete with bottle holders, steel cables and custom floor and ceiling anchors. Bottle spacing and column heights are custom ordered, with options up to 25 feet high.<br/><br/>===============<br/><br/>The RING System is easy to install as it comes pre-assembled and with an anchor template. Previous cable systems on the market are much bulkier and require intensive assembly on site. <br/><br/>The wine racking market has been revolutionized by metal and a demand for contemporary systems. This system filled a gap in stylish, easy to install wine racking to meet these needs. There is nothing else like it on the market. <br/><br/>Bottle columns may be oriented ‘cork-out’ or ‘label out’ depending how the buyer wants to display their collection. Powder coating options are available to match any space aesthetic.<br/><br/>===============<br/><br/>These striking new interior design options make the wine collection center stage, and have become frequently showcased in contemporary show homes – including a Las Vegas show home that utilized a 25’ high version to surround a two-story feature staircase. <br/><br/>Ultimately, a wine collecting journey cannot begin without the perfect storing solution for your collection. You want the freedom to choose the right wine for any occasion and with that comes the right wine storage as well. <br/><br/>The product also meets consumers’ design-driven attitudes, with a different never-before-available wine racking offering.",
"id": "11070",
"product_name": "The RING System",
"video_url": ""
}