{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11081",
"category": "Product > furniture: residential/storage",
"company_name": "Kisabeth Furniture",
"company_url": "www.kisabethfurniture.com",
"description_html": "To maintain the quality of our handcrafted products Kisabeth still relies on the same traditional furniture making techniques we've used since 1958. Not only that, but we constantly reference our product archive dating back to the 1960s. We're as proud of our midcentury roots as we are our commitment to handcrafting furniture, which is why we introduced a collection with modern flair that highlights craftsmanship and our expanded casegood capabilities, and also serves as inspiration for our trade clientele. We wanted it to feel relevant &amp; fresh, hence Cuba. Our 2017 spring/summer capsule collection, La Habana, is comprised of seven pieces: a smoking chair, smoking table, room screen, love seat, bar cabinet, humidor &amp; tufted ottoman. Inspired by Cuba, designed to inspire. <br/>+ Cristobal: smoking chair shown in leather with casters in brass with antiqued finish <br/>+ Gloria: love seat in walnut with contrasting upholstery from Robert Allen<br/>+ Celia: smoking table in African mahogany in natural finish<br/>+ La Palma: room screen in Baltic birch with custom hand-applied finish<br/>+ Desi: bar cabinet featuring a pull-out shelf in veneer with front doors veneered in broken striped sapele &amp; primavera, back, legs &amp; stretcher in African mahogany, maple interior (rendering in PDF does not show final configuration of interior), interior and exterior of cabinet and stretcher feature natural fiber wallcovering from Tri-Kes; doors telescope open<br/>+ Felix: humidor with exterior in burl veneer, top &amp; base are African mahogany, glass panel inset top, interior is Spanish cedar, 23K gold pinstripe, analog hygrometer &amp; electric humidifier<br/>+ Diaz: tufted leather ottoman",
"id": "11081",
"product_name": "La Habana Collection",
"video_url": "https://www.instagram.com/p/BVkxPwHlaSc/?taken-by=kisabethfurniture"
}