{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11094",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "BERNHARDT DESIGN",
"company_url": "Bernhardtdesign.com",
"description_html": "The Creatives Project is the unexpected result of coincidence, luck and great timing. We have the privilege to work with three high-profile individuals simultaneously, who have extremely demanding day jobs, and who were willing to be totally committed to a new design project.<br/><br/>The first time I met Terry Crews we discussed how important it is to support emerging designers and considered how we might partner in the future to help young talent. The more we spoke, I was impressed by his design knowledge and commitment to art and design.  After doing more research on his background, I realized what a keen eye he has for scale and proportion and more importantly how skilled he is at painting and drawing. I went back to him a day later and said if we’re going to do a project together he should channel his passion and be the designer himself – not just a benefactor to someone else. He accepted the proposition and very quickly produced an amazing body of sketches for our first concept meeting. We narrowed it down to three: the Ibis sofa series, a group of tables and benches named Float, and a truly unique seating and table piece titled Lily Pad.<br/><br/>Tift Merritt has never been one to accept the status quo. After receiving a best album Grammy nomination, she moved to Paris to write music with a completely different appeal. She has always been passionate about craft and textiles, ribbon and trim - collecting them from around the world when she is on tour. She started handcrafting bespoke guitar straps for her musician friends, incorporating her assortment of trimmings with leather.  When she showed me some of her recent work, I realized she could design an interesting array of striped textiles based on inspiration from her collection. Fortunately, she agreed and began the design process of determining scale, repeat sizes, and textures. Within two weeks she presented us with over twenty pattern options. We ultimately edited the selection down to six designs in 53 colorways, ranging in scope from woven textural stripes to complimentary solids. Pattern names Cadence, Verse, Reverb, Swing, Forte and Solo are derived from a variety of musical influences.<br/><br/>Joe Gebbia is most commonly recognized as the co-founder of one of the most successful businesses of this century, Airbnb. Even fewer know he is an accomplished designer with degrees in graphic and industrial design from the Rhode Island School of Design. His concept was the essence of simplicity and purity, which is always the fundamental attribute of great design. He based his idea on two simple building blocks that could be used to create an entire community of flexible products. His two basic elements became the Neighborhood Collection, the most comprehensive and flexible line of furniture we have ever introduced. I appreciate the utility of the product and its unassuming form, but for me, the unique zig-zag stitching on each piece makes it incredibly special and elevates the entire offering.”<br/><br/>Jerry Helling",
"id": "11094",
"product_name": "The Creatives",
"video_url": "http://interiordesign.net/videos/13767-the-creatives-go-beyond-with-bernhardt-design/"
}