{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11093",
"category": "Product > kitchen: cabinetry",
"company_name": "Genuwine Cellars",
"company_url": "http://www.genuwinecellars.com/wine-cellars/spiral-wine-cellars/",
"description_html": "Spiral Cellars represent the ultimate wine cellaring experience. Paying homage to Old World wine caves, the subterranean cast-concrete Spiral Cellar is an innovative space-saving showpiece complete with clean lines, state-of-the-art climate control, and stunning glass entry-door options. <br/><br/>Capable of storing up to 1900 bottles under perfect conditions, Spiral Cellars is the epitome of high function meeting intelligent design.<br/><br/>Genuwine Cellars offers Spiral Cellars as a turnkey package for new homes or as part of a renovation project. Our specialized team can complete most installations anywhere in North America in less than five days.<br/><br/>===============<br/><br/>Innovative and Functional – Never before offered in North America! The Spiral Cellar is a game-changer when it comes to wine storage solutions. This innovate, space-saving cellar is perfect for metropolitan areas where a home or retail square footage is limited. This wine cellar expands your useable square footage by being placed in an excavated area below-grade. <br/><br/>Builder/Consumer Friendly – Designers, builders and consumers are excited about this product as it allows a designer an additional “room” for which they would not otherwise be able to accommodate. Not only is the structural glass door stunning as a design feature, but wine lovers are extremely excited to have this showpiece in their home.<br/><br/>Good Design – It is intelligently attractive, while offering a unique cellar experience. Many options available for the wine cellar grade door to delight any home design. Either blend a secret trap door into the flooring, or offer a stunning full glass rectangular or circular option for show piece worthy intention. And finally, mechanically hinging, or retractable options are available to amaze any audience. These striking new interior design options make the wine collection centre stage. <br/><br/>Intelligent Investment – For wine lovers with no more use-able space in their home, this unique style of wine cellar offers in-home wine storage at your fingertips, instead of creating space for refrigeration or inconvenient bonded warehouse space. Not only does it add value to the property, but compared to external warehousing, pays for itself in 10-15 years. -- The added North American active climate control functionality allows the user to age and preserve wines under proper wine storage conditions.",
"id": "11093",
"product_name": "Genuwine Cellars' Spiral Cellar",
"video_url": "https://vimeo.com/117848876"
}