{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11133",
"category": "Product > accessories",
"company_name": "TN/MOS",
"company_url": "http://cargocollective.com/taegnishimoto",
"description_html": "LIQUID is a series of wall mirrors that play with optical textures. <br/>Partially distressed circular mirror is imbedded into the cast concrete disk with pigments that document the flow of concrete while poured into the mold. <br/>The combination of flowing patterns of pigmented concrete and the distressed part of the mirror creates a new layer to the presence of mirror in space as well as to the act of looking into the mirror. <br/>Pre-distressed circular mirror is placed at the bottom of the circular mold in which the concrete is poured. Different consistencies of concrete with different amount of pigments are prepared prior to the pouring. <br/>First the concrete with the most amount of pigment is poured, then gradually the concrete with less pigment and different liquidity is poured in. The concrete with no pigment is the last pour. The release agent is randomly applied to the bottom surface of the mold in order to provide conditions in which the pigmented concrete react to the agent in an unexpected manner. When the concrete is cured and taken off from the mold, the surface is treated with sealer.<br/>The location and the direction of sequential pour of the liquid state of concrete determine the final outcome of the pattern on the surface. <br/>The concrete disks are in different sizes from 35cm to 50cm in diameters, and about 7mm thick. Swivel mechanism is attached in the back, which lifts the disk off from the wall and enables the disk to be rotated to the desired orientation as well as periodical changes of appearance in space.<br/>LIQUID draws our attention to the surface pattern as optical texture as we look closely at the reflection on the mirror, giving a unique visual presence in space. This texture is in fact a visualization of natural phenomena of liquid movement captured in a brief moment (while also evoking the image of the moon in the night sky with moving clouds.)",
"id": "11133",
"product_name": "LIQUID",
"video_url": ""
}