{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11154",
"category": "Product > (NEW) automotive: concept car",
"company_name": "Rolls-Royce Motor Cars North America",
"company_url": "https://www.rolls-roycemotorcars.com/en-GB/103ex.html",
"description_html": "The Rolls-Royce VISION NEXT 100, codenamed 103EX, today made its North American debut at the historic Barker Hangar in Santa Monica, California. 103EX is the marque’s first ever pure ‘Vision Vehicle’ and defines the future of luxury mobility. It presents an intriguing and aesthetically dynamic vision of the future of luxury mobility – a completely personal, effortless and autonomous Rolls-Royce experience, wrapped in a design that ensures a ‘Grand Sanctuary’ for its occupants and a ‘Grand Arrival’. <br/><br/>103EX is one of four visionary creations announced by the BMW Group in Munich on 7 March 2016, as it launched its centenary celebrations. <br/><br/>In addition to being the centenary of the BMW Group, 2016 also represents a seminal moment in the history of Rolls-Royce Motor Cars. For Rolls-Royce, the end of production of the seventh generation Phantom – considered by aficionados to be \"the best car in the world\" – represents the completion of the first phase of the Rolls-Royce brand’s renaissance under BMW Group custodianship. The success of Phantom, Ghost, Wraith and now Dawn serves as the foundation for a bold new chapter. <br/><br/>103EX is the vision of the Rolls-Royce Motor Cars design team, led by Director of Design, Giles Taylor. In the spirit of the great coach-built cars of the past, Rolls Royce will create the chassis of the future, hand-built from the most advanced materials and powered by zero emissions powertrain. <br/><br/>The ‘Voice of Eleanor’ inhabits 103EX, delivering the dream of an effortless future to her owners. Digitally connected to every aspect of her owners’ lives and her surrounding environment, ‘Eleanor’ becomes their virtual assistant and chauffeur, freeing them of all effort and encumbrance. Ever vigilant, ‘Eleanor’ safely delivers her passengers to their destination, having already predicted the situation and surroundings that await them.<br/><br/>As one would expect from a Rolls-Royce, the environment of the Grand Sanctuary is crafted from the most precious and contemporary of materials. What is unexpected is the feeling of lightness and simplicity, an effortless elegance. The centrepiece of the cabin is the beautiful sofa. The best seat in the house, it is an exquisite, futuristic interpretation of modern furniture design. Clothed in the most opulent fabrics, it gives the impression of floating within the cocoon of the cabin thanks to the artful use of lighting and modern materials. <br/>The Grand Arrival<br/><br/>The very size of 103EX announces the importance of its precious cargo. At 5.9 metres long and 1.6 metres high, it mirrors the perfect dimensions of today’s Phantom Extended Wheelbase, whilst the ever constant Spirit of Ecstasy grows in stature, harking back to the regal Phantoms of the 1920s. <br/><br/>“The Grand Arrival gesture of the Rolls-Royce VISION NEXT 100 creates a stage for our important passengers as they arrive at their ultimate destination,” comments Taylor. “It is an expression of our intrinsic understanding of the possibilities for a true luxury brand and the desires of its customers.”",
"id": "11154",
"product_name": "Rolls-Royce 103EX",
"video_url": "https://www.youtube.com/watch?v=dGSm082ELXY"
}