{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11153",
"category": "Product > (NEW) automotive: concept car",
"company_name": "Cadillac",
"company_url": "http://www.cadillac.com/",
"description_html": "Throughout Cadillac’s 100+ year history, the field of automotive design and the role of designer have evolved. Over time, Cadillac’s designers identify and fulfill needs in ways that cultivate an experience that elevates, enriches life and connects on an emotional level. At Cadillac, concept vehicles go beyond vision and a great canvas for showcasing the studio’s forward-reaching thinking, passion and optimism.<br/> <br/>Escala — Spanish for “scale”— is a concept for a larger, more elite and expressive companion to the recently launched 2016 Cadillac CT6, the brand’s new range-topping prestige sedan. Designed by the very same designers, sculptors, studio, and skilled craftspeople working on several upcoming production models, Escala offers a clear view of the future portfolio. Simplicity was paramount and with it, restraint.<br/> <br/>“My brief to the designers was to create a car you desperately want to drive, and one in which you want to be driven,” said Andrew Smith, Cadillac global executive director of design. The central idea of two worlds coming together set the stage.<br/> <br/>Escala features a new and evolved face of Cadillac design that will begin appearing on future production models. This includes a new expression of Cadillac’s vertical lighting, a brand signature since 1948. Thin, OLED lighting elements are set deep within the fascia, creating a sinister look, day and night. Other details inviting discovery include a three-dimensional precision pattern in the grille design and 22-inch wheels with two layers of spokes.<br/> <br/>Escala features a “dual personality” interior crafted with distinctly different zones: The front is focused on modern technology, while the rear delivers relaxation. An array of three, thin, curved OLED screens present the technology for the driver, their back sides wrapped in hand-stitched leather embossed with the Cadillac script.<br/>Escala’s approach to connectivity and control are a prototype for the user experience in development for future Cadillac production models. The system features a central control module enabling tactile commands in addition to voice and gesture control technology. Cadillac’s “flying Goddess” icon nestled in the jewel-like rotary controller is a subtle nod to the brand’s rich heritage.<br/><br/>Transition is a major theme of Escala and the dual personality is also expressed in the pairing of dark and light colors and in material selection. In the interior, the interplay of leather and wood in the front evolves into luxurious fabric and metal in the rear. The wool-blend fabric and precise stitching evoke the feeling of a modern suit. Even the bespoke door décor celebrate the materials with each piece made by hand. It is worth noting everything proposed in the Escala’s color and trim details is within the realm and reach of future production.<br/> <br/>The Escala Concept utilizes Cadillac’s new RWD-centric large luxury car architecture, featuring one of the world’s most advanced body structures, which debuted on the new CT6. The mixed-material construction enables unprecedented agility and efficiency. The new 4.2-liter twin-turbo V-8 engine is a prototype of a new system in development for future Cadillac model.",
"id": "11153",
"product_name": "Escala",
"video_url": "http://media.gm.com/media/us/en/cadillac/bcportal.html/currentVideoId/5087067922001/pnId/0/typeId/c/currentChannelId/Most%20Recent.html"
}