{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11165",
"category": "Product > (NEW) automotive: interiors",
"company_name": "Cadillac",
"company_url": "cadillac.com",
"description_html": "Cadillac Design is about looking forward. All the great Cadillacs of the past – while possessing the DNA of the vehicles before them – were provocative yet timeless. As a studio team, Cadillac designers are evolving the brand signature in a design approach that is progressive, not prescriptive. Concept cars are a great catalyst for this. <br/> <br/>The phrase “simple is hard” carries special relevance within the Cadillac studios and, with the introduction of the Escala concept car, it offers insights about the future of interior design from this distinctly American brand. The Cadillac Escala concept interior is about space, simplicity and sophistication.<br/> <br/>Escala — Spanish for “scale”— is a concept for a larger, more elite and expressive companion to the recently launched 2016 Cadillac CT6 and created by the designers, sculptors, studio, and skilled craftspeople working on upcoming production vehicles. <br/> <br/>Inspired by many of the vintage Cadillacs with a driver’s cockpit in the front and a separate passenger lounge in the rear, Escala’s creative brief was “design a chauffeured-driven vehicle that you would also passionately want to drive yourself.” Hence, the notion of transition was a major theme for the designers. In this car, the front is about technology and performance, and the rear is about relaxation. <br/> <br/>A prominent feature in front is an array of curved OLED screens. Rethinking the traditional automotive cluster and center stack, the screens are wrapped in hand-stitched leather and presented to the driver atop a sculptural wave of genuine American walnut. The curvature, configuration and layering is deliberate and overt to offer a hierarchy of information that enhances the driving experience. In the rear, the technology is on demand or covert, in keeping with its ‘being driven’ environment.<br/> <br/>The Escala’s warm, light interior color represents a bold departure and highlights future interior design in terms of form e.g. economy of line work, sculptural surfaces and jewelry embellishment and the ‘less is more’ approach. Cadillac is very much about the innovative use of authentic materials in unexpected ways to delight the senses and elevate the experience. Fabric, inspired by design partners in the fashion world, replaces traditional leather in many areas. Cut, wrapped and sewn by the in-house tailor using a special titanium needle, designers used it for the same reason that it is a great material for a suit - textural, tailored and luxurious.<br/> <br/>The dual-personality interior is also highlighted by unique door décor – beginning as aluminum in the front then precisely transitioning to wood in the rear. It is a distinctive piece of hand craftsmanship, built in the shops in Michigan. <br/> <br/>Subtle, second-read elements include cut-and-sew and details like the embossed Cadillac script on the Escala’s leather-wrapped OLED screen and Cadillac goddess on the rotary controller. Moreover, everything proposed in the Escala’s color and trim details is within the realm and reach of future Cadillac production models. Every detail was considered. In the rear, Escala’s load floor is choreographed to rise automatically and present the cargo area when the liftback is opened.",
"id": "11165",
"product_name": "Escala",
"video_url": ""
}