{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/11174",
"category": "Product > flooring: carpet/rugs",
"company_name": "Lisa Todd Designs",
"company_url": "www.lisatodddesigns.com",
"description_html": "Lisa Todd Designs is proud to present four colourful works of art with its debut rug collection 'Ndebele'. Lisa's original bold and graphic paintings have been masterfully transformed into 100% wool hand tufted floor coverings with the intention of uplifting the spirit of the home from the inside out. <br/><br/>Lisa's inspiration comes from the distinctive and vibrant style of the South African tribal people, the Ndebele. Expressing the Ndebele culture and charm with her own unique artistry, Lisa has produced a collection of rugs that is both modern and timeless, a welcome addition to the interiors scene for 2017. <br/><br/>Charleston rug £2,375 <br/>2.3m x 1.6m<br/><br/>Zig Zag rug £1,400 <br/>1.8m x 1.2m <br/><br/>Jitterbug rug £785<br/>1.2m Diameter <br/><br/>Polka rug £785<br/>1.2m Diameter   <br/><br/>All 100% wool, designed in the UK by Lisa Todd Designs and expertly made in India.<br/><br/>About Lisa Todd Designs<br/><br/>Established in 2014, Lisa Todd creates beautiful paintings for happy homes, designed especially for those seeking an uplifting interior update. Each design is painted by hand in Windsor before being printed onto natural cottons, linens, velvets, birchwood and ceramics using state-of-the-art technology in the UK. <br/><br/>Lisa started her homeware collection when she had to give up her career as an Interior Designer due to an accident that left her with a seriously debilitating neuromuscular condition called Cervical Dystonia. <br/><br/>With her new disability Lisa revaluated what could physically be done to keep her love for creative design going. Rediscovering her love of painting and having completed an online Textile Design and Surface Pattern Course, Lisa now happily develops her abstract paintings into a range of print textiles, ceramics and kitchen accessories and has lots more planned for the very near future. <br/><br/>www.lisatodddesigns.com",
"id": "11174",
"product_name": "The NDEBELE Rug Collection",
"video_url": ""
}