{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7319",
"category": "Product > furniture: outdoor",
"company_name": "GAN",
"company_url": "www.gan-rugs.com",
"description_html": "GARDEN LAYERS BRINGS THE STYLE AND COMFORT<br/>OF INDOOR SPACES TO THE OUTDOORS<br/>GARDEN LAYERS, GAN’s first Outdoor Space, is an innovative proposal conceived<br/>by designer Patricia Urquiola that brings style and comfort to terraces, pools, beaches<br/>and other outdoor spaces. The end result is an incredible integration of tones,<br/>textures and patterns, traditionally found in indoor products, designed to be used<br/>out in the open.<br/>On sand, or lawns, carpeting over a deck or just bringing an element of comfort to<br/>low benches, GARDEN LAYERS adds an extra touch of well-being and refinement to<br/>life outdoors, inspired by the long eastern tradition of lounging in open air spaces.<br/>The collection can be used for relaxation or sun bathing beside a pool, at the beach<br/>or on any surface near water. Also perfect to use under a shade, GARDEN LAYERS<br/>is a space of relaxation, of conversation in porches or under pergolas, given its<br/>adaptability to warm environments as well as other more moderate climates. It is<br/>made with particularly resistant high-tech fabrics and a quick-dry foam filling, so it<br/>doesn’t require any additional maintenance. <br/>GARDEN LAYERS is based on a modular system that allows users to create infinite<br/>compositions according to the needs and the layout of their spaces. The mattresses,<br/>roll pillows and cushions can be combined and contrasted according to the different<br/>textures and patterns or used on their own as individual pieces.<br/>Patricia Urquiola’s imagination and her masterly creativity is illustrated in these<br/>warm and welcoming spaces. The GARDEN LAYERS collection was recently honored<br/>with a NYCxDESIGN award, in the Outdoor Spaces category.<br/>The collection is available in three color options: Terracotta, Green and Blue.",
"id": "7319",
"product_name": "GARDEN LAYERS",
"video_url": ""
}