{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7385",
"category": "Product > acoustical applications",
"company_name": "Luceplan",
"company_url": "https://www.luceplanusa.com",
"description_html": "In shared spaces – for work, study, dining, leisure – noise pollution caused by unwelcome sounds can have a negative impact on human psychophysical wellbeing. Lighting conditions also influence our mood and health, playing a fundamental role in the creation of a space suited to various needs. To supply proper lighting and greater acoustic control at the same time – for better comprehension of speech and reduction of noise propagation – makes it possible to generate a comfortable environment, contributing to boost wellbeing and productivity.<br/><br/>Diade, the latest Luceplan proposal on the theme of acoustic comfort, part of the established collaboration with Monica Armani, confirms Luceplan’s commitment on the dual front of psychophysical wellbeing and high lighting performance, putting the accent on the changing needs of users. Thanks to technological innovation and research on materials, again in this case Luceplan can guarantee excellent levels of sound-absorbing performance. Created above all for the workplace, Diade offers different dimensions and configurations to adapt to the multiple needs of contemporary interiors configurations of the office as it evolves in time.<br/><br/>A partition, a ceiling, that surprisingly becomes light. Rigor-ous linear design for the new Diade suspension lamp. After the success of Silenzio, Monica Armani continues her research on new technical lighting solutions that o er high levels of sound absorbing performance. A linear LED lamp for the work-place; a modular architectural feature capable of defining space and personalizing the context. The two “wing” panels can be positioned vertically or horizontally to create a partition or a large ceiling element. The two solutions address issues of lighting, sound absorption and the upper facing of spaces in a single strategy, eliminating the need for suspended ceilings. The panels, thermoformed with sound-absorbing wadding, are shaped and marked by lines that have a simultaneously decorative and structural role. The technical LED lighting, ideal for work, is directly downward and upwards by the central line, with the possibility of two beams, depending on lighting requirements.<br/><br/>The fabric of the covering complies with regulations for workspacesand public facilities and it is available in three different colors which generates a particularly refined couture effect . Diade is a technical lamp of great visual impact, with an evocative image, on or off, to add character and warmth to any space in a unique way.",
"id": "7385",
"product_name": "DIADE",
"video_url": ""
}