{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7390",
"category": "Product > lighting: table",
"company_name": "Pablo Designs",
"company_url": "www.pablodesigns.com",
"description_html": "Uninspired by some of the modern open plan workplaces where encouragement of spontaneous interaction often translates into lots of interruptions - hence the quip that 'headphones are the new wall'. - McCoy and Stathis set about designing a new system that brings privacy, and cleverly avoids the use of those high-sided cubicles. The result is Corner Office; a simple solution that helps define personal space and incorporates wellness and visual privacy. <br/>Working closely with the designers, Pablo Pardo from Pablo Designs explains “ Corner Office is a result of a great collaboration between Peter, Michael and myself. Our challenge was to create a new breed of product to respond to the demands of today's new type of productivity, while offering surprise and delight.” The result is a dynamic and flexible system that combines the efficiencies of mass production, the flexibility of custom materials and configurations for expressing personal preferences, and the carbon-reducing sustainability of flat shipping and local assembly for international markets. <br/>The system includes three elements: a glare-free, fully dimmable LED corner task light that incorporates three powerful USB ports featured in its armature (to charge phone and laptop devices); a set of optional acoustic deterrent fabric panels; and an optional pocket accessory that provides a place to rest a phone or tablet keeping the desk clutter-free. Elements are made up of aluminum and recycled fabric, that offer a familiar softness to the touch. The LED light is designed to provide up 50K hours of energy-efficient and maintenance-free illumination and is 97% recyclable. <br/>Corner Office addresses multiple combinations and creative expressions in the office, home and hospitality environments. It is dynamic in visual expression, structural shape and detail and requires no tools to install it. While its overall aesthetic is simple, it reveals subtle intricacy in the places where elements come together. The sculptural origami-like shape of the panels outline a distinctive profile that is identifiable at a distance, while a refined magnetic connectors system provide highly flexible desktop planning for individuals, effortlessly and within minutes.<br/>Lightweight but grounded, the system imparts a sense of personal space in a group environment. “Corner Office comes to life in open plan working spaces,” explains designer Peter Stathis. “The geometry is visually interesting but not overpowering and complements the landscape and surrounding interiors. It provides an ergonomic upgrade to existing tables and desks.” The fully dimmable LED task lamp provides focused and shaped lighting. Aluminum parts contain recycled content and are fully recyclable. “For me, a product needs to offer a solution to a problem while responding to a certain ethos of a time,” Pablo says. “It’s about how it helps us to adapt our tools to the new ways in which we operate . We designed Corner office to respond with emotional intelligence, as well as functional intelligence, to the spaces we inhabit today.",
"id": "7390",
"product_name": "Corner Office",
"video_url": ""
}