{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7397",
"category": "Product > textiles: contract",
"company_name": "Bernhardt Textiles",
"company_url": "www.Bernhardttextiles.com",
"description_html": "The Tift Merritt Collection consists of six textiles inspired by the musician’s passion for visual forms of communication and a desire to incorporate vintage craftsmanship into a modern design vocabulary. The collection features a variety of large-scale stripes and dimensional textures in a full range of vibrant colors and complementary neutrals. The collection provides a wide variety of color, scale, and pattern, while maintaining the durability of contract-grade specifications.<br/><br/>Suitable for multiple end uses, the patterns in the Tift Merritt collection are applicable for a variety of environments including hospitality, educational, institutional, residential, corporate and government. Available in six patterns and 51 colorways. While each is unique stylistically, the collection incorporates a wide range in scope from vibrant stripes to complementary solids, making the collection suitable for a variety of applications. The fabrics in the Tift Merritt collection meet all ACT requirements for contract upholstery – achieving over 64,000 to 100,000+ double rubs on Wyzenbeek abrasion tests qualifying their use in high traffic areas.<br/><br/>Pattern names Cadence, Forte, Reverb, Solo, Swing and Verse are derived from a variety of musical influences. <br/><br/>Cadence<br/>Defined musically as the rhythmic sequencing of sounds, Cadence follows the same description in textile form for this densely woven ombré chenille. Inspired by an antique ribbon from Paris with a variety of ascending and descending stripes, Cadence is available in four multi-colored options.<br/><br/>Forte<br/>The prominent dimensional quality of Forte mimics the structure of grosgrain ribbon. Offered in eight solid textures, Forte is constructed of a unique, multi-color boucle novelty yarn.<br/><br/><br/>Reverb <br/>Reimagining the vibrations of acoustical frequency in the form of a visual color gradient, Reverb reflects the texture and shadowing of layered leather strips. Available in seven colorways, Reverb is woven from an intricate structure of soft denier yarn, accentuated with a defining stitch.<br/><br/>Solo <br/>Colorful enough to stand alone, Solo is a solid texture offered in a wide range of sixteen hues, which complement the overall collection. Constructed of a hefty single-ply acrylic yarn, Solo is a non-directional textile effective for any upholstery application.<br/><br/>Swing<br/>Inspired by the close interaction between musicians, Swing is a bold multi-color stripe with a contrasting underlay of organic texture. Available in ten options ranging from bright to neutral, Swing is woven from an intricate mix of specialty yarns. <br/><br/><br/>Verse<br/>Similar to the words and phrases joined together to develop a verse in poetry or song – a variety of vintage ribbons in multiple sizes, colors and thicknesses were used in the design of Verse. Many different yarn types were woven onto a recycled nylon background to create interesting textures within the stripes of the six colorways.<br/><br/>Unique weave constructions and complex looming techniques use a variety of filaments including; natural fibers, recycled polyesters and man-made synthetics in combination with novelty yarns to create the multi-dimensional textures and patterns in the Tift Merritt Collection. Bernhardt Textiles’ mills comply with relevant environmental legislation, demonstrate a commitment to waste reduction and use quality natural materials.",
"id": "7397",
"product_name": "Tift Merritt Collection",
"video_url": ""
}