{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7442",
"category": "Product > furniture: contract/systems",
"company_name": "Kimball",
"company_url": "www.kimball.com",
"description_html": "While panel systems serve many purposes, Narrate is a design-centric, innovative new product offering that provides customers with a wide range of workplace functionality options, as well as aesthetic choices to address today’s need for flexible and responsive workspaces. Narrate was thoughtfully designed and developed to allow designers to effortlessly create custom work areas and tailor configurations for clients with design in mind.<br/><br/>The Narrate collection inspires designers and end-users to have a completely different visual respect for the panel system. While panel systems serve a variety of functions, and are still very popular in today’s work environments, they are usually very similar in style and offer little in the terms of design appeal. Narrate changes all of that.<br/><br/>Narrate, which epitomizes the future of adaptable design, has a crisp, clean aesthetic and provides designers a flexible open plan furniture offering. With a more relevant approach to the traditional panel system, one of the collection’s key features is the ability to customize end panels. Narrate is designed to be an integral component to the open workstation design layout, using end panels to make a statement, insert a variety of materials, or punctuate specific work zones. Narrate’s end panel system can be outfitted with customized graphics, mixed materials, layered panels, seamed panels and more. The collection also allows designers to incorporate ‘shelters,’ creating visual interest, acoustical separation or to encourage private thinking areas. The Narrate collection integrates other iconic Kimball collections including the Traxx collection.<br/><br/>Additional Key Features of the Narrate Collection:<br/>•\tKimball's Traxx system can be used with Narrate to allow infinite placement of thin horizontal support brackets for off-module placement of furniture, which is extremely important in the open plan. <br/>•\tStackable frames and transition posts allow the panel height to be changed without having to dismantle the system for ease of re-configurability. <br/>•\tOne- and two-high stackable frames can span multiple panels allowing glass tiles to extend over multiple frames, resulting in a new perspective of the traditional panel system.<br/>•\tOption to embed a monitor behind back-painted glass tile for a clean, functional aesthetic.<br/>•\tIncorporate static or height adjustable desks with stationary or mobile storage.<br/>•\tTechnology is conveniently and efficiently integrated throughout the entire collection. <br/>•\tFull tiles to the floor (with electrical capabilities on inside) are also a viable option.<br/><br/>Narrate instinctively combines design, technology and flexibility to support a dynamic workplace environment and let's your brand story unfold visually through the expressive, flexible design system.",
"id": "7442",
"product_name": "Narrate",
"video_url": "https://vimeo.com/230599440"
}