{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7443",
"category": "Product > furniture: residential/dining tables",
"company_name": "Douglas Design Studio",
"company_url": "www.douglasdesignstudio.com",
"description_html": "Overall description <br/>The Aaron dining table is strong, edgy and timeless featuring a solid bronze base with a knife edge top and inlaid bronze detailing. Pure quartzite and architectural bronze with a subtle aluminum substrate are the only materials used.<br/><br/>Design brief <br/>A favorite client was looking for a dining table to replace the one they had since they were first married. They needed something durable and flexible that would allow a few extra chairs to be easily squeezed around for larger family gatherings. They also wanted something edgy; as art collectors and consultants, their home is a mix of elegant and provocative, and this table, needed to strike that balance.<br/><br/>The result is Aaron. Strong, elegant, edgy and timeless, using pure quartzite and architectural bronze with a subtle aluminum substrate as his only materials. His pedestal legs butterfly at a shallow 140-degree angle to triangulate his stance firmly with a minimal footprint and no wobble. A felted-underside of each base protects the wood floors. A hollow 4\" x 1 1/4\" structural centre spine runs the length of the table ending in a 10 degree chamfer which is capped and filled<br/><br/>Each leg is narrowest at knee-height offering maximum squeezing-in space, and lighter weight. The pedestals then flare-out wide at the top to meet the edge of the table at an impossible 10-degree angle; shallow enough to ensure knees don't touch it. The tight angle demands an impressive 10-degree chamfer to the 3/4\" thick top edge of the stone, polished to a paper-thin 3/8\" radius edge. Natural Quartzite is hard enough and stable enough to achieve this fine edge with a 100% pure natural material top.<br/><br/>The legs and top are intimately integrated with the 1/4\" thick bronze leg appearing to slice through the stone edge and completing itself in a V on the surface, flush with the polished stone. The bronze line is inlaid into the continuous stone slab.<br/><br/>Key features<br/>The Aaron dining table was designed with materials that provide a striking contrast each other. The cool rigid grey of the stone is softened by the warm glow of the bronze metal. The inlaid bronze gleams on the surface of the table.<br/><br/>There is a great strength in the materials used for this table. The stone and bronze are extremely durable with a lifespan that allows the table to stay in the family for many generations.<br/><br/>The shape of the table base is practical and convenient as it allows many people to sit around the table with almost no leg interference. The Aaron table is beautiful and practical dining table to gather your family and friends around.<br/><br/>Specialist artisan skills <br/>The quartzite stone selected for the table top is an incredibly hard material. The craftsmen who worked on the stone had to leave the CNC cutter on overnight to cut get through the hard surface. Achieving a 3/8” radius on the stone edge could only have been done using great skill.",
"id": "7443",
"product_name": "Aaron Dining Table",
"video_url": ""
}