{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7444",
"category": "Product > architectural products",
"company_name": "Hunter Douglas Architectural",
"company_url": "http://www.hunterdouglasarchitectural.com",
"description_html": "Hunter Douglas Architectural, a leading manufacturer of ceiling and wall systems, introduces HeartFelt™, a modular felt ceiling and wall system designed to deliver a distinctive appearance and very effective acoustics.<br/><br/>Hunter Douglas works with architects, designers, and contractors to translate aesthetic, functional, and acoustical requirements into constructible systems that express the client’s vision. In keeping with this approach, the company partnered with architect Bjarne Hammer of the renowned Danish practice of Schmidt Hammer Lassen Architects to create Heartfelt. The product subsequently won a Best of the Best award in the category of Product Design from the Red Dot Institute, earning this elite designation out of more than 5,500 entries from 54 countries in 2017.<br/><br/>Patented HeartFelt linear panels, created from felted, thermoformed polyester, can accommodate the design of any interior space to create a new generation of ceilings and walls. The unique texture and soft appearance that have long made felt an intriguing material for furniture, clothing, fashion accessories and interior finishes can also translate directly to the ceiling or wall plane.<br/><br/>“Felt is fantastic to work with if you’re an architect,” said Hammer. “It’s a material that stirs emotion… It’s playful.”<br/><br/>HeartFelt linear panels bring the organic appearance of felt to the ceiling and wall, adding warmth to the visual and acoustical experiences of a space. Designers and architects can use the system to create intriguing aesthetics for both work and play environments.<br/><br/>The panels are available in seven shades of grey (white, off-white, middle grey, dark grey, anthracite, and black) and five earth tones (crème, light brown, middle brown, dark brown, and umber) offering opportunities to create visual gradients and rhythms for ceilings and walls. <br/><br/>The dense, soft structure contributes to sound control and acoustical management to facilitate clear communication. Hunter Douglas designed the patented carrier system to support varying panel spacing, which allows architects and designers to fine-tune acoustics, helping create pleasant and productive work and learning spaces. <br/><br/>The lightweight HeartFelt panels easily clip onto the carriers and can be installed as a wall, a ceiling cloud or as a full ceiling by splicing individual pieces to create continuous lengths.<br/><br/>“Today, delivering high-quality, sustainable products is expected. Offering solutions that differentiate a space based on shape, texture or customization is a growing need among architects and designers,” said Ron Rice, General Manager, Ceilings and Walls, Hunter Douglas Architectural. “This is a capability that Hunter Douglas has proven time and again, and Heartfelt is another innovative way for us to offer ideas and meet these demands.”",
"id": "7444",
"product_name": "HeartFelt™ Ceilings and Walls",
"video_url": "https://vimeo.com/181500130"
}