{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7445",
"category": "Product > window treatments",
"company_name": "Hunter Douglas Architectural",
"company_url": "http://www.hunterdouglasarchitectural.com",
"description_html": "The TZ100 Zipper Tension System from Hunter Douglas Architectural is a new internal and external window covering system that’s ideal for horizontal skylight applications and designed to eliminate light gaps at any angle and in any direction through its Zip Lock Technology.<br/><br/>The TZ100 Zipper Tension System’s Zip Lock Technology is engineered to lock fabric into an extrusion that runs the entire span of the system. By keeping solar control fabric under constant tension in top down, bottom-up, sideways, and skylight applications, the fabric is prevented from blowing out of the guides while remaining taut, providing blackout design and defending against unwanted insects.<br/><br/>“The Zip Lock Technology used in the TZ100 Zipper Tension System keeps both aesthetics and performance in play for projects that are looking for the best of both worlds,” said Nick Inman, Manager of Specialty Projects at Hunter Douglas Architectural Window Coverings. “At the Broad Museum in L.A., we used over 300 systems to cover each of its individual, sloped, external rooflights, which play a big part in the unique lighting atmosphere you find there.”<br/><br/>A great option for new construction or existing windows, the TZ100 Zipper Tension System’s compact design can easily install inside window mount frames and exterior face mount applications with minimal visual impact. The aluminum profiles can be coated in a multitude of colors to match any building. The TZ100 Zipper Tension System can also provide a fully automated, smart solution to solar shading through Radio Frequency (RF) sensors and transmitters compatible with a variety of control systems including commercial BMS, open network platforms, or individual wall switches that work together to control the integrated, quiet motor.<br/><br/>“The TZ100 Zipper Tension System is another example of how Hunter Douglas Architectural approaches the challenges of supplying modern buildings with state-of-the-art solutions for sun control and window coverings,” said Nick Chiaro, General Manager, Hunter Douglas Architectural Window Coverings. “We’re pleased to have had the opportunity to create and develop a custom, highly-coordinated sun control and skylight system for the University of Michigan’s Stephen M. Ross School of Business, and we’re eager to see how it impacts the students and faculty that will frequent the building.”",
"id": "7445",
"product_name": "TZ100 Zipper Tension System",
"video_url": ""
}