{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7484",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "E Ink",
"company_url": "http://www.eink.com/",
"description_html": "Best known for its Electrophoretic Display products that spurred the eReader movement, E Ink is applying its bi-stable ink technology to the architecture &amp; design market with E Ink Prism. Available in seven new hues - Voyage, Daydream, Blush, Sprout, Zest, Harvest and Waltz - the color changing architectural film acts like a dynamic skin for architectural products, changing the color of a wall, ceiling panel or entire room with the flip of a switch. It is also fully programmable, fully reflective, low power, rugged, customizable and made in America.<br/><br/>E Ink is the inventor of several novel types of electrophoretic ink, often called electronic ink. When laminated to a plastic film, and then adhered to electronics, it creates an Electronic Paper Display (EPD). Although futuristic-sounding, electronic ink is actually a straightforward fusion of chemistry, physics and electronics. It's so much like paper, it utilizes the same pigments used in the printing industry today.<br/><br/>The two pigment electronic ink system is made up of millions of tiny microcapsules, each about the diameter of a human hair. Each microcapsule contains positively charged white particles and negatively charged black particles suspended in a clear fluid. When a positive or negative electric field is applied, corresponding particles move to the top of the microcapsule where they become visible to the viewer. This makes the surface appear white or black at that spot. For the E Ink Prism film, various colored pigments are utilized, rather than the standardized black and white.<br/><br/>As a result, E Ink Prism’s bistable ink technology can transform architectural materials into dynamic, one of a kind experiences and designs, and it doesn’t stop at color. Programmable patterns and shapes can be integrated to create designs or function. Doors can indicate if a conference room is occupied, wall designs can respond to noise, temperature, or motion in the room. Whatever the idea, the opportunities are endless and only limited by a designer’s imagination.",
"id": "7484",
"product_name": "E Ink Prism",
"video_url": "https://www.dropbox.com/s/w0se9u8t9hmkro7/BL7J7769.MOV?dl=0"
}