{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7487",
"category": "Product > wall covering: paper",
"company_name": "Aimée Wilder",
"company_url": "www.aimeewilder.com",
"description_html": "The Phantasmagoria Collection by Aimée Wilder brings the dream world to life in a melding of galactic visions, jungle adventures, and desert wanderings. To create Phantasmagoria, a collection of wallpaper &amp; fabric, rugs &amp; bespoke carpets, and pillows &amp; poufs, Wilder experimented with elements of light and shadow, pushing the limits of repeat size and density of detail. In Phantasmagoria, one is easily lost in the fantastical, oversized repeats featuring flora and fauna, both real and imagined.<br/><br/>Wilder shares, “The Phantasmagoria Collection reflects the evolution of our brand, as<br/>the most visually multi-layered collection in our offering. It is also our biggest foray into<br/>rugs and bespoke carpets to date.”<br/><br/>In the recurring dream which inspired collection, Aimée goes on a psychedelic<br/>adventure through time and space. Aimée finds herself floating through an unknown<br/>galaxy. The stars, asteroids, and comets begin to morph into a churning sea of<br/>cheetah spots. Friendly cheetah faces appear but quickly turn ferocious jumping out<br/>of space to chase her through a sleepy jungle. She tumbles through sparkling puddles,<br/>past lumbering sloths and playful primates, soon realizing she has lost the pursuing<br/>wildcats. Her journey continues as the jungle melts into an arid desert. Cacti the size of<br/>skyscrapers tower over her and the sun emerges high overhead. She basks in its<br/>warmth, exhausted from her surreal voyage.<br/><br/>The four patterns for wallpaper are :<br/><br/>Cactus Spirit : a dimensional and layered desert setting, Cactus Spirit brings home a taste of the southwest.<br/>Colors: Sage, Cloak, Contrast, Desert, Kelly, Mist, Peri, Splendid, Tequila, Flesh.<br/>Repeat: 54 inches (137.2 cm) wide x 36 inches (91.4 cm) high<br/><br/>Cheetah Vision : This playful, swirling cheetah-print features an unexpected cheetah face peering back at you.<br/>Colors: Nocturnal, Grassland, Candy, Comet, Oasis, Daydream, Aventura, Safari, Haze.<br/>Repeat: 54 inches (137.2 cm) wide x 36 inches (91.4 cm) high<br/><br/>Cosmic Splash : Awash with movement and energy, this textural pattern conjures the cosmos in motion, yet can be as subtle or bold as desired.<br/>Colors: Luna, Pearl, Abyss, Obsidian, Lazurite, Lapis, Aura, Galaxy, Rose Quartz.<br/>Repeat: 54 inches (137.2 cm) wide x 36 inches (91.4 cm) high<br/><br/>Jungle Dream : An oversized nocturnal jungle-scape adventure featuring jungle creatures, and flora and fauna.<br/>Colors: Monteverde, Emerald, Lily, Newsprint, Parchment, Mediterranean, Zest, Orinoco, Sphinx, Charcoal, Stardust, Contrast.<br/>Repeat: 54 inches (137.2 cm) wide x 44 inches (111.8 cm) high",
"id": "7487",
"product_name": "Phantasmagoria",
"video_url": ""
}