{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7488",
"category": "Product > wall covering: contract",
"company_name": "Wolf-Gordon",
"company_url": "www.wolf-gordon.com",
"description_html": "New Mexico is known for its dramatic, wild and distressed beauty; Wolf-Gordon’s new Origins Woods collection, developed in collaboration with the Museum of New Mexico, attempts to capture the allure of the region by focusing on weathered wood structures. Consisting of four digital wallcoverings, Origins Woods is printed on earth-friendly and breathable Terralon, and will join the company’s Curated Collection.<br/><br/>The patterns in Origins Woods are photographically realistic, inspired by the barns, fences, and homes that are built of the material for siding, paneling and flooring. The wood is presented in different configurations as lengthwise cuts and cross sections. As these digital prints attest, wood is a canvas for diverse patinas and textures when exposed to the elements; its textural complexity makes it a sophisticated complement to a variety of interiors.<br/><br/>\"Wolf-Gordon Design Studio had the privilege of exploring the New Mexico landscape with the Museum of New Mexico staff to draw inspiration for this collection. Wood was a large part of that experience; and its unique, rich appearance contributes to our initiative to offer interesting textural elements in the Curated Collection.\" – Michael Loughlin, Wolf-Gordon, Customs &amp; Digital Director.<br/><br/>Catalpa, Pawpaw, Tamarack, and Tupelo add a warm, authentic touch to any space, whether positioned behind a headboard or a reception desk, or in a customer waiting area or retail environment. Each of the four patterns is available in three standard color options and can be printed in a custom hue upon request.<br/><br/>\"Wolf-Gordon’s Origin Woods focuses on a material that makes New Mexico’s built environment compelling. We are excited to have provided the adventure that inspired this collection and are proud of the fresh perspective it offers on our distinct surroundings.\" – Pamela Kelly, MoNM Foundation, VP of Licensing &amp; Brand.<br/><br/><br/>Patterns:<br/>Catalpa: Hand-sawn wood planks are arranged in a brick pattern for a cozy, geometric effect.<br/><br/>Pawpaw: Named for a fruit-bearing tree long popular among Native Americans, this checkered pattern is made of end grain blocks.<br/><br/>Tamarack: Vertical panels of reclaimed wood with characteristic grooves, flecks, and gouges provide an authentic look.<br/><br/>Tupelo: A farmhouse appeal is captured in this pattern’s horizontal planks of weathered wood. Tupelo is offered with natural coloring, a bleached wood effect, or stained with a deep espresso tone.",
"id": "7488",
"product_name": "Origins Woods",
"video_url": ""
}