{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7523",
"category": "Product > furniture: contract/case goods",
"company_name": "Davis Furniture",
"company_url": "www.davisfurniture.com",
"description_html": "Hue is an elegant line of cases with an architectural design, intended to become one with its surroundings. The large offering includes lowboards, sideboards, highboards, and wardrobes with a variety of options. Hue provides a simple and clean solution for space separation and storage needs throughout contract environments.<br/>Designed around the idea of fulfilling a basic need, Hue is offered in a large range of sizes to fit in any area. Essential to this classic piece is the ability to fit, not only the functional need, but the aesthetic of any space. Davis is introducing 26 new paint colors for Hue, a veritable rainbow of options to match any interior. Hue will also be offered in wood veneer finishes for a more natural look. Hue’s wood veneers are finished to match Davis’ standard line, pairing seamlessly with any Davis table, chair, or auxiliary piece.<br/>More than just storage units, Hue can be used in a multitude of formats for open space planning, conference room storage, or as case good supplements. With the popularity of open space floor plans in the modern office, it is essential to create working areas that are adaptable to the needs of the people. Hue is a great tool for creating spaces that work within the context of the larger design. Units offers a 360 degree finish option for open applications. <br/>Hue’s universal design language allows it to take on the architectural aesthetic of its environment. Hue is available in cases with two, three, four, or five door widths. Other options include four case heights<br/>– lowboards, sideboards, highboards, and wardrobes. The “low” and “side” height cases also offer a slideboard option with two sliding doors.",
"id": "7523",
"product_name": "Hue",
"video_url": ""
}