{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7524",
"category": "Product > bath: fittings",
"company_name": "GROHE",
"company_url": "www.grohe.us",
"description_html": "The intuitive push-button technology of the GROHE Rainshower SmartControl shower system brings a new level of customization to the shower experience. The textured, double button design allows the user to easily control and set all desired shower settings ̶ including water outlet, volume, and temperature ̶ even with wet hands. The controls are marked with symbols for simple, intuitive operation, making this contemporary shower system easy for the entire family, including children, to use.<br/><br/>The exclusive package of benefits offered by the GROHE Rainshower SmartControl shower system harnesses innovative technologies and functional design to enhance the pleasure of the user from the moment they enter the shower. The experience begins when the user pushes the on/off button to start the flow of water and turns to adjust the volume gradually, ranging from the water-saving EcoJoy flow to the luxurious Full Flow. The user’s preferred volume setting is stored automatically. A second push on the button will pause or stop the shower. SmartControl also allows the user to select spray patterns and switch the flow of water between the rainshower head and the convenient hand shower.<br/><br/>The SmartControl system is equipped with brand-exclusive TurboStat technology, a thermostat that delivers the preferred water temperature to the user within a fraction of a second and keeps the temperature consistent for the duration of the shower. A SafeStop button prevents the user from inadvertently raising the water temperature to more than 100 degrees Fahrenheit, while the innovative CoolTouch technology removes the risk of scalding by preventing exposed metal surfaces from heating up.<br/><br/>The sleek, organic curves of the SmartControl were inspired by the natural world, and are intended to caress and relax the senses. This stylish fixture features the GROHE StarLight Chrome finish, produced through a unique plating process that results in a robust and immaculate surface that is ten times more scratch-resistant than standard finishes, making its glistening appearance last for a lifetime. <br/><br/>For the user’s convenience, the top of the control unit serves as a shelf for shampoo, shower gel and other body care products, packaging user-friendly performance into an intriguingly futuristic design.<br/><br/>Intended to perfectly complement the trend toward contemporary design in today’s luxury bathrooms, this innovative shower control harnesses innovative, push-turn functionality to enhance and simplify the shower experience in a stylish way.",
"id": "7524",
"product_name": "SmartControl Shower System",
"video_url": "https://www.youtube.com/watch?v=cGAzloTGuJU"
}