{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7528",
"category": "Product > furniture: contract/partitions and wall systems",
"company_name": "Tuohy Furniture Corporation",
"company_url": "www.tuohyfurniture.com",
"description_html": "Andavi is a matrix wall of modular storage components that defines spaces for open plan and private areas. It discretely uses an adjustable post and cabinet format to control the relative degree of privacy or openness desired while offering ergonomic, acoustical, power/data, and materiality benefits. It serves office design, storage, space divider, collaborative exchange and backdrop, all within a population of interchangeable components.<br/><br/>Today’s workplace design struggles with the balance between open plan and private spaces. While open layout is desired for reasons such as sharing lights, promoting collaboration, and flexible growth within the given space, it also adds to rising concerns about noise control, proper storage and ability to focus at work. Andavi addresses these concerns by providing versatile and modular storage solutions that double as space dividers. It integrates power solutions, lighting solutions, acoustical values with soft materials for certain zones, and collaboration possibilities with technology capability.<br/><br/>Andavi offers a broad working solution. It provides task areas, versatile storage elements, power solutions, lighting as desired, acoustical value with soft materials for certain zones, and collaboration possibilities with a technology capability, all while acting as a “wall” or “visual divider” of a space without building walls.<br/><br/>The versatility of Andavi provides the usefulness in interior layout. While providing a clean “wall” or “visual divider” options enhance the functionality of the offering. From sound masking, to storage to lighting to technology integration the options specified give the system its functionality. You will be able to enhance the environment of space requirements simply and consistently.<br/><br/>Andavi is extremely flexible. It divides areas while being furniture, which eliminates a separate sprinkler work or ductwork that serve just that area. It can share light and air in an open plan while providing divided zones for private desks, meetings, lounges. It can be dressed up to be in a public space with display and can be dressed down to be in a breakout area. It can be moved as the corporate grows or shrinks in its size as well as the function of the area changes over time. Andavi’s support system allows for full adjustability on irregular surfaces with independent leveling capability while incorporating the use of multiple materials.<br/><br/>Andavi is unique for the current workplace. It is clean, timeless and sculptural. It has industrial beauty in its metal posts but maintains elegance and function. The finish options are nearly infinite, enabling Andavi to fit just about any environment. While today’s workplace needs to offer an open, relaxed feeling it also needs to enhance workspace productivity and compliment the entire office landscape.",
"id": "7528",
"product_name": "Andavi",
"video_url": "http://www.tuohyfurniture.com/1/an/TUOHY_Andavi.mp4"
}