{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7529",
"category": "Product > bath: cabinetry",
"company_name": "Kallista",
"company_url": "www.kallista.com",
"description_html": "KALLISTA has once again collaborated with internationally renowned designer Laura Kirar with a new bath vanity, mirror and sconces that marries the beauty of natural elements with the balanced pureness of line and symmetry. Her latest endeavor underscores her love of natural materials and how she incorporates this passion into her design aesthetic. It is also stands testament to how her KALLISTA designs complement her earlier collections for a remarkable range of choices from this designer. <br/><br/>Explained Kirar, “I sought simplicity in materials and to highlight the purity of form. The vanity focuses on the texture of the wood grain, simple book-matching and an interior design, flexible geometry. The mirror needed to be only about glass, reflection and light – so the shape is simple but the faceting unique, reflecting the environment in interesting ways. The materials and form of the lighting is all about softness and even illumination with a little decorative jewelry that matches the Pinna Paletta and Paletta Pure fixtures.” <br/>The new vanity reflects Laura’s ability to mix mediums for a look that is decidedly fresh and of the moment. “I think the contrast for me is registered as a sensory experience,” Kirar explains. “It's an inviting mix of stone: smooth, soft, and cool to the touch, with the textural warmth of wood.”<br/><br/>The vanity is available with either Calacatta Borghini marble top rich with grey veining or Nero Marquina marble with its stark white veining. The vanity cabinetry is available in a golden Cerused Oak or in glossy White Lacquer. “I've always found an attraction to white oak for its strong yet soft textural quality,” said Kirar. “With the addition of a coursed finish, it has greater interest and depth.”<br/><br/>The cabinet is fitted with two pull-out, slow close drawers that discreetly open from the side and offer ample storage for life’s incidentals. The cabinet is raised on two smooth, straight solid cast brass legs that can be customized in a jewelry cut foot to match Kirar’s Pinna Paletta or Vir Stil collections and available in Antique American Bronze, Unlacquered Brass, Nickel Silver, Antique Nickel Silver and Polished Chrome KALLISTA living finishes. <br/><br/>The quiet sophistication of Kirar’s product designs are also reflected in her new KALLISTA mirror and sconce. Compatible with LED lights, the distinctive, 30-inch-high mirror combines crystal clear glass with a cool metal frame. The frame has canted corners breaking the smooth sides in chic contrast and surrounds a beveled mirror that stands slightly proud from the mirror frame. The cylinder-shaped glass sconces can be configured either flanking a mirror, or in singular fashion residing above the mirror allowing the light to cascade down its length. The shade is supported by twin solid cast brass supports that can be customized with jewelry cut medallions to match the Pinna Paletta or Vir Stil collections and offered in customer’s choice of Antique American Bronze, Unlacquered Brass, Nickel Silver, Antique Nickel Silver and Polished Chrome KALLISTA living finishes.",
"id": "7529",
"product_name": "36\" Vanity",
"video_url": ""
}