{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7539",
"category": "Product > seating: contract/conference",
"company_name": "Stylex",
"company_url": "stylexseating.com",
"description_html": "F4 represents an evolution in user-responsive seating. Through thoughtful material selection and component design, F4 was created to comfortably and effortlessly move with its user and support a broad range of seated gestures without the need to make excessive manual adjustments. F4 features a reactive seat support system that both enhances comfort and reduces user fatigue as well as an integrated tilt mechanism that moves in harmony with the body’s natural axis of hip rotation. These, combined with its many other functional features, result in remarkably comfortable movement and superb gestural support. <br/><br/>F4 celebrates the importance of both the user experience and its relationship to the built environment. F4 provides a unique torsion-spring mechanism that is totally concealed within its frame. The geometry of the chair, in combination with the springs, provides comfortable support for a broad range of users without adjustment. Pneumatic height adjustment is standard. Standard arm caps feature soft touch polyurethane to protect desks and conference tables. Both hard and soft wheel casters are available to suit the needs of a wide range of flooring materials.<br/><br/>In addition to its functional agility, F4 offers a graceful, lightweight appearance and timeless styling that support a spectrum of environments.<br/><br/>Backs may be mesh or upholstered in one of three different styles. Knit seats are an option to match the full range of mesh colors. Frames are available in either polished aluminum or one of 20 powder coat finishes.<br/><br/>Sustainable design features:<br/>- Greenguard IAQ Certified<br/>- Recycled content aluminum base, frame, and arms<br/>- VOC-free powder coat finish<br/>- Water-based adhesives",
"id": "7539",
"product_name": "F4",
"video_url": ""
}