{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7550",
"category": "Product > seating: contract/sofa",
"company_name": "Bernhardt Design",
"company_url": "bernhardtdesign.com",
"description_html": "Terry Crews states, \"The Ibis sofa is my vision of a modern design that would reside comfortably in an ancient Egyptian palace. The outstretched wings of the Sacred Ibis are a consistent feature in the hieroglyphics and is a mainstay around the Nile River. The back of the sofa resembles the extended wings of this bird in flight. I also wanted those who sit on the sofa to have the subconscious sensation of feeling protected – like a bird protecting its young.\"<br/><br/><br/>The sofa features two sizes, and a flat back enabling it to go flush against a wall without sacrificing design. Ibis meets the universal need in public spaces and private residences for lounge furniture. Ibis may be upholstered in a variety of fabrics or leathers from Bernhardt Textiles or COM.<br/><br/>Comfortable and generous in size, Ibis adapts to a variety of environments ranging from collaborative to the more traditional workplace to the interiors of a home. Ibis is as substantial as it is versatile with a frame crafted from steel tubing. Ibis passes all BIFMA testing for contract furniture.<br/><br/><br/>Ibis comes in two versions, the Grand Ibis measuring 114” wide and the Standard Ibis which is 96” wide. Both versions are available in polished stainless steel or matte black and can be used with Bernhardt Textiles leather or fabric, as well as the customer’s own material.<br/><br/><br/>The Ibis sofa is Crew's vision of a modern design that would reside comfortably in an ancient Egyptian palace. The outstretched wings of the Sacred Ibis are a consistent feature in the hieroglyphics and is a mainstay around the Nile River. The back of the sofa resembles the extended wings of this bird in flight. I also wanted those who sit on the sofa to have the subconscious sensation of feeling protected – like a bird protecting its young.<br/><br/><br/>Ibis pieces are GREENGUARD certified. Bernhardt Design and Bernhardt Textiles is an EPA Climate Leading Partner, and facilities are certified and level audited. Made in the USA.",
"id": "7550",
"product_name": "Ibis Sofa",
"video_url": ""
}