{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7580",
"category": "Product > technology",
"company_name": "Byrne",
"company_url": "http://byrnewerks.com/",
"description_html": "Where do you want to go today? The personalized power of Vesta is ready to take you there, with pleasing, modern style, customizable charging options and a generous collection of materials and finishes to truly make it your own.<br/> <br/>Lightweight and easy to move, Vesta is also built to support the depth and breadth of today’s technology demands. For tasks that requires robust charging options, our corded Vesta delivers an array of power, USB-A and new USB-C—all at table height, just where you need it. Vesta stands ready to charge laptops, tablets, smartphones and more—all at the same time.<br/> <br/>With this much power and data muscle, Vesta is a true team player and loves to collaborate—making it perfectly suited to support multiple users and an easy way to transform any space into a collaborative one.<br/> <br/>For those who prefer life untethered, Vesta also offers a cordless, battery-powered option that can literally go anywhere—from conference table to picnic table, inside or out.<br/> <br/>But power is only part of what makes Vesta so special. Design is far from an afterthought here, with an expansive array of stylish finish options. From rich wood veneers to inviting leather and felt materials, Vesta becomes a reflection of your own aesthetic—with a palette that’s happy to blend in or stand out. Our distinctive braided cord design is also available in a range of complementary solids and vintage-inspired patterns. Charged with personality, this is one cord you won’t want to hide away.<br/> <br/>Mindfully designed with beautiful detailing from top to bottom, this clean, modern solution is poised to power any space in accommodating style.<br/> <br/>And if you ever need a little help when it comes to power and design selections, Byrne makes it easy with its custom online design tool.<br/> <br/>Vesta makes power personal with vibrant colors, sophisticated materials and charging options tailored to your needs. Vesta also keeps it collaborative, providing the user-centered support you need to come together and really connect—wherever the day takes you.",
"id": "7580",
"product_name": "Vesta",
"video_url": ""
}