{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7603",
"category": "Product > textiles: hospitality",
"company_name": "Arc|Com",
"company_url": "www.arc-com.com",
"description_html": "The Arc-Com Design Studio proudly introduces its new Tintura Collection. A coordinated group of three, patterns Raya, Elevado, and Linea find their inspiration in the ancient art of Guatemalan backstrap weaving and dyeing. <br/><br/>Backstrap weaving has been practiced in many different parts of the world for centuries. Today, it is still used in many parts of Guatemala by Mayan women who use the technique to weave fabric for clothing, shawls, tablecloths, towels, and more.<br/><br/>Backstrap weaving is traditionally prepared on a simple loom comprised of six to seven rods. These looms are usually made by the weavers and the width of the fabric is determined by the width of the rod. The warp threads are strung onto a back rod which is then tied to a tree or a post. The other end of the loom has a strap that encircles the weaver’s waist. The proper tension of the loom is created by the positioning of the weaver’s body. Typically the backstrap weaver sits on the ground and moves forward or backward to produce the necessary tension. The process is quite physical and the blouses or “huipils” created by the Mayan women are considered very special because their bodies are intimately engaged in every movement of their creation. The backstrap loom is mobile and is simply untied and rolled up whenever the weaver has finished. <br/><br/>Historically, Guatemalan women wove with cotton yarns that were hand dyed with natural plant dyes. They would use plants, fruits, insects, and vegetables such as hibiscus flowers, carrots, coconut shells, avocado tree bark, and achiote, to produce beautiful brightly colored fibers for weaving. The literal translation for the Spanish word tintura is dyeing, and the gloriously rich and vibrant color palette for the Tintura Collection was inspired by these ancient dyeing methods. <br/><br/><br/>Arc-Com’s Tintura Collection is an in depth study of weave, color, and fiber inspired by Guatemalan textiles and the processes used to create them. Although this collection is commercially woven of 100% polyester and dyed to adhere to current contract performance standards, the Arc-Com Design Team sought to source yarns, explore modern weaving techniques, and discover colors that would capture the beauty and aesthetic of these time honored backstrap weaving and hand dyeing techniques. <br/><br/>Pattern Raya (Spanish for stripe) offers a chunky, large scale, multicolored stripe with a hand-woven appeal. Stocked in 13 colors, Raya is the patterned item in the collection.<br/><br/>Pattern Linea (Spanish for line) provides a small scale, linear, textured coordinate to pattern Raya but can be used as a standalone textile with tremendous surface interest. Linea comes in 13 colorways.<br/><br/>Pattern Elevado (Spanish for raised) offers a dynamic, raised surface, coordinated plain. Elevado comes in 20 vibrant, solid colorways.<br/><br/>All three patterns in the Tintura Collection have been tested to 100,000 double rubs and are stocked with a stain resistant and backing.",
"id": "7603",
"product_name": "Tintura Collection",
"video_url": "https://vimeo.com/226803042"
}