{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7616",
"category": "Product > kitchen: appliances",
"company_name": "Vinotemp",
"company_url": "https://www.vinotemp.com",
"description_html": "Designed to add a new level of wine storage functionality and style to nearly any kitchen design, the Vinotemp Private Reserve Series 300-Bottle Wine Cooler is the first of its kind to feature patent pending interior lighting (including three different LED options – Soft White, Amber and Vinotemp BioBlu™) and patent pending stainless steel gliding wine racks that cradle bottles so the labels of the wine stored are front facing, adding to the cooler’s unique visual appeal. Front vented and designed for built-in or freestanding installation, the new cooler is easy to install, making it simple for designers to add proper storage for up to 25 cases of wine to nearly any kitchen design. The cooler also features vibration-damping design to better protect contents, is engineered for low energy consumption and low noise, all while a 23-degree temperature range (41-64°F) allows users to select a proper, customized storage and serving temperature for light or dark wines. <br/><br/>“For over 30 years Vinotemp has been dedicated to providing the world’s top restaurants and resorts with wine storage solutions that not only properly store the commodity, but also add to the design aesthetic of each location’s environment. This continued dedication to style and function inspired our team to create the new Private Reserve Series 300-Bottle Commercial Wine Cooler. And, the cooler’s unique interior lighting options along with its inventive new racking quickly became sought after in the commercial industry. As a result, we began receiving requests for a residential version of the product. So we created one and we’re thrilled to launch it at KBIS 2018.” - India Hynes, Vinotemp CEO",
"id": "7616",
"product_name": "Vinotemp Private Reserve Series 300-Bottle Wine Cooler",
"video_url": ""
}