{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7617",
"category": "Product > seating: contract/guest",
"company_name": "Tonon for Sandler Seating",
"company_url": "www.sandlerseating.com",
"description_html": "Award-winning German designer, Martin Ballendat, has released his newest and boldest creation yet, Marshmallow by TONON. Marshmallow has been met with a positive reception since its release, receiving awards from 'Best of BDwest' and 'The IIDA/HD Product Design Competition.' <br/><br/>Martin is known for his ability to combine fluid curves with clean angles, and this piece is no exception. <br/>Molded ergonomically, the “Soft Touch” polyurethane foam shell offers an extremely soft yet supportive cradle, while it maintains durability for years of commercial use. \"My aim was to create a soft and flexible chair by using special polyurethane, with the association of Marshmallow sweets\" states Ballendat.<br/>As well as being extremely resistant and waterproof, the Soft Touch material is crucially non-toxic and 100% hygienic. The strength and comfort of its design underpins this side chair, while the expertise of our Italian artisans bring it to life. <br/>Marshmallow comes with four legs or sled base, in polished or painted steel, or in sustainably sourced solid Oak and Black Walnut legs to juxtapose the soft curvature of the seat. It is additionally available in 14 standard colors or custom colors, subject to minimum quantities.<br/><br/>Marshmallow 919.01: Polyurethane side chair on four legged steel base<br/>Marshmallow 919.10: Polyurethane side chair on four legged steel base with optional 180/360 degree swivel<br/>Marshmallow 919.11: Polyurethane side chair on rounded wooden legs with optional 180/360 degree swivel<br/>Marshmallow 919.91: Polyurethane side chair on lacquered steel sled base<br/>Marshmallow 919.L1: Polyurethane side chair on rounded wooden legs<br/><br/>Dimensions for all products: 32.3” (h) x 22.8” (w) x 23.6” (d)",
"id": "7617",
"product_name": "Marshmallow",
"video_url": ""
}