{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7649",
"category": "Product > bath: fixtures",
"company_name": "Valley Acrylic Bath Ltd.",
"company_url": "www.valleyacrylic.com",
"description_html": "Onyx is the next step in luxurious bath experiences; featuring stunning, diamond faceted edges which taper this geometric bath to fit the curve of your body with a multi-faceted design reclined back slope and a fully integrated pop-up drain style that creates a seamless, smooth surface across the entire bathing well for maximum comfort. Onyx is designed and hand-crafted in North America to be a functional art-piece; with a form as striking as how it feels to use. With an extra-wide Roman-style faucet deck space and access to a wide range of faucetry, we are confident that we can provide whatever you need to create the bathing experience you’ve always dreamt of. <br/><br/>Onyx is hand-crafted to a diamond edge by the talented craftsmen at Valley Acrylic to create perfect geometric lines that support the bather’s body in a cushioning reclined bathing position that conforms to the ideal body position for total body relaxation. With our new pop-up drain, Onyx features a completely smooth bathing well; allowing the bather to stretch out and relax however they enjoy sinking into a luxurious bath. Our talented in-house design team has perfectly married a large well space to a beautiful, streamlined design that incorporates not only an extra-wide deck mount faucet space, but also offers the addition of a detachable end-piece storage unit that puts all of the accessories needed to create a uniquely personal bathing experience within arm’s reach. <br/><br/>The technological marvel that creates Valley Acrylic performance is our special mold-poured Shila Stone material. Shila stone is the revolutionary durable material created by Valley Acrylic; designed with the environment in mind. Shila stone is our solution to creating luxury bath products locally that can live up to the highest quality standards expected by North American bath products. Shila stone products are perfect for the home, as well as high traffic areas such as hotels &amp; high-rises due to its enhanced durability over standard acrylic products in addition to its longevity, and ease of maintenance. Shila stone is a part of Valley Acrylic’s zero-waste sustainability program which converts hundreds of pounds of acrylic waste into a new ultra-hygienic, non-porous material that conserves the energy and water originally expended in creating the materials; thereby preventing resource waste throughout the production process and minimizing the waste that goes into landfills around the world. <br/><br/>Onyx will take you to total relaxation. Our team of designers and artisans have crafted Onyx’ stunning diamond facets to be the cutting edge of the modern ergonomic, luxury bathing experience. As beautiful to look as, as it is enjoyable to use, Onyx perfectly marries form and function in a way that allows you to sink into a dream bathing experience with a reclined back rest that perfectly conforms to your body’s natural curve; letting you sink into the total comfort you deserve.",
"id": "7649",
"product_name": "Onyx - Canada150 Collection",
"video_url": "https://www.youtube.com/watch?v=55SqiROjpJA"
}