{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7652",
"category": "Product > flooring: hard",
"company_name": "Patcraft",
"company_url": "http://www.patcraft.com",
"description_html": "Subtractive Layers uses foundational methods of art to explore new ground. Inspired by a subtractive process that adds dimension by removing material, the LVT collection includes two 12” x 24’’ tiles, Remove and Withdraw, and is available in 20 colors between the two patterns.<br/><br/>Kelly Stewart, Patcraft’s Hard Surface Designer, worked from her original acrylic paintings inspired by artists Harry Morgan and Pierre Soulages, as inspiration for the collection’s unique and beautiful design. Using a broken comb to achieve a linear texture, Stewart’s artwork reflected depth, shadow and highlights, all of which became an integral part of the Remove and Withdraw style and pattern. Both tiles within the collection were made by manipulating scans of Stewart’s original paintings and layering them over one another, giving life to a layered, modern texture.<br/><br/>Subtractive Layers is a dry back product that provides a unique and dynamic aesthetic that is suitable for a broad range of applications across all markets. Both styles are 5 mm, eliminating the need for a transition strip when installing with carpet. Products can be mixed for smooth transitions between spaces and have been designed to complement Patcraft carpet, achieving further flexibility when paired with other offerings. <br/><br/>This resilient tile flooring is engineered for performance, and is well suited for heavy commercial installations. Polish-optional, Subtractive Layers is a durable product that makes maintenance easy and inexpensive, eliminating cleaning chemicals in the breathing zone while helping to improve indoor air quality. Designed to withstand physical demands, Subtractive Layers products are backed with a 10-year warranty and feature a 20-mil wear layer to enhance product durability and performance in high-demand environments. <br/><br/>Subtractive Layers’ tiles showcase both a simpler and then more complex design that stand alone beautifully or can be coordinated together. With every subtraction, texture is multiplied, color magnified, and composition unified.",
"id": "7652",
"product_name": "Subtractive Layers",
"video_url": "http://neocon-dev.patcraft.com/wp-content/uploads/2017/06/Subtractive-Layers-no-titles-20mbps.mp4"
}