{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7653",
"category": "Product > bath: fixtures",
"company_name": "Valley Acrylic Bath Ltd.",
"company_url": "www.valleyacrylic.com",
"description_html": "The illuminated Cube and Luxe custom-sized basins are handcrafted &amp; kiln-formed Aura stone products, made in North America and to your desired specifications. These basins, like our full illumination collection are closely and carefully created under the supervision of our talented team of artisans ensuring a high level of quality, and functionality that exemplify the Valley Acrylic brand. <br/><br/>The illuminated basins come in both the Cube vessel and Luxe under-mounted configurations and serve as ideal entertainment sinks for any home bar application with soft, icy illumination in over 15 remote controlled colour combinations with an integrated, energy efficient LED array. <br/><br/>Fill them up with ice to chill champagne for guests, or create dazzling cocktails for your friends with your very own sushi or salsa bar! These ultra-hygienic basins will set the mood in any home, restaurant, or hotel application with their modern streamlined counter top look; while being the perfect option to serve as your chilling area, drink prep work space, and any other function you can imagine.<br/><br/>Our illuminated basins utilize an innovative new method of kiln-shaping by hand from one of our talented craftsmen. We guarantee quality and precision of your product because this method allows us to monitor your product constantly as it is formed; reshaping it to match your EXACT specifications. Since we control production we can customize your product to any size and configuration you need for your space. Custom size, drain location, LED configuration; anything you can imagine. All of our illuminated basins are created using high density ½” resin Aura stone. This material is highly resistant to scratches or etching and extremely easy to clean and maintain. Aura stone is a translucent material allowing our energy efficient LED lighting arrays to disperse light throughout the entire product; creating an atmosphere-setting icy glow in any private bar setting for a truly unique experience. Customize your experience with the remote control included with your purchase and tailor the lighting to your personality; whether you enjoy a peaceful solid hue, or a flashy strobe or every colour in the rainbow, the illuminated basins can deliver.<br/><br/>Our custom illuminated basins are tailored to your unique needs. We hand-craft these basins to work perfectly with your desired application; whether you need a sleek counter-top bar sink, or stunning lavatory basin, we have the right fit for you, and if we don’t have it we can make it! This basin is about creating a luxury experience with a designer product in what is traditionally a utility application. We believe that everything in your home should reflect your dreams and we look forward to accomplishing this together with you.",
"id": "7653",
"product_name": "Luxe & Cube / Canada150 Collection",
"video_url": "https://www.youtube.com/watch?v=55SqiROjpJA"
}