{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7677",
"category": "Product > lighting: chandelier (multiple bulbs)",
"company_name": "Luceplan",
"company_url": "www.luceplanusa.com",
"description_html": "A suspension lamp offering multiple lighting scenarios for personalized aesthetic and functional performance. Based on experimentation with the potential of LEDs, a technology that permits separation into very small units, Mesh is a dramatic and highly innovative project.<br/><br/>A lamp of great theatrical impact whose almost transparent structure, composed of a network of flexible cables with LED sources positioned at their intersections, conceals the complexity of the design, dematerializing it to make room for only the light, the true protagonist. The particular structure permits exceptional freedom in the control of luminance: it is possible to govern the intensity of the light and to choose which portions of the lamp to turn on. Mesh is available in two sizes.<br/><br/>“I set out to create a lamp by starting with this capacity for spatial separation of LEDs, scattering them to optimize the read of light, but above all with the aim of giving each of these points of light its own independence. I wanted to make a lamp that lets you control the position and the quantity of light, a flexible object to adapt to space and the needs of the user. To organize the breakdown of the luminous points I used parameters similar to those identified by Fibonacci in nature, like the arrangement of the seeds in a sunflower, the eye-shaped features of a male peacock's plumage, or the complex forms of a head of cabbage. A precise sequence that inspired me for the distribution of the lights in space.”<br/><br/>Material: Structure in steel, lenses in polycarbonate<br/><br/>How it Work: Mesh is controlled by a dedicated ele ronic board which is located in the canopy.<br/>In order to control Mesh you need 4 wires: two to operate the standard ON/OFF switch and two to operate a “normally open switch” (push switch). The Push Switch will control the dimming and the different light scenes.",
"id": "7677",
"product_name": "Mesh 80",
"video_url": "https://vimeo.com/226425194"
}