{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7682",
"category": "Product > furniture: contract/tables",
"company_name": "Davis Furniture",
"company_url": "www.davisfurniture.com",
"description_html": "High design is the driving force behind Davis’ new reconfigurable table designed by Jehs+Laub. Intro combines beautiful form and practical functionality to create an intelligent table system for both flexible and fixed arrangements. Intro is a conference table for the 21st century. As people continue to grow, change, and adapt to the technology around us, so too should the environments we work in. Intro is designed for conference, meetings and seminars— in short, for all a company’s communications needs.<br/>Intro is not your typical conference table. Designed to be easy to operate, Intro tables can be configured into many different sizes and shapes. Intro’s clean and elegant legs are the foundation for a beautiful design. Configurations are built by connecting table tops with a removable leg. Configurations are easy to assemble, disassemble, and reassemble without the use of tools. Two levers discreetly lock the legs to the tabletop. Intro has multiple connection points so the leg can act as a connecting element or as an end leg. This feature creates a freedom in design where one unit can serve more than one function, depending on what is needed per the current configuration. The advantages are clear: greater flexibility and efficient use of space.<br/>Aluminum legs are chrome plated or powder coated in Davis’ standard line, now with more options than ever before. Not only a hallmark of the distinctive design, the legs also serve as an integral design feature for table security. Legs act as the connecting element between tables to guarantee stability and the placement ensures maximum legroom.<br/>The Intro table program includes tops available in veneer and high performance “Soft-Touch” Fenix laminate. Fenix laminate is a durable and fixable solution that has a graceful smooth touch. The tops are also available in standard Davis veneers. The knife edge detail heightens the design illusion, making the tops looks incredibly sleek and thin, all while maintaining their structural integrity.",
"id": "7682",
"product_name": "Intro",
"video_url": ""
}