{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7684",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "Andrew Pearson Glass",
"company_url": "www.andrewpearsonglass.com",
"description_html": "FUZION glass architectual elements and surfaces are crafted one at a time. The process we use to fuse glass to glass yield a surface of uncommon depth and illusionary definition. Natural inclusions and bubbles that are created in the process enhance the artisanal beauty of our glass. Glass, like stone, is one of the most durable and resilient natural surfaces. Our carefully defined heating and cooling processes increase the inherent hardness of our glass. The ultra-thick fused glass products are available to the trade for commercial and residential applications. The FUZION glass can be manipulated to be edged, or have glacier, lakeside, minimal, or wave textures. <br/><br/>Andrew Pearson has developed fused glass technologies to create our line of thick glass architectural elements and surfaces in a production environment. With fine tuned processes in place, we launched our ultra-thick fused glass products for commercial and residential applications under the name FUZION.<br/><br/>We use custom-built kilns to fuse glass to glass, producing an extra hard and durable surface for daily use in any residential, commercial or hospitality application. Our exacting process yields consistently beautiful thick glass available in a variety of patterns and thicknesses to create unique artistic looks.<br/><br/>Andrew Pearson specializes in luxury commercial and residential custom glass applications and installations for commercial and residential use. They offer specialized and unique glass products in a variety of techniques. All of their custom glass products are fabricated in North Carolina from raw glass produced in the United States. One-of-a-kind artisan glass products are produced by Andrew Pearson’s skilled craftsmen one at a time and are ensured to be both beautiful and durable. Andrew Pearson has pioneered several of the techniques that have become the hallmark of excellence in glass work for furniture and architectural glass design.",
"id": "7684",
"product_name": "FUZION Surfaces",
"video_url": ""
}