{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7685",
"category": "Product > technology",
"company_name": "Jabbrrbox",
"company_url": "www.jabbrrbox.com",
"description_html": "Combining integrated technology, comfort and privacy, Jabbrrbox™, a new workplace solution bringing privacy to commercial and public spaces, fills a critical void in the marketplace and is engineered for today's increasingly mobile workforce. The Jabbrrbox collection includes the Jabbrrbox One, an enhanced Chromebooth version, and the Jabbrrbox Two, suitable for two people.<br/><br/>The 48 x 48 x 90 workplace solution is ideal for conference calls, lengthy projects, or just productive, hyper-focused work. The Jabbrrbox One/Two has several important functions. It is an instant workspace that offers immediate connectivity, plus is pre-integrated with all the accoutrements of a state-of-the-art office. As noted in the WELL Building Standards, it is important to create distraction-free and productive environments for employees. As Jabbrrbox One/Two integrates privacy with technology, it is an ideal solution for the common open-floor plan, offering discreet and comfortable spaces and combatting visual noise.<br/><br/>All models of the Jabbrrbox feature a Philips Hue LED light strip capable of producing 16 million different colors, a Philips Hue Bridge, power outlets and USB charging ports, as well as up to 224 CFM of airflow. Jabbrrboxes are outfitted with luxe commercial grade fabrics and materials, including Camira Blazer &amp; Camira Blazer Lite. The Jabbrrbox Chromebooth features a 24\" Google Chromebase for seamless G Suite functionality. Whether used during blocks of time between meetings or as a convenient quiet place to get things done, the Jabbrrbox offers a space to think, create, connect and recharge.<br/><br/>Founded by Brian Hackathorn, a former Associate Principal at Studios Architecture, and Jeremy Jennings, an entrepreneur with a dynamic résumé that includes Fortune 500 businesses and commercial interiors brands, it was also specifically developed to provide comfort and accessibility for sessions longer than 15 minutes. With Jabbrrbox’s eco-friendly, ergonomic, and relaxed, quiet design, users are provided a space that brings together work and wellness. Like the users it serves, the Jabbrrbox booths are mobile and adaptable to a variety of environments, and can be moved without damage to the built environment or construction. Coming soon, Jabbrrbox powered by Jabbrr will bring private and connected work booths to multiple types of public spaces.",
"id": "7685",
"product_name": "Jabbrrbox",
"video_url": "https://vimeo.com/224504445"
}