{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7690",
"category": "Product > hardware",
"company_name": "Designer Doorware",
"company_url": "www.designerdoorware.com",
"description_html": "Timber is a fascinating material. Its organic beauty is apparent in its grain, colour and texture, with each piece unique in its characteristics. At Designer Doorware, we’ve been using timber in a range of our entrance handles for years, its natural aesthetic creating a soft touch and giving a feeling of warmth to the entrance of any project. However, with a recent rise in the demands for architectural timber products from architects, we’ve begun looking at further ways to bring this natural material into our products. <br/><br/>The Monte Timber lever collection was the culmination of 4 years of on-going research and development. The aim was to design a beautiful timber lever range that met the needs of the time. The desire to introduce warmth and comfort into our product range by utilizing the natural characteristics of timber. We were driven by the tactile aspects of the user experience. <br/><br/>This year, we would like to present our latest additions to the Monte Timber Collection:<br/><br/>Timber Zola lever <br/>Slimline and minimal, the perfect fusion of comfort and bold geometry. This door handle lever is capable of acclimatizing to both contemporary and timeless interiors.<br/><br/>Timber Niki knob <br/>Natural, humble and elegant, the Timber Niki’s enchanting simplicity and earthen charisma are a testament to the statement – less is more. Mounted on a round rose, the Timber Niki adds a captivating touch to any door. <br/><br/>Materials: Brass/Wood (American White Oak and American Black Walnut). The use of AFS and PEFC certified timber upholds the sustainable use of a material that will promote warmth and comfort during use.<br/><br/>Warm and textured timber door hardware designs with clean lines, simple curvature, timeless silhouettes, refined proportions and the ability to be purchased in over 35 finish combinations so that you can personalise the finish to your liking.",
"id": "7690",
"product_name": "Monte Timber Collection",
"video_url": ""
}