{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7702",
"category": "Product > lighting: architectural",
"company_name": "DYSON",
"company_url": "",
"description_html": "Jake Dyson started developing lighting technology because he was frustrated with the existing fluorescent and LED lights on the market.<br/> <br/>Fluorescent lighting makes up a significant portion of all commercial lighting, but there can be issues with inefficiency or with bulbs needing changed/disposal. Conventional LED lighting isn’t perfect either. Some manufacturers choose to compromise by using multiple smaller LEDs, which can create inefficient, ineffective lighting. Neglecting to protect those LEDs from heat can damage their phosphorous coating, thereby degrading brightness and color.<br/> <br/>People have different needs, across different spaces, at different times throughout the day. And, for optimal visual conditions, each one requires different light levels. That’s why, with the new Cu-Beam Duo suspended light, Dyson has designed a powerful, combined up and down light that has full, flexible illumination control.<br/> <br/>The Cu Beam™ up-light and down-light were the first of the Dyson suspended light technology. The Cu-Beam Duo joins the range with a controlled pool of powerful illumination that’s ideal for both meeting tables and office desks, also open spaces such as atriums, foyers, and general office lighting.<br/> <br/>With adjustable one-touch shutters and a reflective surface, Ricochet™ technology converts unwanted down light into up light, preventing light being wasted. For up light, closing the adjustable shutters allows recovery of unwanted down light. It reflects it upwards, to maximize lumen output and provide very high efficacy. For down light, opening the shutters allows more lumens to go downwards, to maximize downward light distribution onto the task plane.<br/> <br/>The Cu-Beam Duo combined up and down light with full flexible control. Directing light where it’s needed provides optimal visual conditions, preventing wasted light and helping to reduce eye strain. Light precisely where you need it and alters to suit changing needs throughout the day.<br/><br/>By employing Heat pipe technology, which is more commonly found in satellites and microprocessor technology, Cu-Beam™ suspended lights direct heat away from the LED — sustaining brightness for up to 180,000 hours.1 All with no bulbs to change, helping to save on costs and maintenance.<br/> <br/>For more information, visit www.dyson.com/lighting or call 855-720-6378.<br/> <br/>1Calculated lifetime based on LED L70.",
"id": "7702",
"product_name": "CU BEAM DUO",
"video_url": "http://www.dyson.com/lighting/cu-beam-suspended-lights.aspx#Duo"
}