{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7709",
"category": "Product > lighting: table",
"company_name": "FARO BARCELONA",
"company_url": "www.faro.es",
"description_html": "Hook is the first ecological and solidary lamp on the market.<br/>Ecological since it's manufactured with recycled plastic and toxic-free materials. Moreover, it is a design that helps others: each light fixture sold will feed one child for an entire school year thanks to a collaboration with the NGO Mary’s Meals.<br/><br/>HOOK is a portable lamp with a hook. It's free, it needs no installation. You can move it anywhere you would like given that it comes with a 5-meter cable so it can follow you to wherever you need it without having to worry about wall outlets. If, on the contrary, what you need is to have it near you, its geometry allows for a perfect roll-up of the cable so that it does not become a mess and using it feels comfortable and nice. <br/>Regarding functionality, it is a lamp and several lamps at the same time: it can work as a table lamp, as a ceiling lamp, as a wall lamp and even as a lantern. Its portability is helped by its size, which is completely adapted to the hand of the user, its long cable and its hook. It can be placed on any surface; it is designed to work perfectly on a bar, a shelf or a flat surface. In addition, Hook comes with a variety of accessories that turn it into a nightstand, a magazine rack and even a shelf. Lighting and maximum functionality from an elemental design filled with emotions. <br/><br/>Hook is revolutionary because of how it implements environmental aspects and the reduction of the toxic elements in the design and manufacturing stages of the product. It is one of the first interior design products made from recycled plastics and, at the same time, one of the first lamps with PVC-free wiring. In addition, since it is not enough to simply state it is eco-friendly; we prove it including a complete environmental product declaration. This lamp is made by a two-part recycled injected polypropylene housing and a translucent virgin-polypropylene diffuser. The cable is coated with silicone: an innocuous material both during its use and at the end of its lifecycle. For its design and its materials, CO2 emission reducing strategies have been implemented, as well as the highest standards to make it recyclable. Hook is ecological given that for its manufacturing process, only recycled plastics and materials free of toxic substances are used, avoiding the PVC for covering the wires, which makes it one of the most eco-innovative lamps on the market. In addition, this is a lamp made 100% in Spain.",
"id": "7709",
"product_name": "HOOK",
"video_url": "https://www.youtube.com/watch?v=J9vTUc3O_aE&t=12s"
}