{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7742",
"category": "Product > seating: contract/sofa",
"company_name": "Keilhauer",
"company_url": "www.Keilhauer.com",
"description_html": "Meander is a response to the ongoing shift in contract environments to look and feel more like residential. The modular design balances the comforts of home with high-performance durability, creating an inviting, casual lounge for guests and employees.<br/><br/>Designed by Niels Bendtsen &amp; Giancarlo Stefani of Bendtsen Design Associates, Meander can curve and connect every which way using 14 different pieces including ottomans, sofa seats and corner units at 70 and 90 degrees. Meander can wind and twist through a room to create a massive, multi-functional space or, smaller configurations and individual pieces can be used to create an intimate, environment. Equally at home in residential or corporate settings, it makes a relaxed statement while still exuding an air of luxury. Clean lines and large, full, stuffed cushions appear to float above the ground on visually delicate, solid iron legs. Meander is fully upholsterable in any Keilhauer textile, COL or COM. <br/><br/><br/>Innovative Design Features: <br/>Coil spring cushions give Meander unprecedented comfort. The cushions are incredibly giving and soft but spring back into place to prevent wrinkling. <br/><br/>Meander also features a unique ganging system at the legs, allowing the legs to turn in, out and be removed completely allowing the units to be configured and re-configured as the end user’s needs evolve.<br/><br/>Meander's glides are composed of a special polymer which was rigorously tested to ensure all surfaces would be protected from scratches or marking.<br/><br/>Meander is also designed to help create and maintain environments of wellness. Keilhauer furniture is built to the highest environmental standards to help create healthy spaces. Meander is expected to carry BIFMA level® 2 and SCS Global Services certification for Indoor Air Quality at the Indoor Advantage™ Gold level.<br/><br/>PRODUCT DIMENSIONS<br/>Single unit with back: W 32” D 33.75” H 27.5” SH 16.5”<br/>Single unit with back and arm: W 39” D 33.75” H 27.5” SH 16.5” AH 24”<br/>Inward curve unit: W 42” D 35.25” H 27.5” SH 16.5”<br/>Outward curve unit: W 42.25” D 35.25” H 27.5” SH 16.5”<br/>90 degree corner unit: W 49.75” D 33.75” H 27.5” SH 16.5”<br/>70 degree corner unit RCF: W 47.75” D 33.75” H 27.5” SH 16.5”<br/>Short back unit: W 47.25” D 33.75” H 27.5” SH 16.5” <br/>Ottomans: W 32”-47.25”x D 32”-47.25 x H 16.5”",
"id": "7742",
"product_name": "Meander",
"video_url": ""
}