{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7800",
"category": "Product > bath: fittings",
"company_name": "Moen, Inc.",
"company_url": "moen.com",
"description_html": "The U by Moen™ shower changes showering forever with Wi-Fi/cloud-based mobile connectivity and unmatched personalization providing homeowners countless ways to create their ideal showering experience with the push of a button. <br/><br/>U by Moen is the only cloud-based, app-driven digital shower on the market and provides users with the ultimate in-home spa experience that is programmed to perfectly meet their needs.<br/><br/>The system includes a digital valve that offers precise, thermostatic temperature control, and enables the users to connect up to four shower devices (showerheads, handshowers, body sprays, etc.). The Wi-Fi-connected controller features a five-inch, non-touch LCD screen that provides feedback on the shower status through on-screen messaging and notifications. <br/><br/>The U by Moen smartphone app gives the users the ability to create up to 12 personalized presets, including name, greeting, outlets, shower timer and temperature. By connecting a smartphone, users can choose in advance whether they need a relaxing warm shower on a cold morning, or a cool refreshing rinse after a workout. In an effort to conserve water, the U by Moen shower automatically pauses the flow of water once the desired temperature is reached, and resumes once the user has entered the shower. <br/><br/>For safety, the valve allows temperatures between 60 and 120 degrees. As the water temperature changes, the color of the screen will evolve from light blue, dark blue, purple, orange and red indicating the system is warming up or cooling down to reach the desired temperature. When ready, the screen will turn white, and provide an on-screen notification and signal with a tone.<br/><br/>The controller has seven to nine buttons – depending on whether it’s a two- or four-outlet system – enabling users to accurately control their shower experience. The controller provides consumers with the best of connected features and functionality, where they can customize settings directly in the shower and save them with one of two preset buttons.<br/><br/>With the technical design of a connected home product like U by Moen is of utmost importance, Moen took thoughtful design a step further, ensuring the physical appearance of the shower is just as impeccable. <br/>The physical design of the shower controller leans visually and conceptually away from “water faucet” hardware, toward a tech-based control panel. <br/><br/>The controller’s design is reminiscent of high-end audio electronics, with more elevated appearance best demonstrated by its pure, minimalistic rectangular form. Designers purposely selected the sleek, metal-and-glass finish, to evoke a luxurious feel. <br/><br/>Terra Beige, the color of choice, is a European exterior automotive finish that is exactly natural without being too boring. It fits well with cool chrome adjacent shower hardware, as well as warm oil-rubbed bronze. The controller’s versatile finish allows consumers to incorporate the product into their homes, regardless of the design aesthetic. <br/><br/>U by Moen creates a luxurious shower experience in both look and feel, while still being completely customizable to the user’s needs.",
"id": "7800",
"product_name": "U by Moen™",
"video_url": "http://www.moen.com/u"
}