{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7834",
"category": "Product > kitchen: fixtures",
"company_name": "BLANCO",
"company_url": "www.blancoamerica.com",
"description_html": "BLANCO takes exceptional design \"beyond the kitchen\" with the launch of the LIVEN Laundry Sink. The innovative dual mount LIVEN is the perfect sink for a design-inspired laundry room. LIVEN comes in 8 trending SILGRANIT colors with a deep, functional bowl that resists heat, stains and chips. <br/><br/>The LIVEN Laundry Sink is made of BLANCO’s patented SILGRANIT® material and features a generous radius on each of its corners; making it as easy to clean as it is durable. This innovative laundry sink is 25x22 inches – a perfect fit for compact laundry areas. An extra-deep 12\" bowl, perfect for soaking, and space saving basket designed to fit on top of the sink make any dirty job a breeze.<br/><br/>“BLANCO is excited to take our designs beyond the kitchen with the launch of the new LIVEN Laundry Sink,” states Tim Maicher, Director of Marketing for BLANCO. “Builders and homeowners are moving laundry areas from the basement to higher traffic areas like the master suite or living areas. With this new trend, BLANCO saw the opportunity to create a beautiful and durable laundry sink that would add functionality in a small space while elegantly complementing a finished laundry environment.”<br/><br/>The LIVEN Laundry Sink will be offered in all 8 SILGRANIT colors and offers an on trend rectangular shape. With multi-purpose installation, the dual mount LIVEN can be installed under or over the countertop for added convenience. <br/><br/>LIVEN Laundry Sink details:<br/>•\tDual Mount<br/>•\tOpen Radius <br/>•\tRectangular Shape<br/>•\tBowl Depth 12”, Dimensions 22x25 inches<br/>Available in all 8 SILGRANIT colors: White, Café Brown, Anthracite, Metallic Gray, Cinder, Truffle, Biscuit and Biscotti<br/>•\tMSRP: $595<br/><br/>SILGRANIT features<br/>•\tRock hard granite durability<br/>•\tHeat resistant up to 536°F<br/>•\tUnsurpassed cleanability backed by industry leading 7 patents!<br/>•\tResistant to scratches, stains and all household acids and alkali solutions",
"id": "7834",
"product_name": "BLANCO LIVEN Laundry Sink",
"video_url": "https://youtu.be/GeKG2Fhu2Dc"
}