{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7948",
"category": "Product > kitchen: appliances",
"company_name": "ZEPHYR Ventilation",
"company_url": "zephyronline.com",
"description_html": "Zephyr’s Anzio, Ravenna, and Savona are the industry’s first kitchen ventilation hoods in Black Stainless Steel made with titanium coating. A sleek alternative to standard stainless steel, the three hoods are made with titanium coating: a military-grade built-in layer of protection with an anti-smudge coating for easing cleaning. The hoods are available in chimney-style wall mount and the Ravenna features a smoke-gray glass canopy. In addition, the hoods are equipped with BriteStrip™ LED lighting, ICON Touch® Controls and Airflow Control Technology (ACT™). <br/><br/>The Black Stainless Steel hoods all include Zephyr’s new BriteStrip™ LED lighting and ICON Touch® Controls that seamlessly integrate into the hood’s canopy. Users can easily control the 5-speeds, delay-off function and auto reminders. Zephyr also incorporated its exclusive Airflow Control Technology (ACT™) - technology that gives builders and developers the freedom to install range hoods with maximum blower CFM, without having to compromise power or design.<br/><br/>Zephyr’s Black Stainless Steel hoods are made with Solid Titanium that is transported on the stainless steel through a Physical Vapor Deposition (PVD) process. This makes the material more uniform and durable than a traditional coating process. The PVD process is also an eco-friendly technology (in contrast to chemical and galvanic surface treatments) that is clean and dry with no hazardous materials involved, and does not generate chemical waste or water pollution.<br/><br/>The successful launch of Zephyr’s Black Stainless Steel hoods proves that designers and homeowners want options when it comes to their appliance finishes in the kitchen. The industry is moving away from all stainless steel kitchens with the introduction of warmer tones such as Rose Gold, Copper, and Brass. Black Stainless complements these products and gives consumers customization options that were never before available.",
"id": "7948",
"product_name": "Zephyr Black Stainless Steel",
"video_url": "https://youtu.be/fa6bTHtDKMk"
}