{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7957",
"category": "Product > architectural products",
"company_name": "PPG",
"company_url": "https://diy.ppg.com/products/paints",
"description_html": "PPG TIMELESS® paint and primer in one is a premium paint for interior and exterior use that incorporates PPG’s industry-leading coatings innovation and expertise used to coat automobiles, airplanes, submarines and space shuttles so DIYers, pros and residential painters can be certain that this paint is formulated to last. <br/><br/>Widely available at THE HOME DEPOT® locations across the U.S. and at homedepot.com, PPG Timeless paint is the first paint product that prominently carries the PPG name to be sold through a major home improvement center. <br/><br/>With PPG Timeless Color-Protect Technology, PPG Timeless Paint provides one-coat coverage in 1,000 colors* and the toughest, most wear-resistant finish for interior paint. Other features include:<br/><br/>PPG Timeless Interior Paint and Primer:<br/>•\tOutstanding washability, scrubbability and stain resistance for the inside of the home.<br/>•\tInterior paint and primer in one that is ideal for use in kitchens, bathrooms, living rooms, family rooms, dining rooms, bedrooms and high-traffic areas like hallways.<br/>•\tInterior Color-Protect Technology that ensures the chosen color is the color that stays.<br/>•\tOptimal thickness for easy application and a smooth, even finish.<br/>•\tPPG Timeless uses the same automotive-grade ultraviolet (UV) and gloss retention package used by leading automotive manufacturers.<br/>•\t100 percent acrylic formula.<br/>•\tOne can provides up to 400 sq. ft. of coverage.<br/>•\tLow odor and low VOC (volatile organic compounds).<br/>•\tLifetime guarantee. <br/>•\tAvailable at more than 1,300 The Home Depot stores.<br/><br/>PPG Timeless Exterior Paint and Primer:<br/>•\tExterior UV-Protect Technology that prevents the exterior from color fading and provides protection for the surface.<br/>•\tA tough exterior finish that provides exceptional resistance to chipping, flaking and cracking while resisting mold, mildew and algae.<br/>•\tA unique exterior high-build formula that helps hide minor surface imperfections.<br/>•\tAn exterior paint and primer product that is ideal for use on a variety of exterior surfaces, including wood, concrete, masonry, fiber cement, stucco, brick, siding, windows, doors and trim.<br/>•\t100 percent acrylic formula.<br/>•\tCan be applied in weather conditions as cold as 35 F. <br/>•\tOne can provides approximately 250 to 300 sq. ft. of coverage.<br/>•\tCustomer satisfaction guarantee.<br/>•\tAvailable at more than 400 The Home Depot stores.<br/><br/>*One coat coverage when tinted to 1,000 color choices specified for PPG Timeless Interior &amp; Exterior Paints.<br/><br/>**Learn more at https://diy.ppg.com/products/paints/timeless-interior-paint and https://diy.ppg.com/products/paints/timeless-exterior-paint.",
"id": "7957",
"product_name": "PPG Timeless",
"video_url": ""
}