{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/7983",
"category": "Product > bath: fixtures",
"company_name": "Bradley Corp.",
"company_url": "www.bradleycorp.com",
"description_html": "The Verge with WashBar is a completely touchless all-in-one hand washing system with unique clean+rinse+dry functionality. The unit integrates the attractive Verge basin along with \"smart\" soap, water and dryer housed in the WashBar fixture for a fresh, personal and complete hand washing experience. Engineered to balance airflow and noise, the dryer and bowl are designed to work together to eliminate the spraying of water that could get the user wet or drip onto the floor, causing slips, falls and mess. With all components in close reach, the Verge with WashBar elevates convenience, comfort, aesthetics, accessibility and safety in a variety of commercial washroom applications.<br/><br/>The WashBar is a chrome-plated stainless steel fixture that houses soap, water and dryer in a single component. LED lighting and icons on the WashBar visually orient the user to wash hands with soap, water and dryer, while its streamlined design eliminates the clutter of three separate components on the deck. <br/><br/>The Verge basin is made with Evero Natural Quartz, a resilient natural composite material that is non-porous, seamless, easy to clean and carries a long lifecycle. Evero blends the elegance of quartz, luminance of exotic materials, and eco-friendliness of a bio-based resin. It contains up to 70% recycled content and is available in 17 colors.<br/><br/>By incorporating the clean, rinse and dry elements into a single WashBar, this hand washing fixture creates an attractive timeless look that presents an intuitive interaction. From a design perspective, minimal, simple and inviting were the three design keywords we were aiming to capture. The form of the WashBar leans out over the Verge basin to invite the user. Sophisticated tone on tone iconography enhances the clean appearance. <br/><br/>Holistically, we wanted this product’s form, dimensions, materials and colors to attract and resonate with users. The clean, minimalist and streamlined form of this fixture draws people in. The linear dimensions of the fixture reinforce that aesthetic. With its careful balance of elegance and simplicity, this fixture creates an instant connection with the user. The WashBar’s form echoes the sleek lines of the basin, and engages the user into experiencing the fixture. <br/><br/>The smooth and seamless Evero natural quartz of the basin complements the fixture’s refined form. Its crisp clean color selections are striking yet approachable. The WashBar fixture’s polished finish accentuates the distinctiveness of this fixture. <br/><br/>Altogether, these aesthetics create an immediate feeling of comfort and ease in any commercial restroom. Instantly, hand washing is transformed into a uniquely personal and refreshing experience. <br/><br/>Product URL/Video: http://info.bradleycorp.com/washbar<br/><br/>Evero Natural Quartz URL: https://www.bradleycorp.com/evero-natural-quartz-surface<br/><br/>Bradley Corp. URL: https://www.bradleycorp.com",
"id": "7983",
"product_name": "Verge with WashBar",
"video_url": "https://www.youtube.com/watch?time_continue=2&v=KDttJE6pO8A"
}