{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8069",
"category": "Product > kitchen: fittings",
"company_name": "The Galley",
"company_url": "www.thegalley.com",
"description_html": "The Galley Tap is a beautiful and remarkably functional kitchen faucet designed by Chicago-based plumbing guru, David Kotowsky of Hydrology. This stunning kitchen faucet has been ergonomically designed and engineered with dimensions that are specifically suited for the Galley Workstation. Thanks to its 11” CENTERSTATION™ projection, pot filling height, and ability to extend the hand spray 27”, the Galley Tap offers ideal performance with the Galley Workstation. <br/><br/>Ergonomics<br/>The forward rotating COMFORTFEEL™ lever handle with ceramic disc cartridge provides effortless operation. The ergonomic slide switch on the large pull-out hand spray allows you to conveniently select laminar or spray flow depending on use. The quiet and smooth gliding flexible hose with hand spray easily retracts back and is held in place with the counterweight and magnetic docking systems. <br/><br/>Quality and Finish<br/>State-of-the-art quality and manufacturing precision is evident throughout every millimeter of the Galley Tap. This is the result of Swiss engineering and Italian manufacturing. The Galley Tap and accompanying Soap Dispenser and Deck Switch are available in four flawless stainless steel finishes: Matte, Polished, PVD Gun Metal Gray and PVD Satin Black. Machined out of solid AISI 316L stainless steel, this dynamic faucet is ideal for both indoor and outdoor use. <br/><br/>Key Features<br/>- Solid AISI 316L Machined Stainless Steel Construction<br/>- Indoor and outdoor<br/>- Forward rotating COMFORTFEEL™ lever handle<br/>- 11\" CENTERSTATION™ spout projection<br/>- 11\" pot fill height from deck to spout outlet<br/>- Spout rotates 360 degrees<br/>- Hand spray extends up to 27\" from spout<br/>- Magnetic docking system holds hand spray in place<br/>- Ergonomic slide switch to select laminar or spray flow<br/>- Concealed easy-clean spray face<br/>- Quiet, smooth gliding hose<br/>- Quick installation system<br/>- Maximum flow rate 1.8 gpm (6.8L/min)<br/>- Optional base ring included <br/>- Available in Matte, Polished, PVD Gun Metal Gray and PVD Satin Black <br/><br/>“The Galley Tap is highly engineered, perfectly proportioned, functional, and beautiful. Simply put, it completes The Galley Workstation.” said Scott Anderson, CEO of The Galley. <br/> <br/>“The Galley Tap is the first and only kitchen faucet thoughtfully designed to function perfectly with a specific line of kitchen sinks, or in our case, kitchen workstations. Its striking beauty comes from its perfect geometry. That’s the magic!” states Kotowsky.",
"id": "8069",
"product_name": "The Galley Tap",
"video_url": ""
}