{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8073",
"category": "Product > flooring: tile and stone",
"company_name": "AKDO",
"company_url": "www.akdo.com",
"description_html": "Kaya is a collection of textured-stone subway tiles and mosaics designed in collaboration with the creative powerhouse, Clodagh.<br/><br/>Inspired by the underlying practices of meditation, Kaya by Clodagh was founded on the principal that all aspects of design should not only enhance spaces, but also, bring an overall sense of wellbeing to the individuals who inhabit them. <br/><br/>The geometry of all of the patterns is modular, and the colorways neutral, allowing the designer to create their own individual looks, while still maintaining Clodagh’s signature “Life Enhancing Minimalism”. <br/><br/>The Kaya Collection features three neutral colored stones that can be used in virtually any space, including a warm Brown, a cool Gray, and of course, a classic White. The surface of the stone has been given a variety of textures to intensify its authentic beauty. Some of the pieces have been sandblasted, lending the appearance of years of wear, while others have a linear combed texture that adds directional energy. The collection also features honed stone, which has a richer color.<br/><br/>Aupala - A set of large format modular subway tiles made from a mixture of textured stone in varying mosaic arrangements. These tiles are unique because they can be turned or stacked, and will always fit together perfectly. <br/><br/>Kardama - An elongated modular subway tile. Its scale makes it perfect for a variety of areas, including walls, floors, and backsplashes. Throughout the Kaya Collection, the surface of the stone has been given a variety of textures to intensify the authentic beauty of the natural stone.<br/><br/>Khani - The Kaya Collection was designed to create tranquil atmospheres, and the Khani mosaic embodies this intent. It is an ideal pattern to use in relaxing environments, such as around a fireplace. It uses the same geometric shape as Kardama, but on a smaller scale, and is placed in an alternating horizontal and vertical orientation. <br/><br/>Kavara - Kavara is a modern take on a brick pattern, perfect for use in backsplashes. The gentle mix of tones in each mosaic creates a harmonious directional movement.<br/><br/>Azan - Azan is a linear mosaic that features a random blend of rectangular textured stone. While random, the mosaic has a thoughtful meditative feel. Each of the colors in Azan is made up of two textures. Both the White and Gray colorways are made up of two different grit sandblasted stones, while the Brown colorway includes honed and combed stone.<br/><br/>Labyrinths - Lastly, the collection features the Ahuta Finger Labyrinth, available in the three colorways included in the line. Running your finger along the lines of the Ahuta Labyrinth as part of your daily ritual reminds us of the importance of being thoughtful and aware. The centuries-old tradition of tracing shapes during meditation can act as a form of relaxation and prayer in your modern life. The Zama Labyrinth is a larger scale symbol, which can be inserted into a field of floor or wall tile. Looking at the Zama Labyrinth brings a sense of peace and calm.",
"id": "8073",
"product_name": "Kaya Collection by Clodagh",
"video_url": "https://vimeo.com/225572526"
}