{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8097",
"category": "Product > seating: contract/lounge",
"company_name": "Keilhauer",
"company_url": "www.Keilhauer.com",
"description_html": "Two new models, a sofa and bench, have been added to Keilhauer’s award winning Juxta collection. Juxta is a series of seating and tables, designed to address the myriad of ways people behave and interact while meeting. In groups large or small, in public or private spaces, juxtaposition of opposing behaviors often occurs in a single scenario: formal and informal; mobile and stationary; standing and sitting; brief and lengthy. Juxta addresses all these dichotomies with slim volumes, continuous lines and iconic design. The new bench and sofa come with optional rotating tablet arms on either side to address increased demand for both solitary reflection and face-to-face interaction.<br/><br/>Designing for juxtaposed behaviors, such as independent work and meetings, is a connecting theme for the Juxta Collection. Each piece is suited to a variety of rituals in the workplace. The Juxta bench and sofa is suited to create a compact meeting or lounge space while rotating tablet arms provide a flexible work surface.<br/><br/>Juxta sofas and benches are available with and without tablet arms. Arms are fully adjustable, and tablets are able to rotate 360 degrees . The arms flow beautifully and naturally from the base to provide seamless, uninterrupted lines.<br/><br/>Juxta products can be upholstered in any COM, COL or any Keilhauer textiles. The frame is available in Polished Aluminum or Dark Grey and tablets are available in 39 different colors. The new offerings integrate seamlessly with the 79 unique products already incorporated with in the Juxta collection, including tables, stools and chairs.<br/><br/>Juxta is designed to help create and maintain environments of wellness. Keilhauer furniture is built to the highest environmental standards to help create healthy spaces. Juxta is expected to carry BIFMA level® 2 and SCS Global Services certification for Indoor Air Quality at the Indoor Advantage™ Gold level.<br/><br/>PRODUCT FEATURES<br/>4-leg base in Polished Aluminum and dark grey<br/>Rotating tablet arms in 25 plastic laminate colors,<br/>Rotating tablet arms in 15 Fenix NTM® laminate colors<br/>Solid steel frame for exceptional durability<br/><br/>PRODUCT DIMENSIONS<br/>Juxta bench: 17.5”-25.5”H X 113”W X 27.5”D, SH 17.5”, Tablet Height 25.5”<br/>Juxta sofa: 34” H X 113”W X 29.5”D, SH 17.5”, Tablet Height 25.5",
"id": "8097",
"product_name": "Juxta sofa & bench",
"video_url": ""
}