{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8160",
"category": "Product > wall covering: contract",
"company_name": "Inpro",
"company_url": "www.inprocorp.com",
"description_html": "They express, without speech. They attract touch, without feeling. They provide experience, without movement. Walls are one of the largest elements of an interior. Inpro introduces a way to give them purpose and expand their longevity with Ricochet™ Flexible Wall Protection, wall protection that literally bends to the whim of any design. <br/><br/>Ricochet brings a whole new protection perspective by combining the look of wallcovering with the durability of rigid wall protection, so walls can make an impact while being able to take an impact. Unlike other products on the market, Ricochet™ Flexible Wall Protection offers the same durability and protective performance as traditional rigid wall protection, but is indistinguishable from wallcovering. It’s durable enough to handle the conditions of the harshest environments, yet literally flexible enough to become the showpiece or the backdrop of any interior. With seamless installation, Ricochet becomes an uninterrupted finish for any of 9 introductory patterns in a variety of colorways for each pattern. <br/><br/>While some protective wall products offer pattern, they’re in the form of rigid plastic. And others offer the look of wallcovering with protection characteristics, but lack the ultra-durable performance of rigid plastic. Ricochet is the perfect balance – the aesthetic of wallcovering with the function of traditional wall protection. It’s so resilient, it fends off stains and vandalism, simply by wiping away with standard cleaning agents.<br/><br/>As experts in wall protection, we didn’t stop at offering Ricochet in rolls. We also offer a dimensional design alternative with wall panels wrapped in Ricochet for another way to bring visual interest to interiors.<br/><br/>With Ricochet’s inviting textures, rich colors, alluring patterns and a seamless appearance, a wall isn’t just a surface, it’s a canvas.",
"id": "8160",
"product_name": "Ricochet™ Flexible Wall Protection",
"video_url": ""
}