{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8170",
"category": "Product > kitchen: cabinetry",
"company_name": "Snaidero USA",
"company_url": "http://www.snaidero-usa.com/",
"description_html": "WAY MATERIA Kitchen by Snaidero Design<br/><br/>A RIGOROUS ARCHITECTURAL STYLE AND ULTRA-CLEAN AESTHETICS<br/><br/>WAY MATERIA (an evolution of WAY a GOOD DESIGN™ Award winner) is a cabinetry line developed by Snaidero’s own Design Department. Using the company’s 70-year experience in kitchen design, this specialized team focuses on creating cabinet systems that meet market needs. A revolutionary concept that employs ceramic slabs of pure porcelain stoneware. <br/><br/>CONCEPT<br/>Clear-Cut Architectural Design<br/>WAY MATERIA features simple design lines expressed through a very rich range of elements, allowing for limitless layout solutions. <br/><br/>• The Laminam ceramic fronts feature long porcelain stoneware surfaces in just 3 mm thickness. A technologically innovative solution that provides superior resistance and sophisticated aesthetics. The Laminam ceramic serves as a hygienic and antibacterial surface that withstands sharp blades, hot liquids and oils. <br/>•To maintain a streamlined aesthetic WAY MATERIA replaces the traditional handle with a continuous channel in anodized aluminum alloy with Titanium finish. The channel can be applied to both horizontal and vertical door openings. <br/>•The door-opening channel is also featured on the side end panels (either 1.2 cm or 7.5 cm thick) to maintain aesthetic continuity.<br/>•WAY MATERIA offers extreme flexibility of storage space, with cabinets, wall units, and tall units available in different heights and widths to develop the design vertically or horizontally – whichever is the preferred solution<br/>•Four types of open elements – available in seven different colors – make it possible to create dynamic compositions on wall units, tall units, under-wall units, and even in the living areas.<br/>•Continuity with the living area is also guaranteed thanks to the boiserie element, available in all door finishes, with 3 cm-thick shelves of variable depths and integrated LED lights.<br/>•The recessed toekick creates a “floating” effect and is available in two heights (10 cm and 23 cm) to bring the cabinets to the level that is most comfortable for the user.<br/>•Countertops are available in 4 different thicknesses, with materials including granite, quartz stone, solid surface, quartzite, steel and glass.<br/>•WAY MATERIA comes in a range of over 100 different colors (even tailor made color options) and finishes, from melamine and wood veneer to glossy and frosted glass as well as a variety of lacquers, including Snaidero’s exclusive micalized lacquer.<br/>MADE-IN-ITALY CRAFTSMANSHIP<br/>Snaidero’s highly skilled craftsmen work as a throwback carpentry workshop inside the company’s high-tech Italian factory to refine each piece and add unique details. <br/>Like all Snaidero kitchens, WAY MATERIA is manufactured and designed with respect for the environment and human health. Green features include: <br/>•100% post-consumer wood, certified by the Forest Stewardship Council (FSC) as being 100% Recycled<br/>•Cabinet structure panels using glues and resins with extremely low formaldehyde emission levels - less than a half of the standard set by the LFE E1 international certification, which is even stricter than the standard of the California Air Resources Board<br/>•Water-based matte lacquer varnishes and cabinet coatings that reduce VOC emissions by 95%",
"id": "8170",
"product_name": "WAY MATERIA",
"video_url": ""
}