{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8180",
"category": "Product > textiles: contract",
"company_name": "HBF Textiles",
"company_url": "www.hbf.com",
"description_html": "HBF Textiles’ Raw Materials collection aims to make the office a ‘second home’ as opposed to a corporate environment, by adding warmth to the workplace.<br/><br/> The six new fabrics found in Raw Materials are as comfortable as they are unique in their individual character. Ranging from natural and simple tones to abstract and spontaneous patterns, Raw Materials creates an inviting series that captures the essence of the yarn engaged. New designs like Double Stitch, Sideways, Outdoor Check, and Italian Wool can be used with minimal furniture and lighter woods in an open, airy office environment, in colors that are modest neutrals and vibrant hues. Scribble XS and Scribble XL are woven versions of Elodie’s stitched and painted artwork, as modern abstract art pieces that lend sophistication to work spaces and are suitable for formal and friendly offices alike. <br/><br/>HBF Textiles’ signature craftsmanship and dedication to high quality, livable fabrics allows for the Raw Materials collection to thrive in a variety of settings. The flexibility of the collection is testament to its artistry, allowing the individual to utilize Raw Materials in a residential, office, or commercial setting - all while maintaining an exceptional level of comfort and performance.<br/><br/>Each fabric in the collection adds to the aesthetics of a room in its own way. From the textural Double Stitch that helps create a natural, calming environment to the vibrant Scribble XL that adds modernity and elegance to a previously sterile office, Raw Materials enlivens any space with textural excitement. Elodie’s own artwork is incorporated into both Scribble XS and Scribble XL, adding personal inspiration and artistic integrity into the collection. With Scribble XS, Elodie used her experience to stitch repeatedly a spontaneous pattern, created from a variety of gestural stitched lines using a sewing machine in a new way. Scribble XL was painted by Elodie with large gestural brush strokes to capture an energetic abstract nature. Both patterns express the hand of the maker, adding a personalized, handcrafted influence to the collection.",
"id": "8180",
"product_name": "Raw Materials",
"video_url": ""
}