{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8222",
"category": "Product > furniture: contract/case goods",
"company_name": "Nienkamper",
"company_url": "www.nienkamper.com",
"description_html": "Cern embodies the warm-modern sensibility of todays working environment. Most notable about the Cern collection is its wide range of mixed materials and finish options that contrast and complement each other, which when layered creates unique and versatile workspaces and keeps things visually interesting; Laidback and casual for some areas, streamlined sophistication in others.<br/>The Cern collection is a system that addresses contemporary office furnishing needs. The multi-functional elements allow for seemingly endless combinations and configurations from individual offices and workstations to teamwork areas for more collaborative work. The table range includes modular tables and desks, bench desks as well as height adjustable options. <br/>Cern offers a wide variety of innovative office storage solutions. The credenzas and bookcases can either be freestanding or completely integrated with tables. Cern is also capable of creating wall compositions; bookcases and credenzas can even be used as room dividers to create separate and distinctive work zones. <br/><br/>“The Cern table was a terrific point of departure for a complete furniture collection. This collection has evolved from the private office, to furniture that can be flexible enough to create individual work spaces, room division, height adjustability and varied levels of privacy.” Said designer Lee Fletcher of Fig40 . Adding, “The Cern themes of continuity and integration can be seen throughout the collection. With new additions including cast concrete desk accessories, a coat rack and architectural scale double sided shelving.” <br/><br/>Cern pairs timeless design with thoughtful functionality to create dynamic and inspiring spaces for the modern workplace.",
"id": "8222",
"product_name": "Cern Collection",
"video_url": ""
}