{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8256",
"category": "Product > lighting: architectural",
"company_name": "Targetti",
"company_url": "http://www.targetti.com",
"description_html": "Light is a silent language connecting people with space and objects around them. It needs no translation because it appeals directly to our emotional sphere. Targetti and Gensler have collaborated to introduce a new way of seeing” Light” as an Emotion versus” Light” as a technical color. <br/><br/>The EMOTIONS COLLECTION is a strategically designed collection of custom LED lighting colors developed specifically to take the guesswork and lighting calculations out of selecting the right color for interior lighting. Inspiration was derived from sample project palette’s that spanned across multiple industries from Retail, Hospitality, Commercial lighting and more. Targetti utilized their advanced color methodology to create specific illumination colors that best complement each palette based on the hues, textures and overall emotion that space needs to emit. Each combination of color mixed LEDs was carefully selected, tested and blended in special groups of common Spectral Radiation data (CCT, CRI, x/y coordinates) to deliver the ideal combination of color and tone to best complement the hues, textures and aura of the specific palettes’.<br/><br/>What one experiences as a warm or cool color temperature can be experienced totally different depending on the built environment around it. Color can also be perceived in a dissimilar way depending on the source that illuminates it. Traditionally, colors are selected by a perceived notion of the ideal color temperature, CRI or other standard methodologies. However, color is ideally selected not only based upon the color temperature, the kind of source and its color rendering, but most of all according to the spectral distribution of the source. We understand that color is a perception that is affected and influenced by the similarities of ALL common Spectral Radiation data. <br/><br/>Our research took us across the United States to six of Gensler’s largest offices where we held interviews with interior designers from their various studios. Over the span of these visits, designers were asked to create the “perfect light” for their project, culminating in over 150 different data points. By applying digital technology, we were able to control the wavelength of the spectrum separately. Much like a music composer arranges a finite number of notes to create surprising harmonies, we distribute single wave lengths that compose tones of different intensities to create a different spectrum with its own harmony. The result is a light that distributes a specific ambient to enhance the perception and emotions the designer is trying to achieve. <br/><br/>Out of the thousands of data points that were calculated and derived from the field research, we distilled this data to create the first 11 typologies of interiors conditions for the Emotions Collection. By using this advanced color philosophy, we have the ability and technology to offer the exact spectrum a designer wants to use to accent and illuminate any environment. While the methodology was simple in many ways, the outcome has produced a profound new way of addressing lighting in designing interior spaces.",
"id": "8256",
"product_name": "The EMOTIONS COLLECTION by Targetti",
"video_url": "https://youtu.be/OMR7MaEY26A"
}