{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8263",
"category": "Product > lighting: chandelier (multiple bulbs)",
"company_name": "Boyd Lighting",
"company_url": "https://boydlighting.com/",
"description_html": "The linear T-Light Pendant features parallel pieces of extruded aluminum that hang from two stems. These two horizontal beams sandwich a ¾” thick piece of etched, water white glass which, together, form an upside down “T”. Two strips of 3000˚K LEDs provide warm up and down-light and are wired as dual circuits, which allows each light source to be dimmed separately. A diffuser on the top of the fixture diffuses glowing up-lighting, while light radiating from the bottom of the glass is soft yet strong. Once hung, each of the two stems can be adjusted independently to level the pendant. The T-Light comes in a myriad of standard powder coat finish options: Cinnamon Bronze; Rubbed Bronze; Silver Fog; Black Granite; Gossamer Aluminum; Gloss White; Golden Gate Orange; and Coffee Bean. The fixture can also be powder coated to compliment any interior scheme. The fixture is available in 5’, 6’ and 7’ lengths.<br/><br/>The idea of the T-light, according to Joshua Aidlin, “… was to create an extremely quiet linear pendant that honestly and elegantly expresses its structure while providing directional light above and below.” <br/><br/>The T-Light was co-designed by Aidlin Darling Design’s Peter Larsen, principal, and Adrienne Swiatocha, designer. While Aidlin Darling has been awarded regional, national and international design awards, Boyd Lighting is also the recipient of numerous awards for lighting design. The relationship between the firms goes back decades to when Dave Darling (then with Brayton and Hughes) helped design the landmark Boyd building at 944 Folsom Street in San Francisco.",
"id": "8263",
"product_name": "T-Light Pendant",
"video_url": "https://vimeo.com/163891956"
}