{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8306",
"category": "Product > seating: contract/lounge",
"company_name": "BERNHARDT DESIGN",
"company_url": "www.bernhardtdesign.com",
"description_html": "Inspired by the power of connection through its modular and flexible design, with an eye toward facilitating more intimate collaboration in the workplace, Neighborhood is an innovative collection of furniture for public spaces and offices.<br/><br/>Since starting operations nine years ago out of a three-bedroom apartment in the SoMa district of San Francisco, Airbnb has moved and transitioned in office spaces several times. Throughout each of these locations, they have experienced the difficulties of adapting furniture from one space to another, while preserving a sense of community and comfort. Readily available furniture options were consistently too visually heavy or not adaptable to certain spaces. They were never able to find the perfect fit. Neighborhood addresses this issue for adaptability by being a modular, mobile and connected design solution for the modern office. <br/><br/>Airbnb celebrates the connections people make every day through their platform - connections with new places, new people, and cultures. Neighborhood celebrates the beauty of these connections while providing comfortable, flexible solutions for the evolving workplace.<br/><br/>Neighborhood’s basic \"building block\" geometry provides endless configurations and adapts to any space. A series of high-back modules creates privacy and intimate (or hushed) seclusion within an open office, while a collection of benches and low-back seating units are perfect for casual conversations or creative brainstorming. Groupings can be readily rearranged to form expansive landscapes or small intimate settings. The highback version allows for open floor plans to appeal to the ‘savanna preference’ - a design principle that mimics the savanna’s of our early ancestors. Technology integration and sound absorbing materials provide a smart option for workspaces. As companies grow and change, their furniture must also; Neighborhood reflects the fast-paced adaptation companies continually experience in a physical space.<br/><br/>Neighborhood is comprised of 42 unique modules, the largest collection ever released from Bernhardt Design, which range from tall privacy units to sofa sectionals and tables with electrical access to mobile ottomans. The range and flexibility of the line ensure that it’s not only the perfect fit for office spaces but any public areas - from airports to restaurants.<br/><br/>Neighborhood typifies the exceptional quality and standards of Bernhardt Design. The surface options include wood, laminate, and solid surfaces. The collection may be specified in Bernhardt Textiles or COM.<br/><br/>Stitching and tailoring play an integral part in the appeal of Neighborhood. The contoured profile of the fully upholstered units is highlighted by distinctive jump stitch patterns around the perimeter. The beauty of the line is that it can be easily and instantly adaptable by the people using it, rather than relying on an installation team to reconfigure a workspace.<br/><br/>The idea of using two simple building blocks to create an entire community of flexible products results in a new generation of innovative design with seemingly unlimited possibilities. The mobile table units are fully power integrated to keep charged and plugged in while collaborating.<br/><br/>Neighborhood is GREENGUARD Certified. All adhesives are water-based. Bernhardt Design is an EPA Climate Leader Partner, and facilities are certified level audited.",
"id": "8306",
"product_name": "Neighborhood",
"video_url": ""
}