{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8370",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "Archoterra",
"company_url": "archoterra.com",
"description_html": "Archoterra is an eco-friendly surface solution made from a proprietary blend of recycled papers and bonding agents formed into durable, lightweight 4'x8' sheets. The product can be used as an architectural panel, veneer or laminate suitable for walls, ceilings, cabinetry, furniture and more. Archoterra's great innovation lies in the fact that it is not only made from a recycled material but that it also has a unique aesthetic evoking a combination of paper, stone &amp; concrete and is lightweight and easy to install with minimal seams. Archoterra is made in the USA from 90% post-consumer recycled materials sourced locally with a hands-on manufacturing process.<br/><br/>Archoterra's product line is organized into FLAT and DIMENSIONAL 4'x8' sheets, and offers 38 colors and 12 Dimensional patterns in both smooth or textured surfaces. Thickness ranges from 1/16\" for Flat sheets to 1/2\" for the deeper Dimensionals. <br/><br/>FLAT sheets come in 38 varieties:<br/> 12 SOLIDS such as \"White Pages\", \"Ledger\", and \"Newsprint\"<br/> 20 MIXES - LIQUID &amp; PUREE such as \"Crumpled Concepts\", \"Passport\" and \"Calendar\"<br/> 6 METALLICS such as \"Wedding Invite\", \"Carbon Copy\" and \"Chocolate Wrapper\"<br/><br/>DIMENSIONAL sheets come in 12 standard patterns with articulated surfaces that create a three-dimensional shadowed effect. Each pattern is available in any solid, mix or metallic color. Patterns include linear options such as \"V-Groove\", \"Wide Wale\" and \"Curtain\" and geometric options such as \"Weave\", \"Bad Tile Job and \"Origami\".<br/><br/>All products are available with 5 different finish levels: unfinished, matte, satin, semi-gloss and gloss.<br/><br/>Archoterra is completely customizable with respect to color, additives and patterns. Almost any custom color can be achieved with a variation in blends of raw materials and by adding natural pigments. Unique aesthetics can be achieved with additives such as mica-chip, natural fibers, and other organic materials. Any custom Dimensional pattern can be created, giving the designer or end-user creative freedom.<br/><br/>In contrast to other architectural surfaces on the market, Archoterra is lightweight, easy to cut and install with basic tools and does not require extensive backing and/or substrate as would other panels (MDF, gypsum, metal, resin), tile or stone. Shipping, handling and installation are therefore easier and more affordable. Sheets can be adhered to many different substrates or wall surfaces using wallpaper adhesive. When installed over type-X gyp board, Archoterra has a Class A fire rating. Seams are extremely minimal between sheets and the Dimensionals are designed for a continuous pattern both vertically and horizontally.<br/><br/>As an alternative to the 4'x8' sheets, Archoterra offers a wet mix that can be directly applied onto a surface in the field for a monolithic and seamless installation. The Archoterra wet mix can form to compound curves, angled surfaces and other irregular and unusual conditions.",
"id": "8370",
"product_name": "Archoterra",
"video_url": ""
}