{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8407",
"category": "Product > wall covering: paper",
"company_name": "Juju Papers",
"company_url": "www.jujupapers.com",
"description_html": "Juju Papers, the Portland, Oregon artisanal wallpaper studio helmed by artist Avery Thatcher, introduces Graffito, a wallpaper collection based on the theme of mark-making. The new series is simultaneously whimsical and glamorous, featuring abstract runes, signs and symbols rendered in sumptuous metallic colors.<br/><br/>The eco-friendly, hand-screenprinted papers are made in small batches and are customizable, and intended for residential, hospitality and workspace. <br/><br/>Thatcher notes, “Graffito explores the simple power of mark-making, tracing all the way back to those who scratched pictograms on walls, caves and bones. The patterns in the collection are united by their glyphic, graphic qualities: gestural, non-fussy abstractions of such varied inspirations as handwriting, a star-lit sky or masonry wall.”<br/><br/>Thatcher’s signature impact and surprise comes from the collision of humble line drawings with her deluxe metallic inks. The glossy gold, gunmetal and diamond finishes add a layer of elegance to the understated imagery.<br/><br/>Four patterns in a total of fifteen colorways:<br/><br/>Bomba: improvisational composition of lively scribbles, dashes, zig zags, waves, and scrawling lines. Thatcher took her cues from handwritten signatures, the ultimate individual mark-making. Five two-tone metallic colorways: Gold on Cream, Gold on Charcoal, Diamonds and Pearls on Cream, Gunmetal on Navy, Gunmetal on Blush, Gunmetal on Cream.<br/><br/>The Pearl: eccentrically-drawn and arrayed shapes abstract a stone mason’s hand-constructed wall. Four two-tone metallic colorways: Gold on Cream, Gold on Charcoal, Diamonds and Pearls on Cream, Gunmetal on Blush. <br/><br/>Pavlova: delicate overlapping curves, arcs and bends. Named for the Russian ballerina, famous for her sylphlike appearance, grace of movement and expressive nature. Three duo-tone metallic colorways: Gunmetal on Cream, Diamonds and Pearls on Cream, Gold on Cream. <br/><br/>Dusk: minutely-scaled squares and rectangles imprecisely scattered; they appear animated, as sparkling stars or glitter in a rock quarry. Two two-tone metallic colorways: Gold on Cream, Gold on Charcoal.<br/><br/>Sustainable materials. The Graffito collection of hand-printed wallpapers is made with non-VOC water-based inks, printed on sustainably harvested pulp paper with a natural clay coating. The collection is also available in a variety of Type II commercial-grade options including Mylar, Terralon Smooth and Smooth Vinyl (all low VOC). Terralon Smooth is a PVC-free product made with polyester/natural fiber technology containing over 31% recycled materials.<br/><br/>Customizable. The studio offers bespoke services, and all papers may be specified in custom colors.<br/><br/>Juju’s signature style combines the informal look of outsider art with an elegant and approachable touch, all marked by sophisticated craftsmanship and unparalleled quality.",
"id": "8407",
"product_name": "Graffito Collection",
"video_url": ""
}