{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8411",
"category": "Product > seating: contract/lounge",
"company_name": "Allsteel",
"company_url": "www.allsteeloffice.com",
"description_html": "The Vicinity Collection from Allsteel is a comprehensive portfolio of seating and coordinating tables for the evolvingcafé, multipurpose spaces and other common areas. Developed in partnership with IDa Design,<br/>Vicinity is part of Allsteel’s Gather™ collection of solutions for today’s collaborative<br/>workplace. <br/><br/>The Vicinity Lounge by Allsteel brings a clean-lined aesthetic and light strength in a low, comfortable, lounge chair application. Comprising a partially or fully upholstered shell cradled on a tubular steel base, the lounge allows for a variety of postures, from sitting upright to work with a laptop to slouching down and stretching out in a thoroughly relaxed manner. Created in partnership with Mitch Bakker of IDa Design, the lounge was designed to fit into both reception and/or collaborative office spaces. Featuring fully upholstered, upholstered with contrasting welt, and plywood back options, the Vicinity Lounge brings flexibility, strength and style to workplaces or gathering spaces. Because it is easy to move and offers so many different looks and sitting modes, the lounge can be used individually or in group applications, from the casual to the more structured, and in a diverse range of settings. <br/><br/>The lounge is available in seven base finishes and a choice of six shell veneer options for the seat, including beech, walnut, natural or gray rift oak and a variety of standard or COM upholstered fabrics. <br/><br/>The product’s primary materials are plywood, steel and upholstery. It is comprised of a partially or fully upholstered plywood-backed shell cradled on a tubular steel base, and is available in seven base finishes: Brilliant White, Chrome, Silver, Pyrite, Bullseye, Flint and Black. Other customizations options include a wide variety of standard or COM upholstery fabrics and six shell veneer options including beech, walnut and natural or gray rift oak.",
"id": "8411",
"product_name": "Vicinity Lounge/Gather Collection",
"video_url": ""
}