{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8414",
"category": "Product > seating: contract/guest",
"company_name": "Allsteel",
"company_url": "www.allsteeloffice.com",
"description_html": "The Retreat Collection from Allsteel is a family of upholstered, space-defining lounges that works to solve the<br/>problem of underutilized social and collaborative settings. Designed by Niels Bendtsen of<br/>Bendtsen Design Associates, the Retreat portfolio combines Bendtsen’s expertise in successful<br/>residential design with Allsteel’s understanding of real workplace issues.<br/><br/>Retreat lounges—a wing-back, a high-back, a low-back and an ottoman—work to solve the<br/>challenge of underutilized social and collaborative areas. The Retreat lounge has a refined, residential look, thanks to Bendtsen’s long experience creating timeless pieces in the category. But drawing on its office-practice and ergonomics expertise, Allsteel has made the chair’s geometry, size and scale ideal for comfortable work. <br/><br/>Used in multiples, Retreat provides small working groups with an equivalent sense of defined<br/>private space where collaborative tasks requiring focus can be accomplished in comfort. The<br/>swivel base allows individuals to engage or disengage with others in the team at will, while the<br/>standard return-to-center mechanism means that after use, any arrangement of seats is left neatly<br/>aligned ready for the next occupants. Other base options include free swivel and glides.<br/>Lightweight and easy to move, Retreat’s coordinating family of wing-back, high-back, low-back<br/>and ottoman options not only allows for many possible applications—a four-pack grouping of<br/>wing backs for optimum space definition; a side-by-side pairing of swivel low backs for a more<br/>open feel; a wing back and ottoman for a feet-up, individual retreat, and more—but also<br/>maintains a consistent aesthetic across the workplace. <br/><br/>Allsteel worked closely with its clients on the geometry and scale of the lounges to best support active work while maintaining a more residential feeling of style and comfort. “The organic-inspired silhouette of Retreat’s three lounges and corresponding ottoman is refined but approachable,” said designer Niels Bendtsen. “The collection offers designers and architects the opportunity to create quietly distinctive environments that combine inviting<br/>aesthetics with work-friendly functionality. And because the pieces are compact, they can also be<br/>set along windows or in corridors and other underutilized areas, maximizing available space for<br/>offices.”",
"id": "8414",
"product_name": "Retreat Collection",
"video_url": ""
}