{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8424",
"category": "Product > seating: contract/task",
"company_name": "Nightingale Corporation",
"company_url": "http://nightingalechairs.com/",
"description_html": "Combining functionality with a simple but striking design, the IC2 series is redefining ergonomic and comfort standards. This attractive, lightweight series incorporates a high level of engineering to enhance the user experience and adapt to the evolving modern workspace. This intelligent seating line was designed to address the growing importance and value of designing professional workspaces that enhance comfort, health, and individual well being. <br/><br/> Adapting to the new trends in office interior design, this seating line appeals to any modern workspace. Advancing technology has produced smaller, faster devices allow for a smaller footprint for electronics per workstation. Consequently, the amount of square footage per desk is shrinking and therefore designers are incorporating new ideas such as desk sharing, free desking, and benching. As the desire for assigned workspace fades, the need for adjustability and flexibility is increasing. The IC2 recognizes and addresses this growing demand by providing an infinite number of configurations and adjustments. The durable 4D armrests are height and width-adjustable with lockable swivel and arm-pad adjustment. The contoured polyurethane lumbar support pad can be easily adjusted up/down and in/out for personalized comfort and ergonomic back support. The optional headrest pivots in/out and adjusts up/down on a contoured axis. The IC2 can accommodate the diverse workforce regardless of size, posture or work requirements with a plethora of options, configurations, and adjustments.<br/><br/> Achieving new levels of balance, flexibility, and performance through ergonomic innovations that provide total back support and respond to every movement. The lightweight design perfectly balances form with function, providing an exceptionally smooth ride. Our NEBULA™ non-see-through mesh seat and back enables essential air circulation while providing the perfect balance of comfort and support. <br/><br/> The series features our patented Galileo mechanism; a slow release, pneumatically assisted, infinite tilt lock, synchronous mechanism, featuring pneumatic height adjustment and easy to use front facing seat / back tension control. Infusing technology with wellness initiatives provides the perfect working chair for the modern workplace. <br/><br/> Not only is this series a product of high levels of engineering, it also represents an important environmental initiative. This product is over 96% recyclable with 40% less weight and material than other comparable chair products. Additionally, all of Nightingale's products are packaged using 98% recycled paper content primarily sourced from post-consumer waste. <br/><br/> Admired for the aesthetics, appreciated for the ergonomics. The IC2 series is a truly notable innovation in office seating. <br/><br/>ABOUT NIGHTINGALE<br/>Founded in 1928, Nightingale is a leading office seating manufacturing company in <br/>Canada with a growing global presence. Premium quality products are hand-assembled in our <br/>leading-edge facility in Mississauga. Our commitment to comfort, quality, and innovation has <br/>driven our mission to be a global leader in the office seating manufacturing industry.",
"id": "8424",
"product_name": "IC2",
"video_url": "www.youtube.com/watch?v=1S4UUG0LqXI"
}