{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8444",
"category": "Product > lighting: floor",
"company_name": "BOVER BARCELONA LIGHTS",
"company_url": "https://www.bover.es/",
"description_html": "Cornet has a personality strongly rooted in nature. A lamp that puts smiles in the faces of those who enjoy it. Its lines are harmonious and organic; it brightens the space it is in and it blends in with nature where there are no straight lines.<br/><br/>It is a lamp made of very high-density polyurethane, which is a very hard and resistant material that is perfect for public spaces. But the Cornet's use is very versatile. It can provide direct lighting like a bollard or more extensive lighting for illuminating larger surfaces. The Cornet lamp family works in the connectivity of spaces; a value that Alex Fernández Camps always upholds. It is mainly used as a bollard lamp but can quickly connect with a wider reality: interior wall lamps, or the post version for intermediate spaces. In all of its designs, Cornet includes a dimmable LED source that distributes light through the lamp's undulating layers, creating an atmosphere that is natural, slightly broken, but never dominant. <br/><br/>Cornet is a highly technical project, yet full of life. One of the most interesting moments occurred during the working process when Alex was surprised to discover that the Cornet's lines breathed the organic functionality of Gaudí's buildings, which he had visited as a boy with his father. But the coincidences did not stop there; his full name was Antoni Gaudí i Cornet, and Alex's studio is on Calle Cornet i Más (the engineer who made the metal structures for some of the famous Barcelona markets). An entirely magical crossing of lines involved in the history of this unique Bover lamp made in Barcelona.<br/><br/>In the words of Alex Fernández Camps: “Cornet surprised me during the process, and still amazes me every time I see it. The projects are generous with those who are a part of them, always creating experiences to remember. Especially Cornet.”",
"id": "8444",
"product_name": "Cornet B/01",
"video_url": ""
}