{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8455",
"category": "Product > lighting: pendant (single bulb)",
"company_name": "Axolight",
"company_url": "http://www.axolightusa.com/usa/en_GB",
"description_html": "Austrian designer Rainer Mutsch designs Orchid for Axolight, a collection of lamps with two separate yet complementary souls: one outer – that of nature, exuded by its flower shaped diffuser and its rod; the other, more hidden, is high-tech with avant-garde LED technology.<br/><br/>Orchid is a mix of emotions and technology stripped to the essentials.<br/><br/>Rainer Mutsch explains how these souls have merged in Orchid: \"As a designer, I feel that nature is a major source of inspiration. In Orchid’s case I was studying how buds are connected to stems: and that’s what sparked the idea to develop a multidirectional floor lamp that could include direct lighting and diffused lighting in a single item. For the shape of the diffuser I was inspired by the funnel shape of the flower; I’m fascinated by how the flower seems relatively fragile near the stem and how then it reveals all its beauty when it blooms. Experimenting with these shapes I began sketching out a new diffuser, which thanks to its shape is capable of visualising the spread of the light.”<br/><br/>The LED technology is the second key factor in the design. The shape of the diffuser, made out of aluminium, prevents overheating, thus ensuring maximum duration of the light source. The outcome is a compact and efficient diffuser that couldn’t be possible with an incandescent lamp.<br/><br/>Including two suspension lamps, a floor lamp, a wall lamp and a ceiling lamp, Orchid comes in white or sand finish. It is so sculpturesque that it takes centre stage in the space even when turned off and stands out the most especially when a number of lamps are used in combination. Precisely thanks to its versatility, it works both in residential settings and in contract projects of a larger scope.",
"id": "8455",
"product_name": "Orchid",
"video_url": ""
}