{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8462",
"category": "Product > hardware",
"company_name": "Rocky Mountain Hardware",
"company_url": "www.rockymountainhardware.com",
"description_html": "“Less is more” has long been a minimalist design principle, and it’s one that Rocky Mountain Hardware has recently put into practice, creating a collection of door sets reflective of the aesthetic. “Edge” is the new arrival, distinguished by an escutcheon that measures 2 inches wide vs. the standard 2.5-inch. This slimmer, narrower style adds a more contemporary choice to Rocky Mountain’s swelling portfolio of products, and answers the call from architect and interior designer clients for hardware that has a smaller dimension . With the launch of “Edge” also come two new textured finishes exclusive to the series: Wire is a tactile as well as visual tease, with a tangle of lines enwrapping the surface; and Moonscape has a fluidity that’s frozen in place, created by a bronze over pour in production and resulting in an intriguing motif. In addition to these edgier treatments, “Edge” is offered in four other texture options that have long been in Rocky Mountain’s lineup along with a choice of 10 high quality finishes that are signatures of the brand’s art-bronze construction. Ideal for residential as well as commercial projects, the “Edge” group includes a complete offering of all door hardware functions—from entry to interior and even sliding. From the company’s inception, customization has been a core tenet, and it’s especially applicable with “Edge.” Architects and interior designers can specify their style of lever to match with the “Edge” escutcheon plate, plus propose individualized adaptions and modifications to satisfy a client’s tastes and needs. Nickum suggested one of the optimum ways to begin the selection process is to visit the company’s “Design Your Own” digital tool on its website, an easily navigable program for mixing and matching components and deciding choices.",
"id": "8462",
"product_name": "Edge Collection",
"video_url": "http://www.rockymountainhardware.com/about/our-process"
}