{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8484",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "J+J Flooring Group",
"company_url": "http://www.jjflooringgroup.com/shift/",
"description_html": "Shift magazine is a publication from J+J Flooring Group designed to spark innovative and inspiring out-of-the-box design perspectives in commercial flooring applications using the J+J product portfolio. Shift embraces the idea that every floor installation is a blank canvas from which to create a distinct design and broaden perspectives. Shift explores conceptual approaches using a progressive combination of pattern, color and texture. With its focus on design and inspiration, the publication features artistically intriguing images that capture imagination and possibility. Gracefully integrating J+J product and installation configuration options alongside thought-provoking photo vignettes, Shift is at once both a practical resource and an inspirational guide. <br/><br/>New editions of Shift are published throughout the year and each include a series of exploratory concepts which will shift perspectives to provide new ideas in the application of commercial floor covering. <br/><br/>In Volume one of “Shift,” “Highlight” explores the utilization of thoughtfully placed color accents to create a memorable design them, “Sync” artfully shows how function and flair can be achieved by pairing relevant floor types within a singular space and, “Fresh” reveals new perspectives on merging patterns with color create intentional focus on space, function and direction. <br/><br/>The second volume of “Shift”, titled Hyperbole, presents the striking splendor of exaggerated color and creativity, bold decisions and beautiful statements. Embracing the idea that exaggeration in the right moment and space perhaps isn’t exaggeration at all, this volume of “Shift” takes on an inspiration of perfect overstatements, extravagance of pattern and texture, tone and color, movement and emotion. Over and over, this volume of “Shift” asks the question: is too much ever too much?<br/><br/>Volume 3, titled \"Simpatico\", will make its debut in October 2017. <br/><br/>In addition to the printed Shift publications, J+J has implemented a Shift visualizer tool in which designers can view featured Shift flooring designs in room scenes, download and share images and easily order packaged samples of their favorite shift palettes.",
"id": "8484",
"product_name": "Shift",
"video_url": ""
}