{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8528",
"category": "Product > flooring: hard",
"company_name": "Siena USA",
"company_url": "www.sienausa.com",
"description_html": "Reclaimed Wood addresses the rapidly growing, repurposed trend that compliments any architectural style. Featuring a beautiful variety of authentically harvested wood grains sourced from turn-of-the-century barns in western Pennsylvania, to textile mills in Boston, and down to centuries old lumber yards in West Virginia, Reclaimed Wood reveals a striking patina from its previous incarnations. Every plank is uniquely characterized in wear and appearance, varying from knots and nail holes to saw marks and faded grains. SIENA Reclaimed Wood is not only naturally beautiful; but, reveals its history for truly authentic wood floors and walls.<br/><br/>SIENA Reclaimed Wood is offered in three distinct looks: Rugged, Smooth, and Original Surface. The Rugged floor options retain all of the natural character inherent in the repurposed wood. Nail holes and dramatic saw marks bring out the personality of the material in its imperfections. Smooth flooring is achieved by planning the original surface, creating a more even surface, while retaining the inherent imperfections of reclaimed wood, then using six different finishes, each highlighting and emphasizing different aspects in the wood tones. The Wallcollection features the Original Surface Barnwood as well as three additional colors in faded paint, paying homage to the very barns from which the wood was harvested.<br/><br/>Benefits and Features:<br/>• All wood is 100% post-consumer material, reclaimed from sources throughout the Eastern United States<br/>• Species is Oak for floors, mixed hard and softwoods for walls<br/>• Janka Hardness Score is approximately 1300 for floors<br/>• Variety of smokes and oiled finishes to bring out the character in the wood<br/>• Each board will vary in both size and character, effortlessly showcasing a natural look<br/>• Natural imperfections will hide new wear as the product ages<br/>• Solid hardwood construction for greater tolerance to Relative Humidity spans • Made to order in the Eastern United States<br/>• Install glue down or nail/staple<br/><br/>With more and more wood-appearance patterns showing up in resilient flooring, SIENA’S Reclaimed Wood represents a genuine response towards true natural beauty in wood, highlighting rather than de-emphasizing variation and imperfection. SIENA’S Reclaimed Wood provides a stand-out complement of rugged durability to SIENA’S existing sleek and sophisticated aesthetic. Contrasting the hand-hewn visuals with the contemporary corporate offerings by SIENA creates a modern yet classic tone that SIENA is excited to bring to the market.",
"id": "8528",
"product_name": "Reclaimed Wood",
"video_url": ""
}