{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8542",
"category": "Product > furniture: residential/occasional tables",
"company_name": "Rottet Collection",
"company_url": "www.rottetcollection.com",
"description_html": "One of the most celebrated interior architects in the world today, Lauren Rottet has designed stylish offices for Goldman Sachs, Disney, GE and a host of other companies; interiors for such renowned hospitality brands as St. Regis, Marriott and the Four Seasons Hotels and numerous residential projects, including the Central Park Tower in New York City, which is slated to be the tallest, most exclusive residential building in the U.S. when it is completed. <br/><br/>Her new furniture offerings incorporate Rottet’s love of architecture and detail and reflect her passion for creating spaces and objects that impart kinetic energy, visually enlivening each environment. <br/> <br/>The Dichroic Table uses one of the oldest materials -- glass -- in unexpected ways and to beautiful effect. It features sheets of glass with micro-layers of metal oxide that refract light into multiple hues. At 13\"L x 13\"W x 18.5\"H, it is extremely structural and minimal in profile, working beautifully as a side table in any interior. \"I have worked for more than 20 years with dichroic glass,\" says Rottet. Driven by the goal to create a table that looks different from every angle, the Dichroic Table explores the relationship between lighting, color, location and reflection. It is a signature piece for its simplicity and dynamic beauty.<br/> <br/>The frame of the table is stainless steel, but it can also come in bronze. The dichroic glass itself is composed of laminated glass with a layer of clear and a layer of dichroic glass. Glass to metal connections utilize newer technology machines that secure the hold better than before. The optic nature of the dichroic glass is a result of multiple ultra-thin layers of different metals (such as gold or silver); oxides of such metals as titanium, chromium, aluminum, zirconium, magnesium or silica which are vaporized by an electron beam in an advanced vacuum chamber. The vapor then condenses on the surface of the glass in the form of a crystal structure, which is as durable as the glass surface and fully integrated.",
"id": "8542",
"product_name": "Dichroic Table",
"video_url": ""
}