{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8568",
"category": "Product > (NEW) tabletop",
"company_name": "notNeutral",
"company_url": "https://www.notneutral.com/",
"description_html": "The CALA teaware collection awakens the senses and elevates the experience of steeping, serving, and drinking tea. The collection is comprised of a modern porcelain teapot, Asian inspired teacups in two sizes, and a striking Western-style teacup and saucer. Each piece is designed with technical precision to enhance the tea steeping and tasting experience at a visceral level. The name of the collection, CALA, is inspired by the Calla Lily which, when in bloom, resembles the gracefully flared profiles of the pieces. <br/><br/>The CALA teapot is engineered to steep and serve the perfect pot of tea. The handle is subtly sloped downward to provide optimal balance as the tea is poured, requiring only a slight rotation of the wrist. The asymmetrical hip and wide body allow for uniform steeping. The spout is angled to pour tea from the middle of the pot delivering the most evenly extracted tea in every cup.<br/><br/>Inspired by traditional Chinese Gaiwan cups, the CALA tasting cups are ideal vessels for tasting delicate teas. The delicately flared lip distributes the beverage broadly over the palate for an enhanced tasting experience. The wide mouth allows the surface of the beverage to cool quickly for optimal tasting, and allows the aroma to float across the surface of the beverage to the lips as one sips. The handless profile of the cup is elegant and intuitive. When the vessel is comfortable to touch, the beverage is ready to drink. There is no need for a handle as the cup balances easily between thumb and index finger. <br/><br/>The CALA teacup adapts these technical principles in a modern interpretation of the traditional English teacup. CALA was designed for a fuller and more nuanced tasting experience. CALA is dishwasher and microwave safe and durable enough for home and commercial use.",
"id": "8568",
"product_name": "CALA Teaware",
"video_url": ""
}