{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8572",
"category": "Product > flooring: carpet/rugs",
"company_name": "Peace Industry",
"company_url": "http://www.peaceindustry.com/",
"description_html": "Peace Industry presents four new designer collaborations that explore ancient felt making techniques in new and innovative ways. All four collaborations focus on experimentation with new processes and seek to expand the technical vocabulary of felt rug making.<br/><br/>The Alison Damonte collaboration takes inspiration from minimalist, abstract painters, like Frank Stella and Sol Lewitt. Alison is a San Francisco based interior designer and her designs introduces the fusion of two geometric forms that overlap to produce unconventional rug shapes, focusing on color, geometry, and the play between hard and blurry lines. This technique makes the rugs fully reversible adding usability and durability.<br/><br/>The Disc Interiors collaboration explores process and texture in a minimal and earthy way, with color palettes inspired by antique Japanese textiles. Their designs introduces the use of fringe and felted-in yarns, to create wabi-sabi linear patterns. Felting two colors in one layer, another new technique,enhances the double-sided feature of felt rugs.<br/><br/>The Raha Raissnia collaboration is based on details from two of her oil paintings. Raha is a NY based painter, experimental film maker, and performance artist. Raha's designs introduces a raw and unstructured edge which has a lower profile, perfect for both commercial and residential spaces. In the spirit of Raha’s paintings and hand-made films the collection will only be offered in black and white.<br/><br/>Hinterland is a furniture manufacturer based in Vancouver, BC, led by artist/designer, builder Riley McFerrin. The Hinterland designs take a post-modern turn with Memphis-deco inspired geometric shapes floating on<br/>a pale gray field. Accents like a radius curve and asymmetrically applied fringe add playful details.",
"id": "8572",
"product_name": "Peace Industry Designer Rug Collection",
"video_url": ""
}