{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8641",
"category": "Product > bath: fittings",
"company_name": "Kallista",
"company_url": "www.kallista.com",
"description_html": "Script Decorative, one of the latest collections from KALLISTA articulates its sense of style and fashion, to live artfully – the foundation upon which KALLISTA has built its brand. Traditional in character, modern by design, Script Decorative delivers a chic bathroom choice of sophistication and impeccable taste. Inspired by the heralded Gilded Age of 19th century America, Script embraces the aesthetic of this earlier time. A central component to the collection is its new faucet design. The faucet is offered in two styles – a low spout, a perfectly scaled design that features a slightly curved neck, and an arch spout, which true to its name, is a graceful, sweeping gooseneck. These timeless silhouettes have a soft flaring spout for a lush release of water, with stylized sides that soften as they taper along the faucet neck before terminating to the slightly stepped and inverted base. Also from the Script Decorative collection are the enameled decorative lever and cross handles in the shades of white Frost Wave, smoky Flannel Grey Wave, iridescent Celeste Blue Wave, and multi-colored Spring Rain. Reminiscent of the finely detailed enamel and cloisonné jewelry made popular in the 19th century Victorian era, the same techniques are used to design these artful handles. The mold design is hand-painted and fired four times to seal the colors and impart its glossy finish. The Frost Wave, Flannel Grey Wave, and Celeste Blue versions are decorated by a fluid series of lines that follow the handle’s form and a shimmering, shifting coloration that reflects light as it travels across the surface. Spring Rain is an intricate botanical and hummingbird design in a breathtaking color palette that naturally engages the eye. The silky soft finish of the handle adds to the overall sensual experience presented by these beautiful works of art.",
"id": "8641",
"product_name": "Script Decorative Sink Faucet, Arch Spout, Spring Rain Enamel Lever Handles",
"video_url": ""
}