{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8642",
"category": "Product > bath: fittings",
"company_name": "Kallista",
"company_url": "www.kallista.com",
"description_html": "KALLISTA Per Se collection of modern forms are sleek and sensuous, employing minimalist detail and chic couture-inspired styling. Paying homage to 1950s and 1960s design that moved away from the complex fluting or layered details of earlier periods, Per Se is an attractive alternative of fashionable understatement. <br/><br/>The Per Se Sink Faucet began as a sketch, and proved to be a challenging engineering feat. The in-house design features an ultra-thin, appealing rectangular shape that does not compromise quality by retaining standard wall thickness. It also incorporates an almost imperceptible valve to reduce the overall mass as much as possible. The faucet offers soft, quiet water delivery without splashing. The design is an environmentally sound choice for the home, meeting the flow, force and coverage EPA WaterSense® listed criteria with a 1.5 gpm laminar flow aerator. Kallista utilizes the finest valves in its faucets to ensure years of maintenance-free use. Featuring quarter-turn, diamond-hard washerless ceramic disc valves instead of conventional seat washers assure that the installation will be leak-free even in the hardest water conditions. The Per Se Sink Faucet is available in Polished Chrome, Nickel Silver, Black Nickel and Polished Gold KALLISTA living finishes, which naturally oxidize adding unique warmth and character to the form over time. <br/><br/>Flanking the Per Se Sink Faucet are the new Per Se Clear Crystal Knob Handles. A collaboration with Cristallerie Royale de Saint-Louis (Saint-Louis) of France creates this luxurious in-house designed option to the Per Se decorative handle selection. The one-of-a-kind Per Se Clear Crystal Knobs are handcrafted by Saint-Louis artisans, an appointment not easily achieved as each must apprentice for 10 years at a minimum before joining its illustrious team of master glass blowers and cutters. Renowned for its crystal works since the early 19th century, Saint-Louis continues to create rarified designs using the same Old World techniques of hand blowing and hand etching that have been passed down from generation to generation. The hand-cut and polished stacked crystal knobs reflect a pure beauty with a sparkling jewel-like appearance that complements the metal base offered in Polished Chrome, Nickel Silver, Black Nickel and Polished Gold KALLISTA living finishes.",
"id": "8642",
"product_name": "Per Se Sink Faucet, Low Spout, Saint-Louis Clear Crystal Knob Handles",
"video_url": ""
}