{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8649",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "ANN SACKS",
"company_url": "www.annsacks.com",
"description_html": "ANN SACKS collaborated with product designer, Israel-based Itai Bar-On, on a collection of handcrafted tiles exclusive to ANN SACKS In North America. Embodying the simple beauty of sculptural form, the intriguing, three-dimensional tiles are an artful expressions in scale, proportion and visual presentation.<br/><br/>Bar-On has always been intrigued by textures, shapes and colors, which has been employed to create his many varied products and separates Bar-On designs from the mainstream marketplace. His collection for ANN SACKS reflects his deep understanding of proportional space on the largest of scales, and his artistic talent of taking common materials and presenting them in an extraordinary new way. <br/><br/>The very nature of the concrete medium adds to the textural abandon of these tiles – smooth to the touch and softly honed, its surface randomly broken with pits and other marks occurring during the pouring and curing process. The Itai Bar-On Collection is designed for interior feature wall applications and can withstand high heat, making it a perfect choice for a fireplace surround. <br/><br/>The collection features three inventoried 8”x32” designs: Plain, a simple rectangular field tile; Spade, which lifts at one of tile’s four corners; and, Willow, which undulates out from the tile’s center. Additionally, the collection includes a made-to-order 16”x16” tile in paint and Kwa (shown), which lifts at one of the tile’s four corners. The completely handcrafted, in-stock designs are offered white, gray and black colorways. <br/><br/>There are many ways these designs can be installed and combined to create artistic patterns of the utmost beauty. Interspersed with the simplicity of the Plain design, Spade’s curved corner and Willow’s curved center designs can be lit from behind creating a dramatic statement in interior design.",
"id": "8649",
"product_name": "Itai Bar-on",
"video_url": ""
}