{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8654",
"category": "Product > wall covering: tile and stone",
"company_name": "ANN SACKS",
"company_url": "www.annsacks.com",
"description_html": "Kelly Wearstler named her fourth series with ANN SACKS, Gem, to express the ornamental, visual presence and time-honored, age old techniques required to create encaustic tiles. The choice to bring an encaustic collection into the ANN SACKS fold was never far from Wearstler’s mind from the very beginning of this partnership. “I admire the beauty of encaustic tile-making, its textural layers of clay and organic variations of color and pattern,” said Wearstler. “I have collected these tiles over the years and been inspired by their individuality and explore the historic technique and reinterpret it in an altogether modern way.”<br/><br/>The making of encaustic tiles is a time-honored, centuries’ old technique that combine a mixture of cement, sand, ground marble and pigments, then fired to seal the design. The pattern is not produced by the glaze but instead by combining two or more colors of the clay achieving an appearance of being an inlaid design, with a surface softly worn and timeless in appeal.<br/><br/> Elope features a layered solid color face broken by a series of curved lines that rake across the backdrop. “Elope is organic and fluid, classic with a modern mood,” explained Wearstler. “It celebrates the soulful anomalies of organic form.” The design is available in three colors: Ebony, a stark Black field with White rake; Azure, a deep Navy field with White rake; and, Oatmeal, a warm Taupe field with White rake.<br/><br/>The second tile is Swell, a seemingly simple striae design at first but actually quite complex in execution as each gently curved line varies in placement and thickness for a visually expressive tile. “Swell is a painterly stripe of radiating, evolving curvatures, its face defined in soft lineage with a relaxed playful geometry,” explained Wearstler. A two-shade color palette of Ebony, a stark Black field with White stripes; Azure, a deep Navy field with White stripes; and, Ivory, a creamy White field with Black stripes.<br/><br/>Rounding out Gem is Evoke, a remarkable pattern that mimics the swirl and shifting face of marble. “True touch of the hand detail with heavy brushstrokes defines Evoke,” said Wearstler. “It is a bold statement, full of movement and dual-tone line-work reminiscent of linocut prints. Evoke’s color palette is Ebony, a deep Black field with White marbling; Azure, a deep Navy field with White marbling; and, Ivory, a creamy White field with Black marbling.<br/><br/>Gem by Kelly Wearstler for ANN SACKS is available in 8”x8” tiles and appropriate for all indoor wall and flooring applications. Outdoor use is subject to climate and method of installation with special emphasis that in exterior applications the tiles may experience some fading over time due to UV exposure, especially in the darker color combinations. The precision sizing allows for exceptionally tight grout lines for an almost seamless end result. The tiles capture and retain heat naturally, the gentle warmth making it an excellent choice for radiant heat flooring.",
"id": "8654",
"product_name": "Gem by Kelly Wearstler",
"video_url": ""
}