{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8768",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "Móz Designs",
"company_url": "http://mozdesigns.com/",
"description_html": "The Laser Cut collection from Móz Designs redefines architectural metal solutions by expanding the possibilities of the dynamic aluminum material using cutting-edge tooling and technology. The new collection of Laser Cut patterns strike the perfect balance of texture and transparency, providing a unique design solution for both interior and exterior applications.<br/><br/>With the Laser Cut collection, designers can seamlessly divide spaces with a reflective natural<br/>metal or a bold colorful pattern using a durable and cost effective material solution. The versatile<br/>collection has many uses — from an interior partition or feature wall to a structural column cover or stunning exterior facade — the Laser Cut collection offers designers the ability to create their own unique applications for retail, corporate, healthcare, or hospitality projects. <br/><br/>The twelve standard patterns are laser cut out of solid-core 3/16” aluminum material in 4’ x 8’ standard sheet sizes with the ability to customize the size and shape of the metal cuts to control the amount of light and flow through the space. Designers can select from Móz’s extensive collection of colors and grains including gradients, metallics, neutrals and standard powder coatings to achieve their unique design goal.<br/><br/>All Móz metals and architectural products are 100% designed, sourced, and manufactured in the United States with LEED points available for recycled content. Optional add-ons include custom thicknesses, custom sizes, trims and framing for seams, corners, and edges in a color to match.",
"id": "8768",
"product_name": "Laser Cut",
"video_url": "https://www.youtube.com/watch?v=PRAHisbXbVo"
}