{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8770",
"category": "Product > acoustical applications",
"company_name": "Snowsound USA",
"company_url": "www.snowsoundusa.com",
"description_html": "DIESIS™ is a free-standing or hanging drape structure that acoustically corrects the nearby environment. <br/>Snowsound-Fiber acoustic structures derive their name and patented technology from the sound absorbing properties of freshly fallen snow. When one goes outside after a snowfall, it is extremely peaceful and quiet. The combination of the DIESIS drape structure, the air gaps created by the curves in the design, and the patented textile weave of the fabric work together to create similar effect to snowfall in reducing reverberation.<br/>Modern interiors often employ hard walls, floors and ceiling materials, creating unwanted reverberation. Snowsound-Fiber solutions can be designed into the project at the planning phase or post-occupancy, acoustically correcting spaces while adding visually interesting aesthetics.<br/>These innovative, patented acoustic structures can be creatively clustered and positioned to create dramatic, colorful designs. The structures are available in various designer colors.<br/>Due to rigorous R&amp;D and unique methodology in weaving the polyester threads into the finished textile, Snowsound-Fiber possesses acoustical properties unlike other fabrics on the market. The fabric is designed to primarily absorb mid-range and low-range frequencies while reflecting some high-range waves for proper acoustic balance. <br/>Snowsound-Fiber products are standard GreenGuard Gold certified for commercial use which helps acquiring credits in the LEED buildings assessment system, as well as meeting Class A Fire and Smoke safe per UL Standards. <br/>Installing DIESIS structures can correct acoustic reverberation in built environments, where retrofitting existing walls and ceilings is often not desirable. Rigid panels may not always be compatible with interior design visions, especially when the designer is looking for more free form fabric like textures. DIESIS would provide the designer with the ability to integrate more free form objects into the environment while making a significant impact in improving the sound quality of the space. <br/>These drape structures are constructed with a patented composition of interwoven, polyester, fire resistant fiber. The use of Silver ions in fiber threads make the finished material completely bacteriostatic. The Snowsound-Fiber textile can be easily removed from the structure and machine washed (140°F), ironed (max 240°F) and reattached without losing its fire-resistant and acoustic properties or its shape. DIESIS is built to last for many years with high-quality materials and a lifetime warranty for manufacturing defects. <br/>DIESIS uses patented Snowsound-Fiber technology that begins with unique polyester threads and a patented weave to create a completely unique textile. This yields a fabric that is much more acoustically effective in absorbing sound than other polyester fabrics on the market. DIESIS as an object is innovative as it leverages the Snowsound-Fiber textile with precise ratios of air gaps between layers of fabric, which were scientifically calculated to achieve comparable 1.0 NRC sound absorption to traditional Snowsound panels. Designers are requesting thinner ways and lighter ways to address the acoustics of the space and were finding that standard fabrics are not working as acoustic solutions. Now an equal alternative to acoustic panels, Snowsound-Fiber offers a textile structure that is unmatched in absorbing performance, aesthetics, design flexibility, durability and ease of installation.",
"id": "8770",
"product_name": "DIESIS",
"video_url": "https://www.snowsoundusa.com/wp-content/uploads/2017/08/DIESIS_Product_Sheet_.pdf"
}