{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8778",
"category": "Product > kitchen: cabinetry",
"company_name": "Sensis Innovation Ltd",
"company_url": "https://www.sensisworld.com/en/signature/",
"description_html": "Sensis Signature consists of pushing the limit of storage efficiency or building extraordinary showcase for your collections. Our design team profiles and deeply studies your needs, on a lean and collaborative process. Capacity, materials, the overall concept is drafted to envisions every solutions as the only one that is ever possibly made.<br/>What makes a custom-made wine cellar a crucial advantage lies in the tremendous flexibility and variety in the choice of materials. Sensis climate technology experts constantly measure and deploy adequate solutions for solving project’s complexity. Sensis delivers custom wine cellars and cabinets that gives the ultimate control. This modular wine cellar in mocha oak wood The technology is seamlessly embedded and engineered to fine tune temperature of 12 degrees Celsius, humidity of 75% and airflow, meanwhile the head system helps monitoring and maintaining climate attributes to preserve and store rare wines in the best way. <br/>This modular wine cellar in mocha oak wood and black stainless steel is composed of different hanging pull out units and drawers to allow Master of Wine Jeannie Cho lee to store over 850 bottles in 4m2 surface. Completed with heated glass partitions and magnetic lock, the wine cellar features fitted American oak wood cabinets, scratch free stainless steel drawer and cabinets on pull-out runners. <br/>Sensis manufactures, develops and assembles every details of its custom solutions using sustainable friendly and chemical free raw materials. Fabrics, woods, metals, stones, ceramics, glass, an infinite spectrum of possibilities is getting into play and fits perfectly every corner of a whole. The unique masterpiece is installed and released after several steps from quality control and temperature variation record, to ensure safety and quality. The beginning of a new journey then belongs to every owners. Available in a variety of solutions and sizes for specific, individual customer requirements.",
"id": "8778",
"product_name": "Sensis Signature",
"video_url": "https://vimeo.com/234791065"
}