{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8787",
"category": "Product > textiles: contract",
"company_name": "Camira",
"company_url": "www.camirafabrics.com",
"description_html": "Global textile innovator, Camira, is combining the best that human and nature has to offer in its new fabric, Patina.<br/><br/>Patina is based on an intimate blend of wool and flax, which balances composition with construction and beauty with performance. It is the epitome of designing with nature with white flecks, created by the flax content, scattering across the surface of the fabric just as the flowers would appear in the fields from which it is grown. <br/>The true definition of Patina is a coating or film on a surface that has built up over time, like rust that develops on metal. For this fabric Camira has expanded the definition to cover all pattern in nature around us. <br/><br/>Patina is inspired by Camira’s trend forecast, Evolution: Global Trend Directions 2017/18, specifically a trend called Habitat which explores human impact and the wellbeing of all things in our environment. Using the colors, patterns and textures that nature’s different temperaments reveal and combining this with the skills, design and insight of man, Camira has developed a fabric which demonstrates the result of these two environments working together. <br/><br/>Camira’s designer of Patina, Hayley Barrett, commented: “Only by taking a deep breath and slowing down do we become aware of our surroundings and the Pattern in Nature is revealed to us. This is the overarching theme behind the development of Patina – having the ability to take in the beauty of the natural environment, stepping outside and using this to promote thought and new ideas. <br/><br/>“When developing the aesthetics of this fabric, we were keen to celebrate the natural beauty of flax and let it shine through. As well as look of the fabric, the inclusion of flax harnesses its natural ability to meet the higher level flammability standards without any chemical post treatment.”<br/><br/>Available in a charming palette of 43 colorways, Patina captures the landscape around us as well as featuring nourishing new shades to complement the wider Camira portfolio. Patina marks the ongoing evolution of Camira's bast fiber family of fabrics made from wool, nettle, hemp and flax.<br/><br/>Composition: 69% Wool, 22% Flax, 8% Polyamide, 1% Viscose<br/><br/>Abrasion: Patina meets heavy duty abrasion achieving ≥100,000 Martindale cycles.",
"id": "8787",
"product_name": "Patina",
"video_url": ""
}