{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8794",
"category": "Product > furniture: residential/occasional tables",
"company_name": "Plexi_Craft Quality Products Corp.",
"company_url": "https://www.plexi-craft.com/",
"description_html": "Plexi-Craft is proud to unveil its newest acrylic masterpiece, the Iceland Chess Table. <br/> <br/>The crisp, clean combination of a crystal-clear acrylic table, and a gleaming ultra-clear starphire glass top, is a sleek way for this unique chess table to make a stunning presence in any home. Material is sourced in the USA and it is of the highest optical clarity. There is simply nothing like this chess table in the world.<br/><br/>This full size 23” x 23” tournament chess board and pieces seemingly float on a frame of fine acrylic that has been peerlessly cut, glued and buffered by our expert team of NYC artisans. The entire table has the strength and solidarity of strong hard wood and yet the optical clarity of ice. <br/><br/>The tempered glass chess board with individually hand-crafted acrylic pieces is perfectly centered on a comfortable table and rests between two glistening tempered glass plates. The transparency and precision is so precise that you’ll believe the board itself is floating mid-air. <br/><br/>When you enter the room your vision will immediately be drawn to the boldly printed ebony checkered chess board and its stunning ebony chess pieces that face off against their ultimate adversaries, the clear-as-ice chess pieces. The ongoing ebony versus ice rivalry is staged in a calm, cool Islandic setting. <br/><br/>Underneath the ¼” thick glass chess board is a white sub-board of the exact same dimension that can be easily interchanged with clear glass depending on personal preference. <br/><br/>Each lustrous chess piece, from the humble pawn to the magnificent King, has been hand-cut and polished to perfection. At Plexi-Craft, everything touched by our artisans is worked to precision using the care of an old world watchmaker. That personal embrace of the material is why our craftsmen loved working on this masterpiece.<br/><br/>Lastly, the chess board can be easily lifted out and swapped with a solid white leather insert so the entire top is flush and the table can be utilized as a gorgeous clear console with leather wrap center. <br/><br/>Given its transparency the game table is a compliment to any living room decor. It can be tucked into a quiet nook for the most serious match, or it can be a stunning centerpiece display so all may appreciate its visual beauty. No matter if you are grandmaster or a beginner, this is the game table you have been waiting for. <br/><br/>Plexi-Craft is unique among custom acrylic furniture manufacturers having been located in NYC since the 1960’s. Over the years Plexi-Craft has become synonymous with precision, reliability and stretching creative boundaries. At any point in time our design team is collaborating with award-winning architects and interior designers to satisfy their equally accomplished and discriminating clientele. We’re as demanding on ourselves as your clients are with you. At Plexi-Craft every design becomes a masterpiece.",
"id": "8794",
"product_name": "Iceland Game Table",
"video_url": "https://youtu.be/IXv7bLjnHAI"
}