{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8803",
"category": "Product > seating: contract/guest",
"company_name": "Nightingale Corporation",
"company_url": "http://nightingalechairs.com/",
"description_html": "The OXO 6500 series is sleek, breathable and lightweight. This seating line offers beauty, performance, and unprecedented comfort in its class. The translucent ABLEX™ mesh back and seat is constructed from response elastic mesh. Designed for maximum comfort, support, and proper spinal alignment, this series is a contemporary design capable of enhancing any work environment. The lightweight stackable frame itself is strikingly attractive, sleek, modern, and durable. <br/> <br/> The OXO is a practical, versatile and economic seating solution that offers beauty, performance and unprecedented comfort. The sensible design combines strength and durability with slim, stylish and clean curvature. <br/> <br/> This seating line features a dynamic articulating back providing exceptional ergonomic back and lumbar support. The generous seat size accommodates users of every size and task while the waterfall shape is proven to reduce muscle fatigue. This ergonomic design gently slopes away from the legs minimizing pressure on the thighs, promoting good posture and blood flow. The seat is accentuated by the comfortable, polyurethane arm pads securing the user in a comfortable yet flexible position. <br/><br/> Our product is coated in a high impact epoxy powder coat, electrostatically applied for corrosion resistance. This process ultimately increases the quality of the product and extends its lifetime. <br/><br/> Not only is this series a product of high levels of engineering, it also represents an important environmental initiative. This product is over 89% recyclable and is packaged using 98% recycled paper content primarily sourced from post-consumer waste. <br/><br/>ABOUT NIGHTINGALE<br/>Founded in 1928, Nightingale is a leading office seating manufacturing company in <br/>Canada with a growing global presence. Premium quality products are hand-assembled in our <br/>leading-edge facility in Mississauga. Our commitment to comfort, quality, and innovation has <br/>driven our mission to be a global leader in the office seating manufacturing industry.",
"id": "8803",
"product_name": "OXO",
"video_url": "https://www.youtube.com/watch?v=nJzVbfXjVMY"
}