{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8804",
"category": "Product > seating: contract/lounge",
"company_name": "DARRAN Furniture",
"company_url": "www.darran.com",
"description_html": "With circular curves and ultimate modularity, DARRAN’s newest lounge collection “Bota” has blossomed as an optimal solution for shared spaces across collaborative work environments and a private zone for concentration.<br/><br/>Introduced at NeoCon 2017, Bota is an ever-growing lounge collection with the ability to function as a powered station, touchdown terminal, brief meeting place, personal focus nook and an overall hub of concourse. A lounge solution with standard provisions for integrated power, rear tables and privacy screens featuring signature stitching. The appearance and function of Bota is enhanced through carefully tailored details in the upholstery. A soft rise on each seat and fitted upholstery are used to define individual space. When viewed from above, the budding formation resembles a flower, inspiring the botanical collection name – Bota.<br/><br/>The core Bota Circlet component is a two-seat lounge, available in two radii. High and low back Circlets allow for either desk or counter height tables. Slim upholstered back privacy screens extend upward from lounge backs and provide an element of privacy while others work diligently on cantilevered rear tables. <br/> <br/>Bota Shell is composed of upholstered back and side privacy screens with a roof canopy, available in a single, double or triple seat module. Bota Shell offers privacy in the middle of lively common spaces. Side privacy screens resemble a petal shape allowing the roof canopy to inset above the seat for ease of use. While sitting inside Bota Shell a noticeable reduction in sound is realized creating a personal focus nook. Coordinating ottomans add color and vitality while providing additional seating.<br/> <br/>Bota offers freestanding components, including tables and a coat stand. Table tops are organically shaped with rounded corners supported by a steel column and disc plate base in metal finishes. Bota’s Coat Stand takes an elliptical form made from steel wires woven together. <br/><br/>Keith Melbourne’s acclaimed designs are clearly influenced by his diverse experiences, and seem to sit in a realm where engineering precision meets artistic creativity.<br/><br/>Keith studied engineering in England while working in the aerospace industry. He then moved into the international automotive industry and spent 15 years developing advanced engine and control system technology. While in the automotive industry he traveled around the world to test vehicles and manage large engineering projects. Keith Melbourne has not followed a typical path into furniture and product design.<br/><br/>Leaving his engineering career behind in search of a passion, Melbourne studied furniture design in the remote city of Perth, Western Australia. Immediately he discovered a new creative world that he loved.<br/><br/>He now lives and works, rather ironically, in Melbourne, Australia where he draws on a sophisticated knowledge of materials and manufacturing processes to develop his products. This allows him to create surprising forms that are also very manufacturable. Believing strongly in the importance of the designer/manufacturer relationship. He enjoys close collaboration with manufacturers, and their skilled workers, which allow him to develop his designs for the market.",
"id": "8804",
"product_name": "Bota",
"video_url": "https://www.youtube.com/watch?v=1hhub5UkOsU"
}