{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8809",
"category": "Product > furniture: contract/tables",
"company_name": "DARRAN Furniture",
"company_url": "www.darran.com",
"description_html": "DARRAN Furniture unveiled Diva Conference Tables at NeoCon 2017. More than a pretty face, look deeper to discover a host of brilliant design elements, each cleverly concealed within the solid Ash build and die cast aluminum components.<br/><br/>Diva was engineered using finite element analysis to create maximum strength using minimum material. The structural achievement of Diva allows tops to span up to 144 inches without the need for a center support leg. Eye-catching aesthetics are only part of Diva’s story. The innovative power system within Diva tables can be summed up in one word: unrivaled. Seamless Power and data are concealed without notice under the beautiful quartered Ash surface of the table. A system of cable clips and connectors run cords safely and cleanly around corners. Cable management is accessed by integrated undercarriage panels that easily slide from open to close. Solid wood legs feature a cavity that runs power to the floor allowing Diva to stand toe-to-toe (in high heels) with the most sophisticated and high-tech Conference Rooms. <br/><br/>Diva tables function beautifully almost anywhere; from private offices to team workstations to the Fortune 500 boardroom. Diva meeting tables come in square, rectangle and round shapes, and can seat anywhere from two to twenty-two comfortably!<br/><br/>Diva encourages work place health and posture by offering conference tables in standing height, keeping users alert and active, and ultimately more productive. Exceptionally stylish; reassuringly practical. Discover Diva, and her many hidden talents.<br/><br/>Diva was designed by ThinkingWorks Design Studio, a design team that takes curiosity to new heights, finding solutions to design exceptional furniture.",
"id": "8809",
"product_name": "Diva",
"video_url": "https://www.youtube.com/watch?v=oq6B_9e1N2I"
}