{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8817",
"category": "Product > furniture: contract/desking",
"company_name": "DARRAN Furniture",
"company_url": "www.darran.com",
"description_html": "DARRAN Furniture recently unveiled ThinkingQuietly, an innovative workstation solution to meet the growing challenge of reducing external noise, at NeoCon 2017. <br/><br/>In a lively setting, ThinkingQuietly’s range of acoustic furniture turns the volume down on peripheral sound. Acoustic engineers assisted in the design challenge of reducing noise in the open office, targeting the workstation itself. Advanced sound absorbent materials were used to provide noise comfort, while a stylish retro design fits perfectly in the modern office. The 4-person workstation with an acoustic umbrella provides up to 44% improvement over standard stations with screens.<br/><br/>ThinkingQuietly Workstations seat up to six users while maintaining a polished, well-analyzed design. Wire management for worksurface clamp mount power is concealed by central infill blocks that drop wires to a cable management tray. The cable tray is constructed of acoustical material concealing power and data, while reducing floor level noise. A solid oak Y-frame creates an overhead umbrella that traps sound as it naturally travels upward. <br/><br/>Unique accessories feature contemporary desk pads made of signature noise-cancelling acoustic material with optional integrated AirCharge power. Mobile briefcases offer storage and power that can be placed between units to partition individual users without subtracting from collaboration and communication. Integrated tasklights gives each user control over lighting, and ultimately their personal work environment.<br/><br/>Beautifully finished from the top to bottom ThinkingQuietly’s dynamic tables and workstations are an optimal choice for conference rooms, open offices and libraries where minimal noise is ideal. <br/><br/>ThinkingQuietly was designed by ThinkingWorks Design Studio, a design team that takes curiosity to new heights, finding solutions to design exceptional furniture. <br/><br/>“Above all, we are curious. Why curious? Because curiosity finds new ways.,” says Managing Director Dean Kuch. “It strives for novel ideas and seeks out better solutions. For the curious, the answers are out there, waiting to be found. At ThinkingWorks, this open-minded curiosity is what underpins our approach to furniture.”",
"id": "8817",
"product_name": "ThinkingQuietly",
"video_url": "https://www.youtube.com/watch?v=jPKkg9nuwBs"
}