{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8832",
"category": "Product > bath: accessories and hardware",
"company_name": "CARVART",
"company_url": "carvart.com",
"description_html": "For the past 20 years, CARVART has been a leading full-service architectural glass provider including products for the commercial bath market. In January 2016 we expanded our glass cubicles offering by announcing a US strategic partnership with Soema of Italy. Carvart by Soema brand which is a new, comprehensive line of high design, European-styled, commercial bath solutions. We have already completed successful installations across the US while many others are currently being specified, in production or getting installed at major airports, corporate facilities, hotels, restaurants and retail environments. <br/><br/>Soema, a leading worldwide supplier of Commercial Bath solutions, has gained prominent notoriety in Airports, Rest Stops, Health Clubs, Spas, Universities and Institutional facilities throughout Europe and the Middle East. Known for exceptional design, superior fit and finish and fine craftsmanship, all elements are poised well to appeal to facility managers looking for affordable, well-designed, state-of-the-art commercial bathroom solutions that include:<br/><br/>•\tglassBOX Partitions<br/>•\tstoneBOX Partitions<br/>•\tchplBOX Partitions<br/>•\tIntegrated Sink Modules<br/>•\tglassDOORS<br/>•\tglassLOCKERS<br/><br/>A key benefit of Carvart by Soema centers on higher level of design and innovation at a more moderate investment level. glassBOX has been designed to eliminate parts and pieces using offset hinges doors that simplifies the specification, design and installation of bathroom partitions. Integra is an Integrated Sink Module that incorporates all plumbing, electrical, blower motors, lighting and sink dispensers into a single modular structure making it far more easy to install while also being smart and more sanitary than conventional product. glassLOCKERS are a glass front storage in multiple configurations for both wet and dry applications that are both highly functional and beautiful. glassDOORS are complimentary accent products that round out the design of the commercial bath space with a consistent design for janitor closets or entry doors. This eco-friendly glass offering provides architects every possible necessity required for sanitary projects from a single-source providing a wide color offering, value engineering, installation flexibility, end user advantages and ease of maintenance. <br/><br/>CARVART by Soema addresses the combination of gender-neutrality, superior cleanability, premium styling, a better user experience and simplified project coordination issues better than any other commercial bath solution in the market. Product design performs equally well in both men and women’s rooms. Designers have a full color range of laminated, tempered glass that is resistant to scratches, cleaning detergents and atmospheric agents since all colored areas are between glass panels. The ecological approach is evident from the raw materials and ingredients used to create the glass panels, making the public areas more sanitary. Panel hardware is also anodized aluminum with a protective finish. Locker bodies have built-in slits ensuring adequate airflow for proper ventilation and drainage of any liquids and each is equipped with rubber gaskets throughout the length of each door to act as shock absorbers and reduce noise. And no longer do designers need to expend laborious hours looking to pull together multiple specialty suppliers. Carvart makes integrating commercial bath design into the overall facility design easier than ever before.",
"id": "8832",
"product_name": "Carvart by Soema",
"video_url": ""
}