{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8867",
"category": "Product > bath: fixtures",
"company_name": "Laufen Bathrooms AG",
"company_url": "www.laufen.com",
"description_html": "In the Kartell by Laufen collections design and technology find a dynamic balance, lending themselves to virtuoso interactions and subtle provocations, to produce unexpected flexible, versatile solutions. The products rely on a fresh, living language, surprising for its daring, always sustained by a concrete foundation based on research, experience and experimentation. An experimental approach that knows no boundaries: the architecture of its logic is in continuous evolution and manifested on all levels, from aesthetics to material and functional research, to exploration of the synergy between the various protagonists of the bathroom.<br/><br/>Behind all the creations of Kartell by Laufen there is a tenacious effort to intercept and respond to the widest range of needs of a variegated, multifaceted and international public, in search of innovative, efficient and emotionally engaging solutions. Thanks to this approach, Kartell by Laufen becomes a frequent protagonist of major contract projects all over the world, collaborating with leading architects at the highest levels. <br/><br/>Ludovica and Roberto Palomba have now imagined and designed three different geometric motifs, bringing new decorative and personalized options to the surfaces of the Kartell by Laufen column washstand, thanks to the application of a coloured film prior to the final process of glazing and firing. <br/><br/>But not only the possibilities for inidividuazlization is giving this set the reputation - it's also the material. Ceramic is one of the oldest man-made materials around, and consists entirely of naturally-occurring raw materials. Ceramic is 100% recyclable and can be added as ground material to the production process or used in other industries as a valuable raw material. The longevity and recyclability of materials is of critical importance for our environment.",
"id": "8867",
"product_name": "Floorstanding Washbasin with Decor / Kartell by Laufen",
"video_url": ""
}