{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8873",
"category": "Product > seating: contract/task",
"company_name": "Geiger",
"company_url": "www.geigerfurniture.com",
"description_html": "The result of a unique partnership between designer Mark Goetz and PostureFit® inventor and longtime Herman Miller seating advisor Dr. Brock Walker, the Taper Chair delivers a high-touch, high-comfort, high-performance experience, raising the bar for performance in executive seating. The chair was developed for Geiger.<br/><br/>“I wanted to design an incredibly comfortable chair that gives the personal fit of a custom-tailored suit, the support of the finest ergonomic chair, and the quality feel of a high-performance automobile seat,” says Goetz.<br/><br/>Dr. Walker is a former competitive skier and a specialist in design for human performance. His proprietary MEARS technology was developed to identify what the human body needs to be strong and comfortable, and then help a designer translate those needs into design requirements for seating that empowers the person sitting in the chair.<br/><br/>Every contour of Taper has a purpose. The complex contouring of the upholstered backrest focuses support in areas of the back that are important for musculoskeletal balance: the sacrum, or base of the spine, and the transition between the lumbar and thoracic spine. <br/><br/>By supporting these key areas, the chair’s backrest design encourages seated individuals to assume a more powerful seated posture: hips rotated forward, spine curved in a natural S-shape, chest open, shoulders back. <br/><br/>The seat of the Taper Chair uses an innovative suspension construction that adapts to the pelvis, so a person feels comfortably supported from the moment they sit down. While executive chairs traditionally feature padding, Goetz took Taper in the opposite direction. “The closer that we get to the human body and the needs of the human body, the less material we need to use,” he says. “The whole way we achieved comfort in this chair is to get very close to the human body, to the point where you can actually see evidence of where your body belongs,” in the chair. <br/><br/>The chair’s tilt—a modified version of Herman Miller’s most advanced tilt mechanism—delivers a balanced, controlled ride throughout the chair’s full range of recline.<br/><br/>It’s this seamless merger of design for human performance with Geiger’s core strength in quality construction and craft that makes the Taper Chair truly unique among executive chairs.",
"id": "8873",
"product_name": "Taper Chair",
"video_url": ""
}