{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8881",
"category": "Product > flooring: hard",
"company_name": "Metroflor Corporation",
"company_url": "http://www.aspectaflooring.com",
"description_html": "The Aspecta One Ornamental LVT flooring collection consists of three unique patterns that architects and designers can apply where they need exceptional interest and accent, without being overwhelmed by going through the entire custom design process. Building upon the existing Aspecta One design portfolio, three overlay motifs – Damask, Masquerade, and Malta -- offer a wide array of options depending upon the imagination and creativity of the designer. Aspecta One Ornamental designs can be created from existing, select inventory without limitation to create unique, custom layouts within timelines and budgets.<br/><br/>Evoking ancient cultures such as Oriental, Arabic and sub-Saharan, or architecture styles like Art Nouveau or Rococo, the Aspecta One Ornamentals create a welcome contrast to the clear design language of modern architecture and interiors. These overprint styles can be layered randomly on select Aspecta One plank and tile designs or all-over for a more dramatic effect.<br/><br/>The Aspecta One Ornamental collection is ideal for such commercial settings as Hospitality, Retail, Corporate, Education and common areas of healthcare, with all the benefits that only LVT provides: stunning design and embossings, coupled with easy care and maintenance. <br/><br/>The new Aspecta One Ornamental range expresses certain principles of Biophilic Design, which evokes aspects of nature that most impact and advance occupants’ health, fitness and wellbeing: a new framework for satisfying the need to experience nature in the built environment. <br/><br/>Here is a description of the aesthetic qualities of the three motifs/designs, which can be overprinted on select color tiles and woodgrain planks, and their Biophilic inspiration. <br/><br/>DAMASK: Inspired by heirloom Persian rugs handed down generation to generation, and the emerging “Rough Luxe” distressed motif found in specialty woven carpet, Damask delivers this high-end look in affordable LVT. BIOPHILIC DESIGN INSPIRATION: Botanical motifs, Integration of Place and Culture, Attraction and Beauty. <br/><br/>MASQUERADE – Inspired by boisterous ceramic tiles, Masquerade’s large medallion-like design translates well in large tile formats, combining modern concrete embossing and unicolors, which embrace each other in a refreshing, surprising way. With either a colorful or neutral base, Masquerade appears as either a positive version for a “painted” impression or a negative overprint on tile that creates the hard-edge effect of carving. Its unpredictability in shape and application is refreshing. BIOPHILIC DESIGN INSPIRATION: Biomorphic Shape, Integration of Parts to Wholes, Curiosity and Enticement.<br/><br/>MALTA – This abstract, Arabesque motif complements Aspecta One 4-ft. woodgrain planks with a Moorish influence found in Southern Europe. Malta works well with vintage, Mid-Century and contemporary interiors. BIOPHILIC DESIGN INSPIRATION: Botanical motifs; Age, Change and the Patina of Time; Sensory Variability and Complementary Contrasts.<br/><br/>Aspecta One Ornamental provides a 20-year limited commercial wear warranty with Metroflor’s new and improved ceramic bead finish. Its 21 Mil wear layer is topped with a Ceramic Bead finish for low maintenance and durability. On the sustainability front, the collection has received a Declare Label - a “nutrition label” equivalent for building products – and NSF/ANSI 332 Gold certification.",
"id": "8881",
"product_name": "Aspecta One Ornamental by Metroflor",
"video_url": "https://www.youtube.com/watch?v=sRU9Yos87xE&t=1s"
}