{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8889",
"category": "Product > kitchen: appliances",
"company_name": "Liebherr",
"company_url": "home.liebherr.com",
"description_html": "Liebherr Appliances, one of the world’s leading manufacturers of premium refrigeration for more than 60 years, introduces its HW 8000 fully integrated pantry-style 24-inch wine cabinet. The new 24-inch wine cabinet blends in beautifully with any kitchen cabinetry for the ultimate dream kitchen, in combination with Liebherr refrigerators and freezers. The wine cabinet panels can be customized to match cabinetry heights of 70-, 80-, or 84-inches. Up to 80 wine bottles are stored on sleek wooden shelves, while providing sophisticated wine presentation with an attractive labeling system. The well-organized interior is illuminated with cool LED lighting, which emit less heat and no UV radiation, preserving the best quality of stored wines. Available in stainless steel, black, and white glass, this piece is as functional as it is aesthetically pleasing. As a brand known for its innovation and sophisticated design, Liebherr’s HW 8000 offers advanced temperature stability, panel display, as well as other features.<br/><br/>The HW8000 is also the perfect product for wine connoisseurs who have a collection of wine that needs proper storage. Wine is very susceptible to deterioration over time if it is not stored at the correct temperature and the Liebherr HW8000 ensures red and white wines will be stored at the ideal temperature and preserved for as long as needed.<br/><br/>The engineering on the inside of a Liebherr appliance is every bit as sophisticated as the design on the outside. The HW 8000 features two different temperature zones to ensure that red and white wines are stored at the correct temperature. Interior features like SoftSystem automatically close the door, even when the door is fully loaded, and a safety thermostat ensures the wine cabinet never reaches temperatures lower than 32° F to prevent damage to the stored wines.<br/><br/>The new 24-inch wine cabinet blends in beautifully with any kitchen cabinetry for the ultimate dream kitchen, in combination with Liebherr refrigerators and freezers. The wine cabinet panels can be customized to match cabinetry heights of 70-, 80-, or 84-inches. Up to 80 wine bottles are stored on sleek wooden shelves, while providing sophisticated wine presentation with an attractive labeling system. The well-organized interior is illuminated with cool LED lighting, which emit lesser heat and no UV radiation, preserving the best quality of stored wines. Additionally, designed for today’s modern kitchen, the new 18-inch built-in wine unit, with matching wine accessory drawer, features TipOpen technology wherein the glass door is gently tapped to open the unit. Ensuring that the ideal air humidity does not escape the cabinet, the unit will self-close if the door is not opened fully within three seconds.",
"id": "8889",
"product_name": "HW8000 Wine Cabinet",
"video_url": ""
}