{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8899",
"category": "Product > lighting: pendant (single bulb)",
"company_name": "Philips Lighting",
"company_url": "http://www2.meethue.com/en-us",
"description_html": "Light is ubiquitous. It affects us from the moment we wake up, to the moment we go to bed. It helps shape our everyday experiences. Yet, many people give light little thought beyond flipping their existing switch for basic on/off illumination. <br/><br/>With the Philips Hue connected lighting system, consumers can do so much more with light. They can personalize their lighting to match their mood, support their activity or create their desired ambiance – at any moment of the day. <br/><br/>Over the last five years, the Philips Hue family of products has rapidly expanded; it includes bulbs, strips, spots, fixtures, lamps and controls. And the latest addition – the Philips Hue White Ambiance Cher Suspension fixture – continues to deliver the smart lighting system’s unprecedented versatility and promises to make homes smarter and lives easier.<br/><br/>With powerful light output (3000 lumens), the Cher pendant gives the perfect functional and mood lighting from a single source. The single LED panel is integrated with the Philips Hue White Ambiance technology, allowing you to select from among 50,000 shades of white light – from warm (2200K) white to cool (6500K) daylight. Change the light to: <br/>•\tShape your space whatever your style<br/>•\tMake rooms feel spacious and comfortable<br/>•\tSet the mood and atmosphere for any occasion<br/>•\tSupport different activities throughout the day, helping you wake up and energize, concentrate, read, relax and go to sleep naturally<br/><br/>The Cher pendant was designed around the light source so the light fully caters to people’s needs and lifestyles. For example, with the Cher pendant above your kitchen island or over a dining table, you can select a cool daylight scene for your morning coffee to energize for the day ahead, help your child focus on their homework with a bright white light and create a cozy ambiance for dinner under a warm light. <br/><br/>What also sets the fixture apart: <br/>•\tIt can easily fit anywhere in the home and work with any interior style.<br/>•\tThe black color represents the presence/absence of light and shows off each of those 50,000 white tones beautifully.<br/>•\tConsumers can control the light in a way that suits them best – via a smartphone or tablet app, a Hue wireless switch, a wearable device or hands-free with a voice platform (Amazon Alexa, Apple Siri or Google Home) or the Hue motion sensor. <br/><br/>Lighting is changing. Smart lighting that adapts to our every need is vital to pushing everyday interactions with and appreciation of light further. With the Philips Hue White Ambiance Cher pendant, consumers can enjoy the richest lighting experience and live their best lives at home.",
"id": "8899",
"product_name": "Philips Hue White Ambiance Cher Suspension Light",
"video_url": ""
}