{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8906",
"category": "Product > flooring: hard",
"company_name": "DuChâteau",
"company_url": "http://duchateau.com/",
"description_html": "Featuring LuxCor® innovative construction, DuChâteau Vinyl DeLuxe Grand Collection authors a new chapter in the story of our luxury resilient click flooring. This ultra-resistant vinyl flooring features a hardwearing ceramic-reinforced polyurethane finish and promises to perform year after year. The collection carries a 20-year residential warranty and a 10-year commercial warranty. <br/><br/>Vinyl DeLuxe Grand is a highly advanced floating luxury vinyl click floor with incredibly realistic and natural designs. Installation is simple and easy as always but through its construction and design, more functionality is gained for greater applicability. Because of its construction, telegraphing won’t be an issue with imperfect subflooring. Each antimicrobial plank features a rich varied tonality, bringing together fresh color and texture to resilient flooring.<br/><br/>Vinyl DeLuxe Grand Collection’s visual is achieved through advancements in manufacturing that use embossed in register designs with high variation patterning for a realistic look and feel. It utilizes a LuxCor® Engineered Construction, a synthetic vinyl composite core for a 100 percent waterproof, high performance, upscale floor. Paired with our attached HushWalk® underlayment, this flooring offers high shock and sound absorption. Additionally, it contributes to LEED® credits, exceeds the U.S. Toy and Safety Standard (ASTM F963) and is FloorScore® - Low-VOC certified.<br/><br/>LuxCor® represents the first engineered floating vinyl flooring for the brand and is an incredible step forward in design to achieving realistic expressions of wood flooring in a quality resilient product. It also incorporates a powerful combination of embossed in register technology with high-variation patterning to create a natural contoured finish that is not only unique with far less repetition, but must be both felt and seen to believe.",
"id": "8906",
"product_name": "DuChâteau, Vinyl DeLuxe Grand Collection",
"video_url": ""
}