{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8920",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "Chemetal",
"company_url": "www.chemetal.com",
"description_html": "Chemetal’s new Glowing Metals collection showcases the company’s commitment to beautiful and innovative metal designs and laminates. From warmer, richer metals to textured patterns and patinas, these 36 new designs are Chemetal’s largest product introduction ever. Some new additions include Polished and Brushed Bronzes, a light Champagne Brass, Antiqued Copper, Rose Gold and Blue Brushed Aluminum. Also anodized aluminums, HPL metals, printed metals, and patinas on aged copper and brass.<br/><br/>Chemetal “Glowing Metals” collection by product groups:<br/> <br/>New Classic Metals<br/>Chemetal has added 11 new Classic Metals, Chemetal’s most popular materials. New additions include Polished and Brushed Bronzes, a lighter Champagne Brass, Antiqued Copper, Rose Gold, Blue Brushed Aluminum, and embossed designs on mirror-like anodized aluminum with cool reflections. Classic Metals emulate the look of more expensive metals, in more affordable and easier to fabricate HPL and anodized aluminums. Quality is excellent, HPL metals are European quality- sourced from Germany, and anodized aluminums are made in the USA and contribute to LEED with up to 75% recycled content. Available in 4’ x 8’ and some 4’ x 10’ sheets, plus custom.<br/> <br/>Printed Metals<br/>Chemetal has added 8 new designs to its popular Printed Metals. These layered designs create great moods like aged brass and steel. Newer more modern patterned designs include modern whites and designer grid patterns. 4’ x 8’ sheets. Aluminum. Some designs are exterior rated.<br/> <br/>Chemetal Metal Patinas<br/>Chemetal makes many metal designs in house, brushing, aging and adding patina to metals. This includes aged coppers and brass and glowing oxidations on solid brass. Contributes to LEED. 2’ x 8’, 2’ x 10’ sheets, plus custom.<br/> <br/>HPL Metals<br/>HPL Metals from Chemetal offer embossed, textured metal designs with the installation ease of a laminate backer. New designs in copper, slate and vintage mesh are a great interior design choice. 4’ x 8’ sheets.<br/> <br/>Made in the USA<br/>Chemetal’s in house production has been on a tear the past few years, constantly producing aged aluminums and aged brass metal “moods.” Last year, the company doubled the size of its Easthampton, Massachusetts headquarters and plant, to over 64,000 square feet. <br/> <br/>LEED<br/>Aluminum is one of the most recycled materials on the planet. Many Chemetal designs contribute to LEED with up to 75% recycled content for aluminum, 85% for brass, and <br/>varying percentages for other materials. Learn more about Chemetal and LEED at chemetal.com.",
"id": "8920",
"product_name": "Glowing Metals",
"video_url": ""
}