{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8937",
"category": "Product > seating: residential/stool",
"company_name": "Fyrn",
"company_url": "www.fyrn.com",
"description_html": "Fyrn is a San Francisco company that believes in creating connections between people, places, and materials. With an obsession for perfection and a lot of love, we promise to continue the tradition of craft by making high-end objects more accessible and useful for people's everyday life. The Stemn Series is Fyrn's debut line and the foundation for a broader furniture system that aims to change the way people relate to and value the objects they choose for their homes, hopefully, inspiring a move away from disposable culture.<br/><br/>Stemn emphasizes the strength of metal and the warmth of wood. In designing the line and the manufacturing process Fyrn's founder, Ros Broughton, relied upon his family's rich history of craftsmanship and his own 25+ years of building and furniture making expertise to develop proprietary hardware and manufacturing equipment that would make production feasible and scalable in San Francisco.<br/><br/>The secret to the Stemn Series is courtesy of the sculptural Stemn bracket (patented and made by Fyrn). Sturdy, replaceable and uncomplicated, it is a truly beautiful piece of exposed hardware that enables strong, high-end furniture that can ship flat and assemble at home without sacrificing an iota of grace or durability. All chairs and stools are also available fully assembled and are customizable by the wood finish, bracket color, and upholstery making them versatile enough to fit a multitude of design environments.<br/><br/>Fyrn developed the entire Stemn package experience in-house, with a focus on making home assembly as intuitive and satisfying as the product itself. Talented San Francisco artists Mik Gaspay and Chris McNally created the art on the exterior and interior of the shipper boxes and screen printed many of the internal materials by hand. Fyrn's own design and engineering of the 3 packaging trays break the assembly experience into simple stages that allow for the elimination of an instruction pamphlet or booklet. The internal toolkit includes a phone stand constructed from scrap material salvaged during the Stemn production process, a \"Fyrn tool\" or torque wrench that clicks when each screw is properly tightened, and extra screws if needed. The toolkit is constructed to be retained and will fit nicely on a bookshelf if ever needed for future maintenance.<br/><br/>Stemn focuses on sustainable choices from design through delivery. Responsibly harvested lumber, minimizing transit, and using recyclable packaging is a given. But, Fyrn believes the most sustainable path is to produce a product that will last a lifetime. Durability combined with an easily repairable system is the true strength of Stemn and what will make these chairs and stools future heirlooms.",
"id": "8937",
"product_name": "Stemn Series",
"video_url": "https://vimeo.com/217883567"
}