{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8973",
"category": "Product > bath: fittings",
"company_name": "Sloan",
"company_url": "www.sloan.com",
"description_html": "In March 2017, Sloan added special finishes and custom engraving options to its line of innovative products as it continues to elevate the quality of restroom design.<br/><br/>A limited number of Sloan high-efficiency faucets, soap dispensers, hand dryers and flushometers are now available in-stock with brushed nickel, brushed stainless and polished brass finishes, in addition to standard polished chrome. The result is a luxurious and clean aesthetic that creates an elegant restroom experience.<br/><br/>Additionally, Sloan’s BASYS® faucets in chrome finish can be customized even further with new laser-etched engravings to add a unique branding element to commercial restroom products. Engraved faucets were first deployed in Sloan Park, the spring training facility of the Chicago Cubs. News of the engravings spread quickly throughout the professional sports community, leading to engraved faucets in stadiums, arenas and VIP sports suites across the country. They quickly spread to high-end hotels, restaurants, airport lounges, exclusive fitness centers and casino VIP areas.<br/><br/>Ideal for any commercial restroom environment, Sloan’s exclusive line of special finishes cater to designers and architects with their design flexibility while also offering a polished, clean aesthetic with durability and resistance to staining. <br/><br/>With Sloan’s offering of products with special finishes and engravings, organizations can now increase their brand awareness in the restroom while recreating a unified restroom experience across all designs. Each design option is strategically engineered to create an elegant restroom experience. The brushed stainless and brushed nickel aesthetic options hide most fingerprints or watermarks, keeping the restroom sharp and clean no matter the environment. These aesthetic options across all products leave a spotless finishing touch that won’t tarnish over time.<br/><br/>Sloan’s special finish options use the Physical Vapor Deposition (PVD) process for exceptional durability and resistance to wear. Custom engraving is done with highly advanced industrial lasers. <br/>Special finish options include PVD polished brass, PVD brushed nickel and PVD brushed stainless. Opportunities for custom engraving are almost limitless and can include logos, lettering, images, portraits and patterns. <br/><br/>Sloan’s special finish options can be customized to fit any commercial restroom to enhance flexibility for architects and designers. The customizable finishes can be implemented onto select Sloan faucets, soap dispensers and flushometers to create a unified restroom experience across all designs. With Sloan’s custom engravings for BASYS faucets, customization is potentially limitless.",
"id": "8973",
"product_name": "Sloan Faucet, Soap Dispensers, Hand Dryers and Flushometer Personalization",
"video_url": ""
}