{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8983",
"category": "Product > textiles: contract",
"company_name": "KnollTextiles",
"company_url": "www.knolltextiles.com",
"description_html": "The proverb ‘necessity is the mother of invention’ was never truer than for Florence Knoll in the early 1940’s.  She was determined to find suitable modern upholstery, for Hans Knoll’s modern furniture, in a market dominated by traditional decorator wares such as chintz, brocade and cabbage roses.  She turned to grey and beige tweeds and flannels from Scotland for use in commercial interiors.  Tis unexpected adaptation of simple menswear fabric for furniture application signified the beginning of Florence Knoll’s enduring legacy of innovation and the founding of the KnollTextiles.<br/><br/>“Very few textile companies can say they offer a breadth of products that have had a consistent point of view for 70 years.  More importantly, no one in the market is connected to a legendary design visionary like Florence Knoll, the founder of our company who celebrated her 100th birthday in 2017,” Dorothy Cosonas, Creative Director KnollTextiles.<br/><br/>To honor the 70th anniversary and Florence Knoll’s founding vision of modern design, Dorothy and her team delved into KnollTextiles history, adapting classic designs for today’s market. Technology and innovation were employed in the development of the new textiles. Custom loom set ups were created to achieve a specific aesthetic for Alter Ego, Feeling Plaid, Catwalk and In Stitches. <br/><br/>KnollTextiles sourced an Italian novelty yarn and supplied it to a European mill to weave Catwalk and to a domestic mill to weave its companion Modern Tweed. The novelty yarn allows the two patterns to speak to each other through color and texture.<br/><br/>The unique construction of pattern Stretch Appeal provides a 4 way stretch. The width is<br/>designed to expand from 49” (relaxed) to 54” (stretched). It is ideally suited for organic,<br/>curved and large-scale seating that is typically difficult to upholstery.<br/><br/>Dorothy spoke to the design process saying, “We studied multiple archives and worked with various mills to reinterpret the colors, structure and materials of these textiles.  Our 70th anniversary was a great opportunity to revisit and reinvigorate product from past decades adding even more choice of KnollTextiles for today’s specifier.” <br/><br/>The Archive Inspired Collection includes 10 upholstery fabrics in 97 colors with an emphasis on textural solids highlighted by thoughtful and timeless patterns.",
"id": "8983",
"product_name": "Archive Inspired Collection",
"video_url": "https://www.knoll.com/shop/knolltextiles/recent-introductions/celebrating-100-years-of-florence-knoll"
}