{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/8998",
"category": "Product > flooring: carpet/broadloom",
"company_name": "Shaw Contract",
"company_url": "shawcontract.com",
"description_html": "The Active collection, through its graphic, linear patterning and vibrant fluorescent colors, brings visual cues to the interior space, akin to a wayfinding system. The nervous system is stimulated and react to either a density of color or pattern that inspires movement across the floor surface, or gathering towards a collaborative meeting or focus point. Active provides opportunities for zoning, wayfinding, and activity-based delineation in the workplace. Scale and impact can be manipulated through mixing both styles and colors.<br/><br/>Active offers four unique styles ranging from a subtle texture, to crisp, graphic high-visibility linear pattern. We treat these design tools – pattern and color to promote pathways, shape visual cues to create intuitive experiences. The patterns can build into bold statements with neutral breaks. Clean neutrals and bold color can shift from small proportion to large scale for flexible environments. Constructed with EcoWorx backing &amp; Eco Solution Q nylon, Active has superior durability, style and recyclability. The Shaw Contract lifetime commercial limited warranty covers abrasive wear, tuft-bind, edge ravel and delamination.<br/><br/>From the concept development stage, our design team was inspired by activewear, focusing on modes of activity and wellness for color and pattern, and the shift towards ‘athleisure.' We envisioned how the synthesis of pattern, texture, shape and color can be used to truly activate a space. We also looked at the language around race trace tracks, whose lines shape and guide runners. Three new fluorescent colors were developed for this collection and added to our color library. There were strategic pile height plantings in the pattern to manipulate the machine into creating a cleaner look. <br/><br/>Our flooring designers were drawn to these emerging lifestyle trends. Early in the process, they studied athletic apparel, where they were engaged in patterns that integrated to fit the purpose of its user. As with athletic apparel design, our designers’ perspective was to envision how pattern, texture, shape and color can be used to activate an interior space. <br/><br/>The result of this study was a collection of custom tufted carpets available in fields, corridors and rugs. These sweeping, overscale graphic patterns provide a fresh design perspective. Likewise, the color palette reflects this wellness-conscious trend with a base of neutral grays accented with graphic pops of melon. <br/><br/>The manufacturing technology allows precision pattern details, which is evident in the carpets’ designs that mimic the detailed form and function of athletic wear. The collection is tufted with four solution dyed nylon colors; yet, the the tufting technology allows yarn colors to be combined, giving the appearance of multiple colors.<br/> <br/>Certified Cradle to Cradle© Silver &amp; assessed for impact on health + the environment. Shaw Contract products designed with EcoWorx© tile backing and EcoSolution Q© nylon are recyclable, contain pre-consumer recycled content, contribute to LEED and are backed by our Environmental Guarantee.",
"id": "8998",
"product_name": "Active",
"video_url": ""
}