{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9021",
"category": "Product > bath: fixtures",
"company_name": "Waterworks",
"company_url": "waterworks.com",
"description_html": "With the goal of developing a modern freestanding bathtub that is both beautifully sculptural and highly<br/>functional, Waterworks and Lee Mindel, Principal Architect, Shelton, Mindel and Associates, took<br/>inspiration from the Renaissance period - a time when baths were carved with substantial size and<br/>thickness, notably different to the thin forms of many of today’s freestanding bathtubs. Contrary to how<br/>Renaissance baths were created by chipping away pieces from a large block of material, Formwork is<br/>made of Lithic, poured natural stone dust and resin, creating a sculptural modern form that is then hand<br/>polished.<br/><br/>The Formwork collection was designed with a heavy focus on how water is held and with respect to the<br/>capabilities of the material. The new set of bathtubs include styles that can be freestanding, set within a niche, integrated with shower stalls enclosures, or project from a wall, allowing for more cubic feet of bathing space in a footprint. The Formwork bathtubs have a larger tub deck or edge that can accommodate bathing accessories - soaps, brushes, sponges, even an iPad.<br/><br/>Made from Lithic, our proprietary natural stone and epoxy resin composite material<br/>Lithic material has superior insulating properties, ensuring maximum heat retention in the bathtub<br/>Each piece is individually cast and finished with more than 20 hours of hand polishing<br/>Can be installed as freestanding or in an alcove with use of optional tile flange set (UNFL01). Uses PTWO04 Waste and Overflow drain set.<br/>Measurements of Freestanding Rectangular Bathtub: L 66\" x W 40\" x H 24\"<br/>Available in Matte White and Sable Gray",
"id": "9021",
"product_name": "Formwork Freestanding Rectangular Bathtub",
"video_url": ""
}