{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9077",
"category": "Product > lighting: architectural",
"company_name": "FOCAL POINT",
"company_url": "http://www.focalpointlights.com/node/4193",
"description_html": "The Focal Point design team delivered on its mission to create a modern luminaire that embodies the flexibility in designing with an LED light source with the creation of Obscura. More than a linear suspended LED luminaire, Obscura exudes an air of mystery with a seemingly invisible light source to become a functional architectural statement. Obscura is creatively engineered to balance beauty and functionality with a wide batwing distribution (80% indirect and 20% direct lighting). This allows for increased spacing between luminaires; up to 16' on center.<br/><br/>Its soft yet powerful illumination, up to 129 LPW, meets the stringent energy efficiency standards of the DesignLights Consortium® (DLC). In addition to the optics and illumination qualities, Obscura offers personalization with individual lengths from 4' to 12' in 1' increments and modern finishes: White or Palladium Silver exterior body and White or Infinity interior end caps. Furthering its minimalist design, Obscura integrates Focal Point’s Power-Up™ technology where power is delivered through the aircraft suspension cables, eliminating the visual clutter of power cords. <br/><br/>Features: <br/>•\tHidden optics provide an air of mystery with a seemingly invisible light source<br/>•\t4’ – 12’ individual units in 1’ increments<br/>•\tPowerful optic with up to 1200 Lm/ft<br/>•\t80 direct/20 indirect distribution <br/>•\tLow-voltage power is delivered through suspended cables<br/>•\tExterior finishes: White and Palladium Silver<br/>•\tInterior finishes: White and Infinity",
"id": "9077",
"product_name": "OBSCURA",
"video_url": "http://www.focalpointlights.com/products/linear/obscura-foss#overlay=modal-overlay/4447"
}