{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9097",
"category": "Product > seating: contract/task",
"company_name": "Poltrona Frau",
"company_url": "www.poltronafrau.com",
"description_html": "Neither a car seat nor a pure piece of furniture or design. It is a contemporary hybrid that brings together two brands, two imaginations, two industrial philosophies to celebrate the 70th anniversary of the Maranello carmaker. A new object that perfectly translates a dream into reality. This is an office chair that captures the excitement, speed and dynamism of the driver’s seat, as well as the passion for racing. And that transmits a pleasant sensation of how the backrest and seat support movements and posture. A blend of automotive know-how and the culture of living.<br/>Conceived and designed by the Ferrari Design team directed by Flavio Manzoni, which designed the recent Ferrari models (including the LaFerrari Aperta, the GTC4Lusso and the 812 Superfast) , its iconic profile launches itself into the space enveloping its body. <br/>The Cockpit is a place where concentration, quick reflexes and intuition join with a will to win. It is a space where the driver comes into contact with their car, assumes the correct driving position on the seat and drives the vehicle around corners. The contact between the body and the seat creates dynamic sensations that help the driver to control the car as efficiently as possible. For the moment two versions are available, the President and the Executive. Both comprise a reclining base and seat, integrated with two different backrests. The President is the managerial model with a high backrest that offers generous support for the top half of the body and which is inspired by the ergonomics of competitive racing seats. The Executive model, a chair that adapts to all work contexts, has a deliberately low and narrow backrest to ensure freedom of movement. The central band on the seat takes its cue from racing seats. The materials are the same as those used in Ferrari cars. The external shell is moulded from carbon or alutex. Poltrona Frau has concentrated the very highest ergonomic knowhow in the mechanism used to adjust the position of the backrest and the height of the seat. The swivel device sports the same design and mechanical elements as the steering wheel, the 5-spoke base comes in the two polished or powder-coated aluminium finishes in matt racing grey. For the leather upholstery, the Ferrari Design Centre team has chosen shades and finishes inspired by the trim of the three Tailor-Made service lines, which allow for the customised configuration of the car: Scuderia, Classica and Inedita. Cockpit can also be customised in terms of its colours and materials.",
"id": "9097",
"product_name": "Cockpit",
"video_url": "https://www.youtube.com/watch?v=CJkSC4m4nSg"
}