{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9126",
"category": "Product > bath: fixtures",
"company_name": "Native Trails",
"company_url": "http://www.nativetrails.net/",
"description_html": "Like its namesake, Native Trails’ Santorini bathtub exemplifies romance with its beauty and history. This 66-inch copper bathtub is distinguished by its pedestal base and the juxtaposition between its graceful lines and hand-hammered texture. Through thousands of hammer strikes and over the course of weeks, the work of master coppersmiths is reflected in Santorini, as are centuries of artisan techniques that have been passed down and continually refined while honoring the company’s commitment to sustainability.<br/><br/> “This bathtub has been designed to be as timeless as the material from which it’s made,” says Naomi Neilson Howard, founder and CEO of Native Trails. “The curves that our artisans have hammered into place by hand cut a classic figure—at once elegant and stately, and very versatile stylistically depending on its surroundings. With Santorini, our design team achieved a beautiful bathtub that will endure the test of time.”<br/><br/>Santorini’s versatile look can skew rustic, classic, or glamorous depending on whether the chosen finish is polished or antiqued – or luxuriously plated in nickel. In the Brushed Nickel finish, Santorini benefits from the latest plating innovations. The advanced electroless plating process gives extreme surface adhesion and ensures that every surface is evenly coated in uniform thickness. Used regularly for mining and aerospace applications, the electroless plating process also provides superior wear and corrosion resistance. <br/><br/>Copper’s versatility is shown in its ability to be formed, stretched and hammered into sheets without breaking. Beyond the distinctive texture and magnificent coloration, recycled copper is extraordinary in the field of sustainability. Less energy is used to recycle the material than to extract, mine or originally produce it, and copper is one of the few materials in the world that retains its performance even with repeated recycling.<br/><br/>Aesthetically, Santorini instantly ups a bathroom’s luxury quotient and instills it with a sense of history, necessitating long, lazy soaks that, quite naturally, make bathers feel like royalty. As homeowners increasingly look to create master bathrooms that double as luxurious retreats where they can unplug, trendspotters are linking the soaking tub’s resurgence as a kind of real-life antidote to our hectic digital lives.<br/><br/>The Santorini is Native Trails’ first bathtub to be offered in its new Polished Copper finish, which debuted earlier this year. This luxe shade carries hints of rose gold and is hand-polished to a dazzling shine. Santorini’s gleaming finish introduces contemporary bling to a bathroom while paying homage to the copper bathtub’s European heritage and generations of Mexican artisanship. Today, this 100 percent high-quality recycled copper tub is helping designers around the world create one-of-a-kind eco-chic spaces.",
"id": "9126",
"product_name": "Santorini Freestanding Bathtub",
"video_url": "https://youtu.be/xHRhyDmZxBs"
}