{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9154",
"category": "Product > acoustical applications",
"company_name": "Submaterial",
"company_url": "www.submaterial.com",
"description_html": "Our collection of acoustic wall surfaces is a natural evolution of our growing interest in sound-softening materials. The beauty of these wall systems is more than just skin deep. Beneath the thick commercial-grade wool felt facing these floor-to-ceiling panels is a high-performance, thermally-formed acoustic substrate that is moisture resistant and light in weight. These new designs emphasize the craftsmanship and attention to detail typical of the Submaterial studio, while showcasing the hand-applied work which has become a Submaterial signature.<br/><br/>Effortless concentric forms and nested lines define many of these new wall surfaces, while others use laminated color and bold linearity to striking effect. Like all Submaterial designs, the underlying modularity allows for great adaptability and customization possibilities. The panels are designed to minimize or hide seams between units, allowing for a continuous installation appearance.<br/><br/>With more than 60 colors to choose from, our acoustic wall surfaces are easily customizable to any interior environment. Any of the panel designs can be installed using direct glue or z-clip mounting. The standard size of 116” x 34” means continuous floor-to-ceiling application in many situations, and the designs are easily extended or framed with additional felt-faced sections. <br/><br/>The graphic concentric forms of Hex conceal a workhorse acoustic substrate. Beneath the wool felt face is a high-performance, thermally-formed acoustic panel that is moisture resistant and light in weight. When installed using standard z-clips Hex panels provide an NRC rating of 0.60. The standard focus-height for applied design elements on the panel is 62” (eye-level) but can be easily customized by request. Our acoustic panels are designed to minimize or hide seams between units, allowing for a continuous installation appearance. Choose from more than 60 colors and custom color blocking options.<br/><br/>With a complete selection of matched baseboard material, end-of-run-trim and scribing boards our acoustic wall surfaces are easily customizable to any interior environment. The standard size of 34” W x 116” H means continuous floor-to-ceiling application in many situations, and the designs are easily extended or framed with additional felt-faced sections. Overall depth of installed panels is 1-1/2”. Complete installation instructions and hardware ship with every order. Production lead-time is 4-6 weeks.",
"id": "9154",
"product_name": "Hex",
"video_url": ""
}