{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9175",
"category": "Product > seating: contract/lounge",
"company_name": "ERSA Mobilya A.S.",
"company_url": "www.ersa.furniture",
"description_html": "Carnival; is a festival.<br/>Carnival; is the entertainment that encourages letting go of your former self and embracing the carefree nature of festival.<br/>Carnival ; is a reversal ritual, in which social roles are reversed and norms about desired behavior are suspended.<br/>Carnival; is a form of entertainment that travels to different places. The performers, move from town to town. They travel and they bring you the dust of other locations, other cultures, others’ loughters.<br/>It typically involves a public celebration or parade combining some elements of a circus, dances, masks, drum rhythms, large puppets, stick fighters, and long leg of clowns on stilts, the jugglres doing tricks, slack-wire performers, tumblres standing and carying more tumblers on their shoulders with all fantastic views that can not be believed, or imagined to be real.<br/>Today the the word itself, stands for the atmosfhere full of colors, fun and enjoyment and the mood that makes you forget differences and just celebrate life. <br/><br/>As the designer team, delightful details about carnivals for us are; the exagarations, the impossibility in its common language. Oversize figures, unexpected appeareance, not come across in your daily life. A little funny, a little sypathetic..<br/>Dynamism in the crowd, motion/ mobilty.<br/>The language of fun which units everyone without considering their position in the crowd. <br/><br/>Ladies .. and … Gentilemen … ! <br/>We present our CARNIVAL members;<br/>TRAPEZE, LOBUT, TAMBOUR, ACROBAT<br/>As the design team, we have decided that, they are exactly what we need in order to create our own parade, in our serious grown up World. The World which is full of realities, rulls, orders, responsibilities, deadlines, mostly tiring, fearfull, stressful and boring. <br/>We propose to bring a touch of a parade to your serious office lives, by means of their fun language. <br/>Dynamic lines and amusing forms , wide variety of flamboyant, strong contrast colors are unexpected for an office. Their mobile character that aims ‘ready to move product any moment’ will convert the space into a fun parade.<br/>……<br/>Well it is your turn! <br/>Bring your childhood memories, gather it with your grown up dreams and creativity , and push the limits of the serious atmosphere with our simple products.<br/>It is your creativity that will ……..unleash the chains.<br/>It is your time to live our dreams.<br/>Let’s accept CARNIVAL as a dynamic tool for self-expression and exploration, a tool to develop new forms of looking at the world.<br/>Finally, a tool to unite the world, to discover what we all have in common, and to celebrate what makes us different.",
"id": "9175",
"product_name": "Carnival",
"video_url": ""
}