{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9183",
"category": "Product > seating: residential/lounge",
"company_name": "TORU",
"company_url": "www.toru.barcelona",
"description_html": "TORU is a young craft and design company that produce beautiful, simple design furniture with exquisite materials. <br/>We are interested in telling stories through objects, by looking for new functions and exploring ma¬terial qualities. All the products are handmade by local artisans, and are either unique or produced in small series.<br/><br/>Our products are made in quality leather, produced locally with the highest standards of craftsmanship and using vegeta¬ble-tanned leather only. <br/>Founded in 2015 by Jordi Ribaudí, the company is based in Igualada, Barcelona, a town with deep roots in the leather industry. The headquarters is located in a restored nineteenth century tannery.<br/>Toru’s passion is to make the most of leather in furniture design. We work the material and look for new purposes to create innovative shapes and feels. Our unique and exciting designs will last for years to come. <br/><br/>BABU<br/>Babu is a nomadic chair. You can fly on a carpet or chill on the sand while sitting in it.<br/>Its design is inspired by the great journeys of the desert tribes, during which men feel close to the earth, rest on it and merge with the landscape.<br/>Babu is a spot for relaxation and meditation; a place to rest, a shelter. <br/><br/>Babu is born straight from Jordi Ribaudí’s soul, in Igualada, Barcelona. The town has strong roots in the local leather industry, and the company’s headquarters is to be found in a restored nineteenth century tannery.<br/>His work is inspired by his passion for leather works. He looks for new purposes of the material in order to create innovative -and exciting- shapes and feels.<br/><br/>Materials<br/>Babu takes shape from a single 6mm-thick leather piece, which folds back on itself to create the backrest. Some small brass feet keep the structure together.<br/>The leather, vegetable-tanned and wax-finished, is available in four different aniline colours: na¬tural, brown, hazelnut, and black.<br/>The seat cushion is available in cotton velvet and leather.",
"id": "9183",
"product_name": "Babu",
"video_url": ""
}