{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9190",
"category": "Product > furniture: contract/desking",
"company_name": "IOC USA Inc",
"company_url": "www.ioc.it",
"description_html": "Designing office furniture with the highest attention for its details, functionality and comfort is fundamental for the well-being of the workplace. The combination of these three elements has lead to the creation of Brera25, a modular, integrated furniture system aimed at a quality target in the world of private offices, the result of a consolidated collaboration with Gensler, one of the world’s most renowned design studios. To create this range, IOC has engaged a team of technicians and engineers, who through an intense multi-year research and development activity has created a system able to satisfy any functional or aesthetic expectation. The two main strengths are “Italian-made” and “tailor-made”, expressed in a product of refined design and high quality in its technical perfection and in its use of fi ne materials combined in various finishes: lacquer, wood, melamine, eco-leather, glass and metal, rarely used in the office environment. The modular nature of each element enables solutions that perfectly suit the needs of managers and professionals, making the office a comfortable, prestigious environment where no detail is left to chance. Advanced techniques are used, with electrically height-adjustable tops, cable management systems and runners for full extension drawers, customizable cabinets with open shelving, drawer unit and door. The collection is completed by coat cupboards, shelves and wall units. The modular composition also provides ample freedom in combining colors and materials. With Brera25 an important protagonist takes center stage to continue to provide cross-sectional, innovative solutions for the office, to meet the needs of every kind of client.",
"id": "9190",
"product_name": "BRERA25",
"video_url": ""
}