{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9193",
"category": "Product > flooring: carpet/broadloom",
"company_name": "Mannington Commercial",
"company_url": "manningtoncommercial.com",
"description_html": "Upscale. Richly textured, with an incredible 24-ounce face weight. In colors that are as useful as they are lovely. Designed by the Mannington Design Studio in collaboration with HOK Product Design, Origami is a three-pattern carpet collection that explores and interprets the classic Japanese art of paper folding, without being limited to directly literal interpretations of folds. <br/><br/>Soft lines strike a unique balance between geometric and organic, while scale and line weight play off one another, sculpting complexity out of simplicity and high design out of understatement. Structured yet highly versatile, each pattern can stand alone or be matched with others to create dynamic looks and way-finding layouts.<br/><br/>The large and medium-scale modular patterns abstractly reference folding techniques, while a medium-scale textural tile/broadloom coordinate offers a simple, elegant base for pattern interplay. <br/><br/>Origami’s 12 colorways are drawn from Antron Lumena yarns, creating a palette of solid neutrals that address cool and warm greys in light, medium and dark, as well as lovely neutral and navy blue tones. <br/><br/>Mannington’s advanced tufting capabilities were used to create Origami’s rich aesthetics with a 24 ounce face-weight, bringing modern luxury to any commercial space — from corporate to higher education to hospitality.<br/><br/>Origami is fully recyclable via Mannington’s LOOP® program. Antron is an Environmentally Preferable Product, and Mannington’s Infinity® Modular backing contains pre-consumer recycled content and is certified NSF/ANSI-140 Gold (an Environmental Product Declaration for the backing is available). <br/><br/>The collection also includes Broadloom backings Ultrabac® and Integra HP® RE, which contain a minimum of 10% post-consumer recycled content by total product weight and are Certified NSF/ANSI-140 Platinum and CRI Green Label Plus. Origami is made in the USA, in Mannington’s ISO 14001 registered facilities.",
"id": "9193",
"product_name": "Origami Collection",
"video_url": ""
}