{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9208",
"category": "Product > furniture: contract/systems",
"company_name": "ERSA Mobilya A.S.",
"company_url": "www.ersa.furniture",
"description_html": "The main aspect of ENVELOPE Family is that, the product offers different degrees of privacy for different usage scenarios by the help of folding side panels.<br/>Envelope is a seating unit that is merely born by the demand of changing work habits of contemporary office life. It proposes breathing points for the workers far from tiresome computer vibration, and give them chance to socialize, to exchange ideas, to concentrate which now are considered to increase creativity, productivity and motivation at work. <br/>When they are placed face to face, the box like geometry of the product, high back rests and folding side panels creates semi private meeting spaces more than a seating unit, for both inside team works or hosting outsiders for fast but comfortable meetings.<br/>ENVELOPE Work Cabin, part of new generation Envelope family offers adjustable privacy level for comfortable work and allows various usage scenarios to answer contemporary work habits, such as temporary work spots or home need. System lets to create areas both for personal and multiple use.<br/>ENVELOPE Work Cabins,is enriched with adaptative and integrated parts that allow new usage scenarios of contemporary offices, not only in personal work areas but also for multiple use in common areas, even in libraries, dorms, schools, call centers, home offices.<br/>Accessories, like LOW Shelf Unit shaped as recessed cable compartment with outlet acess also acts as I PAD holder ,HIGH Shelf Unit with hidden task light, embraces electrification. High and low side panels, optional fabric pockets, metal storage boxes that comes with or without drawers allow different usage scenarios.They all serve for a comfortable, quiet, organized,tidy work top for productive work. <br/>Whole ENVELOPE family uses same structure, details, panels and aesthetic language to use the advantage of creating harmonious combinations depending on the users changing needs through time. Eligibility to evolvement brings sustainability alongwith.<br/>‘Foldable’ acoustic side panels that are the most typical and differentiated aspects of design aims to offer autonomy in the office. This way user takes control of his/her privacy level while working. This answers the main noise problem of open office areas.",
"id": "9208",
"product_name": "Envelope II",
"video_url": ""
}