{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9219",
"category": "Product > window treatments",
"company_name": "MechoSystems",
"company_url": "mechosystems.com",
"description_html": "This interactive tool, hosted on the MechoSystems website, allows a designer to search for a specific shadecloth (window treatment textiles) via commonly used/needed criteria for a specific project. This is done by selecting desired attributes through the multi-level search criteria/filters. Environmental certifications and technical specifications criteria can be selected for sorting by the Shadecloth Features Selector. Then, the list of selections can be saved as a Spreadsheet, emailed, or saved as a .pdf for the particular shadecloth or certification based search results.<br/><br/>The MechoSystems Shadecloth Features Selector is unique in that a textiles’ environmental certifications and technical attributes can be custom sorted by series for the desired project requirement in an unlimited number of combinations. The search for a shadecloth can be complex, multi-attribute, or simple, a single attribute. Once a search ranking is done, another one can follow instantly. A shadecloth series identified by the Features Selector Guide can be located by clicking and the product page is instantly located. Technical certifications can be reviewed and samples can be ordered by a click. Term descriptions are answered by mouse hovering over the attribute. <br/><br/>Now a Designer can perform a search for a shadecloth series based on official environmental certifications and/or technical parameters in an objective manner to meet owners’ criteria or for compliance with various ratings standards such as LEED or Living Building Challenge or Healthier Hospitals Initiative.<br/><br/>Today, a major focus within buildings is WELLNESS. Designers and Project Owners are keenly aware of this and are striving to choose materials that “do no harm” and meet the technical criteria for the project. Therefore, a chart that allows for environmental and product attributes to be sorted eases the product selection basis and demonstrates transparency.<br/><br/>The Shadecloth Features Selector guide is organized with clear headings, distinct gridlines and numerous links to other pages on website. The Guide is constructed on a white background with black text and the logos of the environmental certification are used as an aid to locating the desired shade. Except for the data, nothing is pre-configured. Since the software is hosted on the website, information will be maintained as environmental certifications get more stringent and new textiles are introduced. All information will always be the latest, assuring the Designer gets current and accurate results.<br/><br/>The total list of sortable criteria is:<br/>Openness, Opaque, Less than 3% open, More than 3% open, Railroading, Flame Retardant, NFPA 701®, HHI compliant/CFR free, GreenGuard®, PVC-Free, Eligible for LEED®v4, Cradle to cradle™, Material Health Certificate, Health Product Declaration. The list can be sorted Ascending or Descending. <br/><br/>MechoSystems is proud to offer the Shadecloth Features Selector Guide as an aid in helping sort window treatment textile by criteria and in simplifying the process of gathering environmental compliance for those projects that require rigorous product selection.",
"id": "9219",
"product_name": "Shadecloth Features Selector",
"video_url": "http://www.mechosystems.com/shadeclothselection/"
}