{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9225",
"category": "Product > technology",
"company_name": "Master & Dynamic",
"company_url": "masterdynamic.com",
"description_html": "Master &amp; Dynamic continues its obsession with materials and technology with the creation of its first wireless speaker: the MA770. Co-designed by architect Sir David Adjaye, designer of the latest Smithsonian Museum – the National Museum of African American History and Culture – the MA770 Wireless Speaker’s use of premium materials and components can be found throughout.<br/><br/>Comprised of a proprietary concrete composite – the result of Master &amp; Dynamic’s passion for innovation with a variety of materials – the MA770’s core material provides a number of acoustic benefits such as increased dampening, reduced resonance from the enclosure due to its single-mold build, a purer sound and added durability. The dampening properties of the concrete are so impressive – five times better than wood and ten times better than plastic – that the speaker can be placed just inches away from a turntable and play at full volume without causing the record to skip.<br/><br/>The MA770’s sonic sophistication also stems from its dual 4” woven kevlar long throw woofers and 1 ½” titanium tweeter powered by 100 watts of Class D amplification. The use of two smaller long throw kevlar woofers allows the MA770’s drivers to react incredibly quickly, accurately delivering the punch and energy of the original artistry; the rigidity of the proprietary titanium tweeter also aides the speaker in delivering crystal clear sound. Tuning the MA770’s sound profile was achieved with a laser doppler anemometer and hundreds of hours of listening to achieve harmony between the custom drivers and concrete enclosure.<br/><br/>The speaker's controls are crafted in diamond-cut anodized aluminum, while a magnetically-attached etched stainless steel grille serves to protect the speaker’s componentry. The grille is removable for those that prefer the chic look of the exposed components to the grille’s elegance. The speaker surprises and delights with sloping fine edges and triangular shapes that end with a gentle point on the speaker's unique back.<br/><br/>The MA770 can be controlled by four source options: Chromecast built-in, Bluetooth, analog (3.5mm) and optical. The MA770 can be used as a single stereo unit or paired with another speaker via Wi-Fi to provide a larger stereo image, enabling multi-room audio via Chromecast built-in. It is the first speaker to use this technology for stereo pairing. <br/><br/>Designed in New York City, the MA770 Wireless Speaker is created by pouring a proprietary concrete composite into a single-mold casing and allowing it to cure. The case is then hand-polished, giving each MA770 its own unique look. Once the outer case is complete, the speaker’s various componentry is meticulously placed into the concrete casing via a discrete port located on the product’s underbelly. Once sealed inside the single-mold concrete composite casing, the speaker is ready for use.<br/><br/>At 16in x 20in x 10in and 35lbs, the speaker is capable of filling a large room with sonically sophisticated sound, while its polished exterior is perfect for use in the home, office, gallery, or museum.",
"id": "9225",
"product_name": "Master & Dynamic MA770 Wireless Speaker",
"video_url": "https://www.youtube.com/watch?v=bor4OCvJ3ZY&t=1s"
}