{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9249",
"category": "Product > (NEW) automotive: interiors",
"company_name": "Land Rover",
"company_url": "https://www.landroverusa.com",
"description_html": "Joining the Range Rover family slotted between the Range Rover Evoque and Range Rover Sport, the Range Rover Velar offers new levels of luxury, refinement and all-terrain capability to the premium mid-size SUV segment.<br/><br/>Created as a clean sheet design using Jaguar Land Rover’s Lightweight Aluminum Architecture, the Velar represents the next chapter of the Range Rover success story. The Velar is defined by a visually reductive approach in its design, which evolves the Range Rover DNA and previews the next generation of Range Rover vehicles.<br/><br/>Visually, the Velar is beautifully balanced with powerful proportions; a continuous waist line rises through to the taut tapered lines of the rear and a generous 113.15-inch wheelbase contributes significantly to both its elegant design and spacious interior. <br/><br/>The interior of the Velar reaffirms ideals of elegant simplicity, sophistication and refinement. An unwavering belief in reductionism has been fully employed, with switches being kept to an absolute minimum to help create a calm streamlined sanctuary.<br/><br/>In order to achieve this elegant simplicity, inside, designers relied on a new InControl Touch Pro Duo infotainment system; the centerpiece of the vehicle‟s interior. Touch Pro Duo features two 10-inch high-definition touchscreens integrated seamlessly behind hidden-until-lit surfaces. These slim, intuitive displays work in harmony with the cabin architecture while adding an overall sense of modernity congruent with the vehicle’s reductive exterior design approach. All of this is equaled by the vehicle’s practicality: luggage compartment volume is 34.4 cu. ft. behind row two.<br/><br/>The instrument panel’s strong, horizontal beam is the defining element of the interior architecture of the Range Rover Velar. It rakes back dramatically towards the windshield underlining the vehicle’s dynamic driving characteristics. The slender air vents reinforce its reductive, technology-enabled design approach.<br/><br/>Offering greater choice to customers, an innovative new Premium Textile seat material is offered as an alternative to leather upholstery. Developed with Kvadrat, Europe’s leading manufacturer of high-quality design textiles, this sustainable material comes in Dapple Grey and features wool-blend textile contrasted with a Suedecloth insert available in Light Oyster or Ebony. The Suedecloth fibers are created from recycled plastic bottles and crafted into a textured non-woven material that’s soft to the touch.<br/><br/>Perfectly-crafted trim finishers celebrate the natural look and texture of authentic materials. Choices include a Satin Blonde Linear veneer, which is pale-stained and has a satin feel open-pore finish to give a very modern, airy character, and the Argento Pin-stripe veneer, which is distinguished by its high-gloss finish and silver streaks to emphasize the wood grain. Another highlight is Carbon Fiber Copper weave trim, created by weaving carbon fiber and copper filaments together under a high gloss finish. <br/><br/>Ambient LED lighting casts a soft glow over the interior, subtly highlighting the strong architectural lines and authentic materials for a calming atmosphere. Configurable ambient lighting technology offers a choice of 10 different color options.",
"id": "9249",
"product_name": "2018 Range Rover Velar",
"video_url": ""
}