{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9251",
"category": "Product > lighting: table",
"company_name": "Haworth, Inc.",
"company_url": "www.Haworth.com",
"description_html": "Corner Office is a systemic and flexible task light that is also a power provision and personal privacy system for today’s new variety of workplaces. The system is comprised of three elements: a glare-free, fully dimmable LED task light that incorporates power ports featured in its armature; a set of optional acoustic deterrent fabric panels; and an optional pocket accessory, that provides a place to store a phone or tablet, keeping things clutter-free.<br/><br/>With today’s portable wireless technologies and cloud-based computing, many workers are in team environments or places other than the office. Privacy, power and quality lighting are necessary everywhere, as everyplace is a workplace. By providing these elements all in an easy to set up unit, Corner Office brings heightened efficiency and well-being to any desk. When used singly, Corner Office provides a quiet alcove or touchdown space for one. When arranged in multiples, it provides individual privacy within larger, open shared spaces.<br/><br/><br/>Corner Office represents a new typology of workplace productivity tool. Equal parts task light, power charging station and acoustic/privacy panel system, Corner Office is a simple solution that helps define personal space by incorporating productive elements to support wellness and user-controlled privacy. Density in open-plan offices will only continue to rise and, while this sort of clustering of people is essential for employees to communicate, share knowledge and innovate, many workers are finding themselves suffering from distractions and lack of privacy. This often impedes the collaborative mission these layouts are designed to foster. Corner Office provides the attributes of a fully composed workstation with immediacy and ease.<br/><br/>While its overall aesthetic is simple, Corner Office reveals subtle intricacy in the places where elements come together. The sculptural origami-like shape of the panels outline a distinctive profile that is identifiable at a distance while refined, machined aluminum connectors provide self-evident, effortless reconfigurability for individuals or teams.<br/><br/>Corner Office Light is offered in a neutral white color and the panels are available in various felt colors. This allows it to quietly recede into the background, blending into the interior envelope, or enliven a space by adding a shot of accent color to any desk or tabletop. In addition to felt, forthcoming panel finishes and material options will include various wood veneers, perforated leathers and translucent plastics, as well as COM fabrics.",
"id": "9251",
"product_name": "Haworth Collection Corner Office",
"video_url": ""
}