{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9270",
"category": "Product > furniture: outdoor",
"company_name": "Gloster Furniture",
"company_url": "www.gloster.com",
"description_html": "Depending on your perspective, the word ‘atmosphere’ can conjure up a variety of emotions. The freedom to move, to enjoy independence or intimate moments - to be at one, whether alone or with those closest to you. But atmosphere also buzzes with chatter and laughter and dancing light - the sound of good times amongst family and friends.<br/><br/>For the new Gloster Atmosphere collection, Danish designer Cecilie Manz has drawn from observing couples, groups, friends and families interacting in seating areas - sliding down low in comfortable furniture, tucking up legs, resting side by side as stories are told and moments are shared.<br/><br/>“This is why it felt natural” Cecilie says, “to lower the whole setting, to enhance and welcome this feeling of comfort and quiet - when you wish to have slightly more relaxed moments, even a few centimetres in height makes a signiﬁcant difference. Sitting lower pulls you into a familiar, soothing embrace - welcoming you to unwind and stay longer.”<br/><br/>Cecilie has intuitively embraced the emotions behind the design in a powerful mixture of minimal, powder coated aluminium frames, generous boards of Gloster’s signature teak and cleverly designed self-supporting upholstered panels.<br/><br/>The minimal aluminium frames are ﬁnished with a resilient powder coating in Fossil colour and the self-supporting upholstered panels are covered with a selection of weather resistant outdoor fabrics by Sunbrella. Accompanying seat pads are also available in a variety of matching, muted colours.<br/><br/>The collection itself is comprised of a series of dining and seating components that share slim lines and welcoming, curved upholstered arms and backs. Equally attractive as stand-alone items or in a collection, the signature daybed/chaise lounge units are accompanied by an imposing sofa and occasional tables that easily double as ottomans or impromptu benches with the use of an upholstered pad.<br/><br/>Cecilie says “The materials in a project should reﬂect the usage of the pieces. Aluminium and teak are great materials for outdoor spaces, the ﬁnish of the metal is robust, and the solid teak gets a beautiful grey patina over time. Combined with the fabric options, the palette is subtle and harmonious, revolving around muted, sophisticated tones.<br/><br/>Designer <br/>Cecilie Manz<br/><br/>Materials<br/>Powder Coated Aluminium <br/>Natural Finish Teak <br/>Outdoor Cushions<br/><br/>Models<br/>Left &amp; Right Chaise<br/>2-Seater &amp; 3-Seater Sofa Ottoman<br/>Coffee Table<br/>Dining Chair<br/>68\" &amp; 84\" Dining Bench 94” &amp; 114” Dining Table<br/><br/>Fabrics<br/>Fife Platinum<br/>Fife Lichen<br/>Fife Nightshade Fife Nickel<br/>Fife Salmon<br/>Fife Olive<br/>Fife Soot Blue<br/>Fife Warm Rose Fife Quince Yellow Fife Silky Green Fife Bone<br/>Fife Vesterhav Sand Fife Canvas Grey Fife Rainy Grey",
"id": "9270",
"product_name": "Atmosphere",
"video_url": "https://vimeo.com/232470410"
}