{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9275",
"category": "Product > seating: residential/lounge",
"company_name": "GAN",
"company_url": "www.gan-rugs.com",
"description_html": "GARDEN LAYERS, GAN’s first Outdoor Space, is an innovative proposal conceived by designer Patricia Urquiola that brings style and comfort to terraces, pools, beaches and other outdoor or indoor spaces. The result is an incredible integration of tones, textures and patterns, traditionally found in indoor products, designed to be used out in the open. <br/><br/>The inspiration for such idea came about when Patricia Urquiola travelled to India. There, she became captivated by the delicacy and harmony of Mughal architecture. Gardens, terraces and miniatures found their way into her restless imagination inspiring a new collection, which from the very first moment she wanted to be ambivalent, suitable for outdoor and indoor.<br/><br/>On sand, or lawns, carpeting over a deck or just bringing an element of comfort to low benches, GARDEN LAYERS adds an extra touch of well-being and refinement, inspired by the long Eastern tradition of lounging in open air spaces. The collection can be used for relaxation or sun bathing beside a pool, at the beach or at home. Also perfect to use under shade, GARDEN LAYERS is a space of relaxation, of conversation in porches or under pergolas, given its adaptability to warm environments as well as other more moderate climates. It is made with particularly resistant high-tech fabric and quick-dry foam fillings, so it doesn’t require any additional maintenance.<br/><br/>GARDEN LAYERS is based on a modular system that allows users to create infinite compositions according to the needs and the layout of their spaces. Rugs, mattresses, roll pillows and cushions, all available in different sizes and three colour groups, can be arranged in an infinite number of ways: extensive compositions or more intimate arrangements, rectangular or asymmetrical. The mattresses can be laid over one or more rugs, the cushions are supported on the roll pillows, in this way spaces can be constructed for the purpose of reclining and relaxing, to create socialising areas or define separate zones.<br/><br/>Patricia Urquiola’s imagination and her masterly creativity is illustrated in these warm and welcoming spaces. The collection is available in three colour options: Terracotta, Green and Blue.",
"id": "9275",
"product_name": "Garden Layers",
"video_url": ""
}