{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9287",
"category": "Product > seating: residential/lounge",
"company_name": "Ethan Allen",
"company_url": "ethanallen.com",
"description_html": "Bravo Chair<br/><br/>The crowd leaps to its feet…and then looks for our fabulous Bravo chair to sit down in again. From its tapered legs to its sensational silhouette, every element of the Bravo was designed together for comfort, style, and a great, big WOW. The Mickey Mouse fabric, which is available only on Bravo, was developed specifically for it, making the most of the size and shape of this sweeping wing chair. A true showstopper you won't see anywhere else.<br/> A tight back and seat offer the perfect combination of structure and softness<br/> We designed the \"Mr. Mouse\" fabric exclusively for the curves and lines of this chair<br/> Chic, mid-century modern-style legs are stained in a water-based finish<br/> Mr. Mouse in Mickey's Ears Black (D2955) comes with Black (946) finish on legs; Lucky Denim White (D1230) fabric comes with Umber (934) finish on legs<br/> Stain-resistant fabric<br/> An engineered hardwood frame provides superior strength and durability<br/><br/>Ethan Allen | Disney Collection<br/><br/>Designed by Ethan Allen and inspired by Disney’s iconic characters, Mickey Mouse and Minnie Mouse, the impressive collection includes over 500 fun, yet sophisticated, styles for the modern family. Combining Ethan Allen's core strengths of craftsmanship, style, and quality with Disney’s rich storytelling, we’ve created an experience that kids and parents will truly love and appreciate. The collection is designed for every room in the home—and everyone who lives there.<br/><br/>It includes a range of whimsical, fashionable, functional looks for nurseries, kids’ rooms, playrooms, and family living spaces. Consumers will also find an array of accessories such as art and wall décor, rugs, lighting, bedding, and chic, clever storage pieces. Many styles feature cool nods to retro Disney designs, playful shapes, and signature Mickey and Minnie details. Many styles are available in a selection of fabrics and finishes and handcrafted in the company’s own North American workshops.",
"id": "9287",
"product_name": "Bravo Chair / Ethan Allen | Disney Collection",
"video_url": "https://youtu.be/sp-ysevN5nI"
}