{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9290",
"category": "Product > accessories",
"company_name": "Cindy Rendely Architexture",
"company_url": "www.crarchitexture.com",
"description_html": "The OBJEX Collection comes from an award-winning design studio that has a focus on architecture, interiors, landscape and product design. The architect’s previous work as a goldsmith, jeweller and metal artist, combined with a rigorous architectural training, fuels the studio’s continued interest in designing and detailing at all scales. <br/><br/>As part of the practice, the studio is developing a line of smaller household products called OBJEX. These products are informed by the studio’s design philosophy as it applies to larger, architectural design solutions and details. At this time, the OBJEX line include vases, candle holders, coasters and various tabletop objects that are currently in development.<br/><br/>The preferred minimal material palette of the products includes exotic woods and patinaed metals; these materials echo those often used in the numerous architectural projects designed by the studio. This homogeneous approach to design ensures that the architecture and interiors are one. The jewellery-like detailing of the OBJEX collection reinforces the studio’s philosophy as it echoes the larger, architectural projects.<br/><br/>PUX, one product from the OBJEX collection, is a double-sided candle holder. It functions as a tapered candle holder on one side and a tea-light candle holder on the reverse side. The puck-like forms are currently fabricated from solid walnut and ash and solid oxidized bronze. The blackened bronze trim throughout creates a cohesive grouping. <br/><br/>Small and simple in form, the PUX blend easily into any modern or traditional interior space. They are 4” in diameter and 1.5” high. Although diminutive in size, their minimal design and hefty weight allow them to stand alone as a strong sculptural object in any context.<br/><br/>The positive response for PUX from both the design industry and the general public has been overwhelming. Our initial market research indicates that there is definite sales potential for the products in both the residential and commercial markets. Private residential clients in the office are interested in purchasing several PUX, as they work well with the materials and aesthetics of their homes. Restaurants and hotels are interested in purchasing the product for their dining tables and bars and design colleagues are interested in purchasing PUX for their own commercial and residential Clients. In addition, various shops specializing in furniture and housewares are interested in showcasing the PUX line, to be sold in their stores at the retail level.<br/><br/>The positive response from both the design industry and the public focused on the simplicity of the design. It was also important for people to hold the PUX in their hands, to experience the substantial weight of the solid wood and metal forms. The jewellery-like detailing of the PUX, and of the OBJEX product line overall, has proven to have great appeal to the public.<br/><br/>Presently, the studio is working with a local fabricator to develop the line further. Together, they are investigating several other material options, including various wood species, natural stones, metals, and Corian, for production purposes. This could allow for exclusivity for the many interested purchasers across the design disciplines.",
"id": "9290",
"product_name": "PUX",
"video_url": ""
}