{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9296",
"category": "Product > acoustical applications",
"company_name": "Arktura",
"company_url": "www.arktura.com",
"description_html": "TriSoft® acoustical ceiling system adds faceted dimensionality and quiet elegance to interiors. Its angular pyramid faces are composed of our Soft Sound® acoustical material (100% PET plastic with up to 60% recycled content) with a metal substructure. Mix and match TriSoft® available modules and nodes as building blocks, to create any number of horizontal fields or dynamic, angled, or undulating configurations. Easily fill your plan with a triangular grid, scatter panels across spaces, or cluster as desired. The only limit is your imagination. No matter the configuration, TriSoft’s® angled face design deflects and diffuses sound from all directions. With different color options and specially designed attachment brackets, TriSoft® is designed for maximum impact, flexibility, and convenience.<br/><br/>TriSoft® is laid out in a diagrid with elegant, functional faceted forms that offer high-performance sound attenuation and modular flexibility. It is built around a specially designed node quick connect system, to help with ease of install and removability, keeping implementation costs and time to a minimum, while allowing maximum versatility. With TriSoft's® dynamic node option, modules can be rotated up to 27 degrees in section, enabling the creation of large moves or functional undulations. TriSoft’s® carefully considered angular faces are constructed from our lightweight and durable high-performance Soft Sound® acoustical material, NRC rated up to 0.9, with structural armatures and nodes of powder-coated steel. All elements and openings are strategically located to increase acoustic performance.<br/><br/>TriSoft® is designed as a versatile kit of parts capable of achieving a wide range of functional and aesthetic effects. Because of its grid design, with 6” spaces between tiles, TriSoft® easily accommodates both new and existing HVAC, lighting, and life safety systems. TriSoft® is also stylistically flexible, with its Soft Sound® acoustical faces available in over 30 standard color variations and several Arktura wood pattern offerings. Or work with our Solutions Studio® team to build custom graphic, texture, or color that responds to fits the specific needs of a project. TriSoft’s® metal components (frames and nodes) can also be provided in hundreds of standard or custom powder coat colors. Altogether, these qualities allow TriSoft® to serve as powerful aesthetic, integrated, acoustical building blocks, for architects and interior designers.",
"id": "9296",
"product_name": "TriSoft®",
"video_url": ""
}