{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9300",
"category": "Product > architectural products",
"company_name": "SKYLINE DESIGN",
"company_url": "www.skydesign.com",
"description_html": "Skyline Design introduces Transcend<br/>by award winning textile designer<br/>Suzanne Tick. Transcend responds to<br/>changes in how we use and experience space<br/>today, as we seamlessly transition from one<br/>spatial function to the next—between interior<br/>and exterior, from public to private, from<br/>open to quiet areas. Transcend innovates<br/>as it allows six etched and printed patterns<br/>on glass to intersect, overlap or fade using<br/>different techniques, thus facilitating a fluid<br/>experience of interior environments.<br/>Transcend consists of three fading<br/>geometrics: Angled Mesh, Shift Grid,<br/>Lineal Fade and three technical textures:<br/>Disperse, Diffuse and Integrate that relate the<br/>collection to the materiality and construction<br/>of buildings. The subtle fading and textural<br/>variations found in brick, stone, and metal<br/>informed the collection’s development and<br/>were digitally reinterpreted through Skyline<br/>Design’s glass techniques.<br/>The color palette of Transcend evolved from<br/>studying the subtleties of materials like<br/>marble, exposed concrete, and weathered<br/>metals. Each of three neutral color ways<br/>contains nuanced tonalities that parallel<br/>natural effects.<br/>Transcend may be executed in a variety of<br/>techniques, with transparent, translucent<br/>and opaque options, allowing for different<br/>degrees of translucency and privacy while<br/>accommodating a broad pricing spectrum.<br/>The six patterns may be used individually<br/>or layered in combinations. Customization<br/>of scale, color, and technique are also<br/>encouraged. All patterns are available in<br/>sizes up to 60” x 120” and in standard glass<br/>thicknesses.",
"id": "9300",
"product_name": "Transcend™ by Suzanne Tick for Skyline Design",
"video_url": "https://www.youtube.com/watch?time_continue=12&v=qTBV6E_ASss"
}