{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9304",
"category": "Product > furniture: contract/partitions and wall systems",
"company_name": "Muraflex",
"company_url": "https://www.muraflex.com/",
"description_html": "Clean lines and thin profiles set FINO apart from the competitive set. By graphically framing a space, FINO reveals the beauty of every interior condition while enhancing architectural features. Inspired by a minimal design aesthetic, FINO from Muraflex is a streamlined demountable wall solution, providing flexibility and convenience with less bulk. Made from fully recyclable aluminum, Muraflex offers European styling with domestic lead times. As a true demountable partition system, FINO does not require a raised floor and can be readily installed over existing flooring and accommodates multiple types of doors and low-voltage accessories. The minimalist design approach not only defines FINO visually, but strongly informs the performative aspects as well. With an emphasis on enhanced acoustical performance, FINO offers sound isolation with double acoustical seals on both hinged and sliding doors while optional drop seals further isolate sound. With a simple vocabulary of parts, alignment features, and factory pre-assembled doors, field installation and reconfiguration labor is kept to a minimum.<br/><br/>The design of FINO was to minimize the number of parts to the minimum, making installation simple and more efficient in time saving, but more importantly, decreasing the number of part lines that would otherwise detract from its graphic nature. Slim line extrusions with maximum capabilities. Custom built hardware made specifically to fit and be concealed in our profiles. <br/><br/>Glass: Available with 3/8” and 1/2”glass, FINO’s system is engineered to go up to 10’-0” in height. Standard glass panel widths reach up to 4’-4” in both 3/8” and 1/2” glass.<br/><br/>FINO was designed with a sophisticated aesthetic in mind. Its slender profile measuring 2-3/8”H x 1”W welcomes carefully-conceived, transparent gaskets in order to achieve the best STC ratings. <br/><br/>FINO is able to respond to a wide range of acoustic requirements, from STC 36 to STC 42, depending on wall configuration.<br/><br/>Muraflex is a GREENGUARD and GREENGUARD GOLD certified company. FINO frames are made from fully recyclable aluminum as well as Muraflex’s proximity makes FINO a more sustainable option for your project. All attributed credits and LEED points have been pre-calculated and all supporting documentation is available upon request.<br/><br/>Because time is always of the essence during the installation phase of every project, Muraflex developed a packaging and ship-ping system that makes the unloading and placing of extrusions easier as each elevation is packaged separately and identified with the room and elevation number it belongs to. Our glass is also identified in the same way with a tag identifying the room and elevation number. In addition, Muraflex performs any machining necessary in the factory and prefabricates FINO’s framed pivot doors prior to shipping, therefore eliminating any floor assembly from being done in the field, reducing the installation time for FINO to approximately 1 hour per linear foot. To further facilitate its installation, FINO frames allow for total traveling of 1-1/4”. FINO is designed to be installed on bulkhead ceiling in order to offer the best acoustical performance.",
"id": "9304",
"product_name": "Muraflex FINO",
"video_url": ""
}