{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9334",
"category": "Product > furniture: contract/tables",
"company_name": "Walter K.",
"company_url": "www.walter-k.com",
"description_html": "Yesterday a boardroom meeting, today a few colleagues at a brainstorming session, tomorrow a reception for international guests. Conference rooms cater for the number of participants, the function and image of the brand. Flexible conference table systems meet the various requirements of modern working worlds: they are a cost-effective way to change rooms to suit particular uses. The type of furnishings thus mirrors the identity and culture of a company. <br/><br/>Conference-X gives flexibility a shape. With just a few elements, you can create tables of different shapes and sizes – from classic conferences through rows of tables for training sessions and seminars to flexible workbenches of modern office worlds. With all the possibilities ready to adapt practically to a new situation.<br/><br/>The characteristic elegance of the supporting structure of the framework opens up towards the table top. The technology is concealed in entirety in the legs: the table legs can be combined with the table tops quickly and easily without the need for any tools. The patented Easy Handle connection technology is the key: the mechanism clicks into the table top, handles fix the locks – for absolute <br/>security and stability. A well-thought-out optimum of weight, span width and cost effectiveness. Positioning pins guarantee the precise connection of the table tops. <br/><br/>The textile cable mesh and cable duct are simple to assemble flexibly using clips. Unexpected but naturally welcome: the USB power port – for the energy of personal mobile devices. Connectors in the table allow for additional media equipment. The modesty panel provides visual protection, its textile structure helps create a positive acoustic room climate. The resolute geometry of the recessed leg ensures plenty of legroom for everyone sitting at the table.",
"id": "9334",
"product_name": "Conference-X",
"video_url": "http://conference-x.walter-k.com/"
}