{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9363",
"category": "Product > (NEW) In partnership with AIGA: marketing & branding materials",
"company_name": "J+J Flooring Group",
"company_url": "www.jjflooringgroup.com",
"description_html": "The Form+Finish Collection by J+J Flooring Group was inspired by the artisan glazing techniques of the iconic ceramics studio Pewabic Pottery. The location scouting, art direction, photography, design, and production techniques of the lookbook are all carefully crafted to help tell the story of how a finish can become the start of something new. The cover features a specially-designed logo created in the style of a pottery studio mark which is blind embossed to echo the look of freshly stamped vessels. Throughout the piece, brushworked glazing swatches inspired by each product pattern tie the photography back to the process of product development and the influence of Pewabic. Each image was shot in a collegiate art studio and gallery, providing an environment that reinforced the fine art aesthetic of the collection. The layout celebrates the fluidity of the original inspiration while showcasing the product photography and relevant information for each pattern. <br/><br/>The accompanying 3 minute video, shot documentary-style, delves deeper into the product development journey for the collection, succinctly showing how the Pewabic inspiration informed decisions by the J+J Design team from concept to final product.<br/><br/>more images here: https://www.dropbox.com/sh/n4q1t3cjd4zrzpe/AAAW2XsPvT1pS-yOucgs9cSSa?dl=0<br/><br/>Branding Team:<br/>Mandy Lamb, Widgets &amp; Stone, Creative Direction and Design<br/>Liz Tapp, Widgets &amp; Stone, Designer<br/>Brian Daniels, J+J Flooring Group, Art Direction<br/>Jennifer Cox, Moto Films, videographer and editor<br/>Tom Abraham, Abraham Photo, photographer<br/>Kelly King, Abraham Photo, production manager",
"id": "9363",
"product_name": "Form + Finish Collection",
"video_url": "https://vimeo.com/221091610"
}