{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9369",
"category": "Product > furniture: outdoor",
"company_name": "Landscape Forms",
"company_url": "landscapeforms.com",
"description_html": "The GO OutdoorTable brings the culture of the communal table outdoors with access to power on or off the grid. This powerful new platform for outdoor activity creates a focal point and a gathering place in settings where people live, learn, work, care, play and travel. In standing or dining heights, with or without stools or chairs, GO invites people to sit, stand or lean in postures that suit the purpose.<br/><br/>GO has an appealing sleek and simple profile that enables multiple functions. Its smooth, flat top provides an ideal surface for writing while its rounded edges provide a comfortable perch for hands and arms when using laptops and tablets. Its aluminum material dissipates heat, keeping surfaces comfortable to the touch even in hot climates. And its frame, hollow like an airplane wing, channels technology out of sight to power the activities at hand. <br/><br/>GO supports work, study, catching up and hunkering down in seamless transition from indoors to out. A natural for informal, spontaneous use, GO is where the advantages of visual and virtual connection meet the proven benefits to mind, body and spirit of taking it outdoors. <br/><br/>GO is a welcoming destination in a tech-connected world. Long rectangular tables are comfortably “joinable” by individuals and groups. Integrated power invites users to boot up and re-charge. With the canopy, GO becomes a spatial anchor that provides a sense of shelter, glare reduction for better visibility on mobile devices, and capability for lighting, solar power, and monitor mounting.<br/><br/>GO is an innovative solution for keeping people connected in the wide variety of outdoor places where they want to be. It brings access and amenity to corporate and college campuses, shared community spaces, transit centers, healthcare facilities and recreational settings. <br/><br/>GO understands power as the new destination in outdoor space. It is a sophisticated design solution that enables people to recharge and reconnect while deftly managing the technology that makes it possible. Power access is near at hand but cleverly concealed, solar power storage is out of sight, low-profile lighting and solar panel are integrated neatly into the canopy top. Visually and virtually, GO delivers a richer outdoor experience.",
"id": "9369",
"product_name": "GO OutdoorTable",
"video_url": "https://m.youtube.com/watch?v=8q8B9cbgwvQ"
}