{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9381",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "Pioneer Millworks",
"company_url": "http://pioneermillworks.com/",
"description_html": "This custom finished 'blue' version of our Grandma's Attic Reclaimed Mixed Softwoods is part of our Thoughtful Sophistication Collection. Thoughtful Sophistication goes beyond the barn with options that are sleek and modern with a soul, giving designers, architects, builders, and homeowners the freedom to innovate with sheen, color, and texture. Be bold, bright, lustrous, subtle, smooth, textured, patterned, or radiant with the other side of reclaimed wood. There are options for flooring, paneling, and fixtures–all with the eco-loving and LEED benefits that make your projects sustainable. <br/><br/>Grandma's Attic Reclaimed Mixed Softwoods are quite versatile in that they can be left as rugged as the original planks, or smoothed out to replicate a footworn old floor, or custom finished in any color. Character includes deep coffee to lighter brown tones with a variety of knots, original patina, and some saw marks.<br/><br/>We developed this 'blue' product selection for IA (Interior Architects) in Washington, DC. The antique planks found new life as paneling at Applied Predictive Technologies, a subsidiary of a major credit card company. <br/><br/>We do well when we do good. Based on the simple belief that people, planet, and profit work together to ensure a better future, Pioneer Millworks operates on the Triple Bottom Line. We strive to keep our carbon footprint small; our roofs house 100kW solar arrays and our wood scraps keep us warm. One percent of our reclaimed teak sales are donated to conservation causes on the island of Borneo. Our American Prairie sales support domestic barn and historic preservation. Our products are FSC-certified, LEED point eligible, and in many cases diverted from landfills. Your purchases are what makes this crazy ride possible.",
"id": "9381",
"product_name": "Thoughtful Sophistication, Grandma's Attic Reclaimed Mixed Softwoods, Custom Finish",
"video_url": ""
}