{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9389",
"category": "Product > furniture: contract/tables",
"company_name": "Three H",
"company_url": "www.three-h.com",
"description_html": "WorkStops is a temporary place. A coffee stop. A meeting spot. A pondering place, without <br/>barriers and walls, in the daily journey through the new workplace.<br/><br/>Unlike an open table or bench WorkStops provides an extra measure of privacy for concentration. <br/>The built in planter in the middle storage section offers a mini ‘bio-screen’ that brings a touch <br/>of nature for the comfort elements more and more sought after in the office.<br/><br/>With power/data built-in and optional speaker, communication can be on-the-fly without <br/>moving to small closed spaces, cramming into booths or pre-booking conference rooms. <br/>Extemporaneous, open working habits are flourishing. Corporate cultures are searching <br/>to capture the unplanned, café-style approach to creativity and employee interaction.<br/><br/>WorkStops is a simple, elegant design for the open plan featuring a wide range of surface and <br/>storage sizes that help satisfy the growing demand for personalized yet open office settings. <br/>WorkStops also maximizes storage potential while integrating seated focal areas and features<br/>an optional integrated planter that provides an organic privacy screen.<br/>WorkStops worksurfaces could also be easily fixed to walls or virtually any secure <br/>vertical surface. <br/><br/>WorkStops is among several new concepts resulting from a continuing Diversity Program <br/>(visit three-h.com/media for further information) in product design that heightens <br/>personalization in the new workplace.<br/><br/>Workstops features a solid wood leg (in 14 wood stains and 3 solid colors), steel frame <br/>(white and graphite) and curved, organic surface shapes designed by Mark Muller and <br/>Jean Bourassa. WorkStops now features an optional plywood edge and high-pressure laminate <br/>top. 36 colours and wood finishes from the Three H standard program are also available.<br/><br/>The design of WorkStops integrates seamlessly into the Best of Year award winner <br/>Workshelf Private Office and Open Plan system released at NeoCon 2016.",
"id": "9389",
"product_name": "WorkStops™",
"video_url": ""
}