{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9404",
"category": "Product > acoustical applications",
"company_name": "FilzFelt",
"company_url": "www.filzfelt.com",
"description_html": "Designed by Vanessa Busemann and Felix Zebi for German design collective, Cabs Design, Scale is a slotted module system made of cut and folded acoustic fiber composite with a 100% wool felt face. The clever slotted design allows modules to fit together and hold securely with just the friction of the material and mounts to vertical surfaces with magnetic attachment hardware. The acoustically effective, three-dimensional modules come in two sizes and 63 colorways of wool felt to create customizable patterning. The standard dark grey substrate color is intended to create a shadow line and emphasize the three-dimensionality. Scale modules are 100% VOC free and free of harmful substances while the fiber composite is 100% recyclable and the wool felt facing is 100% biodegradable.<br/><br/>In the summer of 2014, an interior design session at the University of Applied Sciences Mainz in Germany brought sixteen students together to investigate, experiment, and collaborate on the design possibilities of textile fiber composites. Their hard work and sharp investigative skills paid o in a wide range of designs. One design by Vanessa Busemann and Felix Zebi was Scale—a modular, plug-in system of cut and folded acoustic scales. The product was exhibited at the International Furniture Fair in Cologne, Germany and the Dutch Design Week in Eindhoven, Netherlands and was wildly well received. Their instructor, Professor Bernd Benninghoff, saw the potential (and had three partners that could put the designs into production) and Cabs Design was born. This German design collective focuses on German-made acoustic fiber composite and 100% wool felt in innovative and unexpected acoustic products.",
"id": "9404",
"product_name": "Scale",
"video_url": "https://vimeo.com/234534337"
}