{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9427",
"category": "Product > furniture: residential/storage",
"company_name": "Reform",
"company_url": "www.reformcph.com",
"description_html": "Note Design Studio and Afteroom are the latest studios to hack IKEA products for Danish brand Reform, with both taking cues from their Scandinavian origins to create minimal sideboards. Reform, which specialises in customising IKEA's Metod and Sektion kitchen cupboards, enlisted the two Stockholm-based studios to create sideboards in hopes of making design-led fittings more affordable. Note Design Studio and Afteroom are two of the biggest Scandinavian designers at the moment and their design philosophy is very much like Reforms. Note Design Studio and Afteroom join a list of studios that have collaborated with Reform to create hacked IKEA furniture. Reform usually focuses on kitchens, but its latest project expands the brand's remit to the living room.<br/><br/>Afteroom, founded by Hung-Ming Chen and Chen-Yen Wei, aimed to create a piece of furniture that would stand the test of time. They used a \"classic\" colour palette of powder blue, off-white, pink blush and black. Doors are textured with shallow grooves, which looks similar to corrugated metal sheeting. Dominating Afteroom's sideboard is the straight lines that are a fundamental element of classical interior design, and the graceful and elegant lines on the sideboard allow it to be easily integrated into any room and simply matched with other furniture for a look that is clean and uncluttered.<br/><br/>Note Design Studio aimed to create a decadent yet contemporary piece through the use of terrazzo and wood. While one cabinet takes its cues from 1970s furniture – combining brown-coloured materials – a second is all-white and offers a contemporary-looking alternative. Note's sideboard plays with the contrast between contemporary design and traditional elegance. It's a sculptural piece through colour, material, silhouette, and its mix of simplicity and indulgent materials.",
"id": "9427",
"product_name": "Afteroom and Note Design Studio sideboards",
"video_url": ""
}