{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9430",
"category": "Product > (NEW) automotive: interiors",
"company_name": "Bugatti",
"company_url": "www.bugatti.com",
"description_html": "The interior of the Bugatti Chiron reflects the stylistic themes of the exterior including the central fin inspired by the Bugatti Type 57SC Atlantic. This approach ensures a symmetrical layout in the interior. <br/><br/>The duo-tone colour scheme is a classic element in Bugatti’s design DNA and finds its strong impression in the Chiron’s interior. At the same time, the design theme of the Bugatti line is expressed most strongly in the interior of the vehicle. For example, the C-shaped line, called the “Bugatti signature line”, which is already a dominant element in the exterior side view of the super sports car, is also taken up in the passenger compartment as a separating line between the symmetrical units for the driver and passenger. The C-shaped light strip emerges from the front bonnet into the passenger compartment as a raised graphic element and merges seamlessly into the dashboard. From here, it flows over the armrest between the seats to the back wall where it rises to the roof liner; at the front, it ends at the rear-view mirror. The homogeneously lit, dimmable light bar is the longest light conductor used in automobiles. This is not the only superlative as it has a surround that is machined from a single piece of aluminium in a complex process. <br/><br/>The cockpit layout of the Bugatti Chiron consistently follows functional requirements. In order to keep the central console as slim as possible and to allow a spacious impression, the climate control and infotainment systems have been separated. Bugatti pilots have all the driving dynamics information they need within their field of vision. The instruments visible through the steering wheel with its central horseshoe emblem include the analogue speedometer, the two supplementary digital displays, with the mechanical speed indicator standing out as a result of its exclusive quality. The speedometer runs up to the magic figure of 300 mph and is a feast for the eyes with the exclusive appearance of a precious Swiss watch. <br/><br/>The steering wheel is a classic example of the perfect combination of form and function. With an entirely new design, the steering wheel is the pilot’s control centre. There is no need to take a hand off the steering wheel in order to operate any essential systems. Two multifunction buttons installed on the left and right sides of the inner rim allow the driver to control all the multimedia features of the car, including navigation, telephone, sound system and many other functions. Below the multi-function button, there is a rotary switch for selecting various driving modes on the left-hand side and the starter button on the right-hand side. At the bottom of the wheel, the driver finds a button to activate the launch control function. Bugatti continues to practise its philosophy of “What you see is what you get“ consistently with the Chiron. This vehicle is constructed in every respect from authentic materials. Parts that look like carbon fibre, aluminium or leather are really made from these materials.",
"id": "9430",
"product_name": "Bugatti Chiron",
"video_url": ""
}