{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9431",
"category": "Product > (NEW) automotive: overall design",
"company_name": "Bugatti",
"company_url": "bugatti.com",
"description_html": "The Chiron is the most modern interpretation of Bugatti’s brand DNA. It embodies the new design language of the luxury brand. The accentuated lines of the Chiron were inspired by the legendary Bugatti Type 57SC Atlantic, the most famous creation of Jean Bugatti, design genius and son of the founder Ettore. Achim Anscheidt, Director of Design at Bugatti, describes his task as follows: “In view of our extraordinary brand and the task in hand, it would not be adequate to simply draw a few fashionable lines. In terms of design, the Chiron was an opportunity to develop most of the basic elements required for an unambiguous stylistic concept from the extreme technical requirements of the vehicle with a view to underlining the performance of this unique super sports car.” The lines of the new car show that the balance between “beauty” and “beast” needed in a modern Bugatti has been significantly shifted in the direction of aggression. This can be seen from the considerably more dynamic side line, the central fin that gives an impression of acceleration, the elongated rear wings and the more dynamic angle of attack. The most distinctive design features of the Chiron are the Bugatti horseshoe with the eighteyed front end, the C-bar on the side, also known as the “Bugatti signature line”, the central fin as a reminiscence of the central seam on the Bugatti Atlantic, which extends over the entire vehicle to the rear, and the redesigned rear end with the newly developed rear light, which is unique in the automobile industry and gives the Chiron its distinctive Bugatti signature. Most of these elements have a technical background and have been designed to fully accentuate the growing performance requirements of the Chiron. Apart from the lamp housings, the front end with the eight-eye face features a highly effective air inlet for the cooling of the front wheels and brakes and therefore performs an important aerodynamic function. That also applies to the Bugatti signature line. It impressively reflects Bugatti’s design ethos which ideally calls for shapes and lines to be derived from technical requirements. Its positioning was defined by the need to improve engine ventilation and ventilation performance in general at this point. The rear with its all-round trailing edge is the clearest example of form following performance in the design of the Chiron. It is shaped to ensure lower drag and to meet the requirements posed by the high power output, the new top speed and heat dissipation from the rear end. The suction effect behind the rear end allows the extraction of hot air collecting in the engine compartment. “This principle of form following performance defines the Chiron as an authentic technical product and a fascinating automobile sculpture,” Anscheidt adds. “Both for our customers and for us as designers, it is important for a Bugatti to have a certain stylistic longevity so that it is still perceived as precious in 10 or even 50 years.”",
"id": "9431",
"product_name": "Bugatti Chiron",
"video_url": ""
}