{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9434",
"category": "Product > window treatments",
"company_name": "Lutron Electronics",
"company_url": "www.lutron.com/palladiomshades",
"description_html": "Lutron Palladiom Shading System is a beautiful, revolutionary shading solution that features highly crafted exposed hardware envisioned for the world’s most exquisite homes. Lutron’s classic Palladiom keypad was the inspiration for the design language, exemplified by the brackets and hembar for the Palladiom Shading System – minimal in form and deliberate in its simplicity. It’s a visually striking solution that offers industry-leading shading performance and reliability, as well as seamless integration with Lutron’s HomeWorks QS system and other third-party control solutions. <br/><br/>Every Palladiom shade bracket begins with a solid piece of extruded aluminum -- brushed by hand and crafted to last a lifetime. All visible elements of the system, from the bracket to the fastener covers to the tube-bearing sleeves, have all been hand-finished to create a continuous and clean look. Palladiom Shading System also showcases a new bottom rail, designed to ensure a minimal, balanced aesthetic, and one that completely disappears when the roller shade is fully open. The Palladiom Bottom Rail beautifully features Lutron-patented Intelligent Hembar Alignment, designed to synchronize the movement of multiple shades in a space.<br/><br/>Capable of covering a 12-foot-by-12-foot window with a startlingly slim two-inch tube, Palladiom shades have an innovative tube geometry that results in a structure that is remarkably rigid, yet extremely light. Designed from end to end to cleverly conceal all wiring and programming interfaces, Palladiom Shading System offers symmetrical ½” light gaps to complete the clean aesthetic.<br/><br/>For more than 50 years, Lutron has been a pioneer in technology, innovation, and design. Palladiom Shading System embodies the best of our capabilities. In the precision of its workmanship and the wonder of its technology, Palladiom Shading System is a thing of beauty.",
"id": "9434",
"product_name": "Palladiom Shading System",
"video_url": "https://vimeo.com/236149509/d4a2ed663c"
}