{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9440",
"category": "Product > textiles: residential",
"company_name": "Samuel & Sons",
"company_url": "www.samuelandsons.com",
"description_html": "Oberon is an exquisite collection of passementerie woven with the finest metal yarns. The collection houses a compendium of unique, documentary-inspired patterns and a series of 21st century designs employing innovative appliqué, velvet and hand-knotting techniques. <br/><br/>Oberon honors the aesthetic of traditional grandeur in the fine detailing of its borders, intricate gimp, various beaded fringes and tassel tiebacks. Offered in six hues of metal, the collection is composed of a 1.25” Oberon Beaded Fringe, a 2” Oberon Teardrop Beaded Fringe and an elaborate 4” Triple Beaded Fringe. In addition to the Oberon 2” Tassel Fringe, there are 4.75” and 8.25” Bullion Fringes. Complementing the fringes are both woven and twisted cords which transcend time and are suitable in both traditional and contemporary applications.<br/><br/>The Oberon Crete is an open weave created through a series of concentric circles of guiperes, while the Oberon Braid’s small cords form a geometric ogee pattern that glides across its finely woven ribbed ground. An intricate ½” Oberon Gimp and a lush 1” Oberon Brush Fringe complete this assortment.<br/><br/>The Oberon Double Tassel Tieback and Key Tassel have sleek bullion skirts and finely wrapped tapered molds with an overlay of hand-tied netting that have been loomed with the finest denier metal yarns. A complementary Oberon Rosette completes this ensemble. Among the signature pieces in the collection is the Oberon Double Quilles Tieback which features an ornate series of round and tapered molds with overlays of finely knotted netting. <br/><br/>The pattern of hand-tied satin knots in the Constellation Border is derived from an abstraction of star positions in the night sky. The Mercury and Eclipse Borders, though minimalist in character, have surfaces that appear to have been gilded in silver and gold. The Luna Border employs a sumptuous texture in its dense cut pile velvet which is then enhanced with fine metallic embroidery. The Solar Border is an abstract hand-blocked print with embroidered metallic silhouettes. The extraordinarily sculptural character of the Orbit Border is created through a series of laser cut, matte metallic oval foils with hollowed centers that are appliquéd to a finely woven twill border. The ovals create the illusion of something otherworldly as they seem to hover effortlessly above the border’s surface. Saturn’s rings are portrayed in its namesake Saturn Striped Border as individually-spun metal cords stripe across its ground. <br/><br/>The Oberon Collection exudes luxury in the realm of traditional grandeur and exquisite detailing while at the same time using the minimalist simplicity of fine metal thread to articulate the most innovative contemporary borders. The ethereal natural of the materials used in this collection and versatility in interpretation make this an exquisite part of any designer’s library.",
"id": "9440",
"product_name": "Constellation Border/Oberon Collection",
"video_url": ""
}