{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9448",
"category": "Product > materials, treatments and surfaces (including paneling)",
"company_name": "Forms+Surfaces",
"company_url": "www.forms-surfaces.com",
"description_html": "BermanGlass Levels Kiln Cast Glass unites the best of two worlds: cast and laminated glass. The line draws on Forms+Surfaces’ expertise in two arenas – artistic cast glass design and sophisticated glass lamination technologies – to create a line of architectural glass with unrivaled visual potential.<br/><br/>By definition, Levels glass is architectural kiln cast glass laminated with color, graphic or image interlayers. Each design pairs an artisanal texture, cast on a handcrafted mold and fired in a kiln, with an interlayer optimized specifically for that texture. <br/> <br/>The Levels collection consists of twelve standard designs: three textures, each with one of four different color, graphic or image interlayers optimized specifically for that texture.<br/><br/>TEXTURES shape the surface appearance of Levels glass designs. Each texture has distinctive visual characteristics, tactile qualities, and ways of reflecting or refracting light. The glass itself is inherently clear.<br/><br/>INTERLAYERS add color and enrich the optical experience of each design. Three types of interlayers produce varied visual effects: Color interlayers feature solid color and offer the most subtle end results. Graphic interlayers expand the design complexity by introducing graphics in a single color. Image interlayers incorporate multiple continuous tone colors and have the most dramatic impact.<br/><br/>Aesthetically, the sculpted surfaces of Levels glass capture light on and through the glass; the interlayers add a sense of depth and dimension and accentuate plays of light, texture, color, and motion. Viewed up close or at a distance and as light and viewing angles change, each design is as captivating as it is dynamic.<br/><br/>From an applications standpoint, Levels glass gives designers new ways to bring the handcrafted beauty of textured cast glass into spaces of all kinds – including elevator interiors – and makes it easy to move cohesively across a project, from design concept to installed reality.<br/><br/>Levels Kiln Cast Glass can be fabricated in any size up to 53” x 108” (1346mm x 2746mm). Standard glass thickness is a nominal 6mm. End use determines finished glass dimensions.<br/><br/>BermanGlass Levels Kiln Cast glass is available exclusively in Forms+Surfaces’ LEVELe Wall Cladding and Column Systems, LEVELe Elevator Interiors, and LightPlane LED Panels. Each system is designed to address mechanical details like trim pieces and mounting assemblies, so designers don’t have to worry about resolving these aspects; they can simply focus on the creative process.<br/><br/>Levels Kiln Cast Glass can be easily cleaned and maintained using a mild soap or glass cleaning solution. With the decorative interlayer behind the glass, rather than surface-applied, the glass surfaces are easy to clean.<br/><br/>The use of UV-resistant inks in the printing process helps ensure that Levels interlayer colors and designs retain their integrity over time. The laminated structure also protects the interlayer artwork from surface damage and fading.<br/><br/>Levels Kiln Cast architectural glass complies with major building codes as laminated safety glass and meets numerous U.S. and Canadian industry standards.",
"id": "9448",
"product_name": "BermanGlass Levels Kiln Cast Glass",
"video_url": "https://vimeo.com/218206156"
}