{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9452",
"category": "Product > acoustical applications",
"company_name": "USG Corporation",
"company_url": "https://www.usg.com",
"description_html": "Whether someone is an architect or a designer, s/he invests a lot in the spaces created and expects them to perform at the highest level. When it comes to clean, seamless ceilings, commercial architects and interior designers desire a monolithic look that also has the acoustical properties of traditional tile and grid. <br/><br/>Until now, there hasn’t been an acoustical drywall solution—an ideal blend of form and function at an economical installed cost. As a result, architects and designers have been forced to compromise on ceiling system decisions, limiting from the overall experience and impact a ceiling can have in a space. <br/><br/>Form and Function<br/>The ceiling is a critical surface that can manage the acoustical performance and enhance the overall aesthetic.<br/><br/>With the combined expertise in wallboard, joint finishing, ceilings, and sound performance engineering, USG has created a new integrated system: USG Ensemble™ Monolithic Acoustical Ceiling System. This system imparts the uninterrupted look of drywall with the high-performance acoustics of traditional lay-in ceiling panels. <br/><br/>Key features include:<br/>•\tNRC .70 and CAC 44<br/>•\tLR .85, from the spray-applied fine texture finish<br/>•\tClass A rated<br/>•\tLow VOC-emitting material<br/>•\tMeets or exceeds minimum ceiling performance requirements for traditional acoustical ceilings<br/>•\tIdeal for high-end applications, including lobbies, atriums, executive/board rooms, museums — or other spaces with multiple hard surfaces<br/>Installation<br/>The USG Ensemble™ Monolithic Acoustical Ceiling System is constructed using methods similar to conventional drywall installation and finishing techniques, and is installed by USG certified contractors.<br/><br/>How it Works<br/>USG Sheetrock® Brand Ensemble™ panels are highly engineered gypsum panels specially modified to allow the ceiling to both absorb and block sound energy. The joints are finished using USG Sheetrock® Brand finishing products. <br/><br/>USG Ensemble™ Spray-Applied Finish is installed as the final surface and is acoustically transparent, allowing sound energy to pass through the perforations into the plenum where it is absorbed by the USG Ensemble™ High-NRC Backer Panels. <br/><br/>The components of this patented system are designed to work together so that NRC and CAC performance is optimized.<br/><br/>For more information, visit usg.com/ensemble",
"id": "9452",
"product_name": "USG Ensemble™ Monolithic Acoustical Ceiling System",
"video_url": ""
}