{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9462",
"category": "Product > furniture: outdoor",
"company_name": "Forms+Surfaces",
"company_url": "www.forms-surfaces.com",
"description_html": "Designed to bring a distinctly F+S point of view to café seating, Avivo Bar Stools coordinate with the rest of the Avivo family, a line that includes chairs, standard-height tables in various sizes, and a bar-height table. <br/><br/>Avivo Bar Stool frames are beautifully detailed cast aluminum; seats and backs are formed aluminum. As with the other Avivo designs, the bar stools have an ultra-durable powdercoat finish in standard or custom colors. <br/><br/>Bar stool seats and backs may be specified with or without one of three standard perforation patterns—Riva, Stella and Vento. The perforation patterns match those available for Avivo Bar-height Tables, Tables, and Chairs. <br/><br/>Avivo Bar Stools, like the rest of the Avivo family, are an elegant way to bring people together in gathering spaces of all kinds: restaurants and bars, resorts and hotels, corporate campuses, retail centers, healthcare facilities, rooftop terraces, and more.<br/><br/>The product’s crisp detailing ensures it’s at home in the most refined interior spaces, while its durable materials and construction weather outdoor settings with ease. The diversity of material and finish options makes it easy to tailor Avivo Bar Stools to a wide range of aesthetics. <br/><br/>Avivo Bar Stools are available in standard and custom powdercoat colors. Standard F+S powdercoat colors have been formulated to be ultra-durable for improved long-term wear and resistance to weather. They’re also anti-graffiti, allowing marks from paint, permanent markers, and dirt to be removed easily, without harsh cleaners. Standard F+S powdercoat colors are no-VOC; custom powdercoat finishes are no- or low-VOC, depending on color selected. <br/><br/>Avivo Bar Stools are designed for free-standing use with Avivo Bar-height Tables or with bar-height tables or counters by others. Avivo Bar Stool feet have UV-stabilized, wear-resistant polypropylene glides.<br/><br/>For efficient storage, Avivo Bar Stools can generally be stacked 3 high, depending on surface levelness, winds, and other site conditions. UV-stabilized, wear-resistant polypropylene bumpers are included on the underside of each seat to protect when stacking. <br/><br/>Avivo Bars Stools have a high recycled content and are fully recyclable. Avivo Bar Stools are low maintenance, have a long product life cycle, and are built to last.",
"id": "9462",
"product_name": "Avivo Bar Stools",
"video_url": ""
}