{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9463",
"category": "Product > lighting: architectural",
"company_name": "Targetti",
"company_url": "http://www.targetti.us",
"description_html": "ZEDGE is the new Targetti LED step light. The design has been reduced to its core with its minimal proportion and nuanced scale. The relationship between the vertical face and angled illuminated surfaces define a discrete product that creates a strong architectural statement. It is available as three frames for three distinct lighting effects:<br/>•\tFLOOR WASHER, a real step-marker with a “deep” effect on the floor;<br/>•\tFLOOR WASHER + HALO, where the typical direct component of the step-marker is combined with an indirect glow that characterises the design of the fixture. When it is installed at floor level (typical installation) the top part, besides being able to produce a halo effect becomes a kind of marker thanks to the uniformly illuminated opal diffuser;<br/>•\tLOUVRE, from two precise cuts where the design is highly stylized, produce two inclined planes. High visual comfort is ensured given that the optical unit is hidden from view.<br/>Each frame produces a particular lighting effect, each with maximum visual comfort.<br/><br/>Crafted with a specially designed linear LED module, ZEDGE delivers uniform step lighting illumination in a choice of 3000K and 4000K. The low voltage power supply system (24V) and IP66 rating make ZEDGE ideal for installation in humid environments such as SPAs or directly around swimming pools. The compact step light is dimmable to create the ideal environment for stairways, hallways and other indoor &amp; outdoor dry and damp applications.<br/><br/>Crafted with a custom designed spring mounting system for ease of installation and the choice of three different optics that deliver three distinct lighting effects all interchangeable within one frame.",
"id": "9463",
"product_name": "ZEDGE",
"video_url": "https://youtu.be/-dOImoFBaag"
}