{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9464",
"category": "Product > accessories",
"company_name": "Atelier Swarovski Home/Andre Kikoski Architect",
"company_url": "akarch.com",
"description_html": "We are thrilled to submit our Lustra Collection with Atelier Swarovski Home to the Interior Design Best of Year Award, Products: Tabletop category. As architects, we designed the Lustra Collection of keepsake boxes and candle holders, each in three sizes and three colors, to create a unique and dramatic interplay of form, material and the seductive sparkle of crystal. We embraced this opportunity to craft sophisticated objects for everyday use at an accessible price point and bring joy to their users because every detail of their expression is so thoroughly and carefully considered.<br/><br/>The Lustra Collection brings our architectural sensibility of beauty, innovation, and visual complexity to the design of tabletop objects. By experimenting with dimension on a smaller scale, we create a luminous dialogue of geometry and form. Each piece is a micro work of architecture, a highly sculptural and crafted exploration. At the core of this design, we celebrate the way crystal refracts light through the geometry of each sinuously curved keepsake box lid and faceted candle holder base. The entire collection is carefully designed to accentuate crystal’s innately seductive optical properties.<br/><br/>We designed keepsake boxes in three sizes, priced from $300 to $600, animating a curvilinear lid of sculptural faceted solid Swarovski crystal against the rectilinear geometry of a cube-like base -- in lustrous bronze, copper or pewter. As both base and lid capture the refraction of light, this play of geometries and materials is subtle and luxurious, as well as striking and dramatic. Grouped together in multiple combinations, their sculptural presence creates a dynamic visual interplay.<br/><br/>For the candle holders, we designed three sizes that transform iconic crystalline geometries, scaled appropriately and suitably for the tabletop. The cuts and facets of each individual shape vary to manipulate the light each receives uniquely. The candle holders are priced under $200, and offered in three different ambient colorways -- Dark Satin, Golden Shadow, and clear Crystal -- to work in every setting, style and décor. Each piece is a stand-alone statement, when grouped in multiples of shapes and/or colors, they become an animated, shimmering composition.<br/><br/>Our Atelier Swarovski Home Lustra Collection of sophisticated, custom-designed table top objects offers limitless opportunities for both joy and expression. The pieces are architecture that celebrates light and materiality, bringing sculpture to the home at accessible price points. It’s a pure expression of materiality and artistry.",
"id": "9464",
"product_name": "Atelier Swarovski Home Collection: Lustra by Andre Kikoski Architect",
"video_url": "https://youtu.be/ILM9IwVrQVU"
}