{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9506",
"category": "Product > acoustical applications",
"company_name": "Carnegie",
"company_url": "www.xorelartform.com",
"description_html": "Expanding on the success of their Xorel Artform acoustical panels, Carnegie has now released new 3D Xorel Artform options for 2017. <br/><br/>Four new 3D panel shapes; Diamond 3D, Square 3D, Waveline 3D and Hex3D bring an ever-broadening palette of design opportunities, creating an entirely new aesthetic for this versatile product line. The new 3D panels can be used alongside existing shapes flat to create a truly dimensional wall or ceiling installation. <br/><br/>With the line now comprising 7 shapes across 19 sizes available in more than 300 standard Xorel patterns and colors, endless install options truly become works of art, all while performing acoustically. Xorel Artform 3D panels are wrapped with Carnegie’s leading sustainable Xorel fabric. Panels are also available in Biobased Xorel, a proprietary Carnegie product and the world’s first-ever plant-based textile.<br/><br/>The Xorel Artform 3D design system offers a platform in which designers can creatively incorporate high performance, sustainable materials into an acoustically challenged built environment. The panels also include a plant-based textile option - Biobased Xorel, the world’s first plant-based textile. Cradle to Cradle certified, the panels have a low environmental impact and reduce carbon footprint during new builds or renovations. <br/><br/>No other prefab modular wall panels on the market offers the level of creative possibility or high performing, sustainable textile solutions like Carnegie’s Xorel Artform, which meets stringent codes across education, healthcare, hospitality and office environments.<br/><br/>As spaces become more crowded and open-floor plans continue to be on the rise, innovative and artful acoustic solutions have become top of mind for architects and designers alike. Carnegie’s new panels provide a complete, stylish acoustic solution that’s customizable from start to finish, including simple mounting options: a quick-grab adhesive or Velcro application.",
"id": "9506",
"product_name": "Xorel Artform 3D",
"video_url": ""
}