{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9507",
"category": "Product > wall covering: tile and stone",
"company_name": "Crossville",
"company_url": "https://crossvilleinc.com/",
"description_html": "Silk—such a luxurious and time-honored fabric—is the inspiration for Crossville's Seta, a line of gauged porcelain tile panels. The surface visual of these impressive, large format tiles reveals the replication of delicate silk strands woven throughout the nuanced appearance of the line’s four color options. Perfectly dressy but equally casual, these 1mx3m panels are high fashion. Yet make no mistake, as visually captivating as Seta is, underlying strength and technical performance are the hallmarks of the line. Though only 5.6mm in thickness, Seta’s polished style will perform beautifully on interior walls in demanding commercial installations. These innovative panels may even be applied directly over previously installed tile or stone, offering great savings of time, labor, and budget—helping interior design projects to be as smooth as silk.<br/>Learn more at crossvilleinc.com/laminam-by-crossville/<br/><br/>ENVIRONMENTAL STATEMENT<br/><br/>Laminam by Crossville collections are excellent choices for those seeking green surfacing solutions for design projects. Laminam porcelain tile panels are responsibly made with natural raw materials in one of the most advanced, environmentally sound manufacturing facilities in the world, located in the heart of Italy’s renowned tile production region. Reflecting global standards in sustainability, the Laminam manufacturing process uses leading edge technology and recycling practices and incorporates innovative methods to minimize waste and generate energy without depleting the earth’s resources. <br/><br/>Laminam products, created to meet Green Building Council standards, support specifiers’ goals for durable, healthy environments. The porcelain tile panels do not release emissions or substances into the environment and require minimal maintenance, contributing to indoor air quality and providing ease of cleaning long term. The panels’ superior performance characteristics lead to long product lifecycles—reducing the need for replacement. However, should panels be removed, they can simply be unbacked, milled, and recycled back into the tile production stream. <br/><br/>As porcelain tile panels’ popularity grows, the green innovations at the Laminam manufacturing facility advance, as well. The plant’s recently installed photovoltaic roof has already produced 1 GWh of energy and is capable of generating an estimated 1.387 GWh within a year, cutting the CO2 emission into the atmosphere by 617 tons and empowering the Laminam plant to self-generate 15% of its energy requirements.",
"id": "9507",
"product_name": "Seta",
"video_url": ""
}