{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9509",
"category": "Product > furniture: residential/storage",
"company_name": "Ethan Allen",
"company_url": "ethanallen.com",
"description_html": "Character Chest<br/><br/>Picture this: Mickey Mouse and his dog Pluto—taking a selfie, no less! We fell for the original Disney image the moment we laid eyes on it. We loved its sweet humor and knew it deserved a proper showcase. Just like that, we took a Disney idea and transformed it into a brilliant statement piece. Finished in matte black and set on a sleek brushed nickel base for a contemporary vibe, our three-drawer chest proved the perfect backdrop for the enchanting panel that stole our hearts—and will surely steal yours.<br/> Crafted from white oak and maple veneers and a stainless steel base<br/> Matte black painted finish (Mickey's Ears 711) with brushed stainless steel base<br/> Features dovetail drawers and soft-close slides<br/> Inset and full-depth storage drawers<br/> Levelers<br/> A tip-restraint kit is included with this item. It includes safety-tested hardware, a nylon strap, and mounting instructions. Furniture tip-over can cause serious injuries; for your safety, please affix this item securely to the wall.<br/><br/>Ethan Allen | Disney Collection<br/><br/>Designed by Ethan Allen and inspired by Disney’s iconic characters, Mickey Mouse and Minnie Mouse, the impressive collection includes over 500 fun, yet sophisticated, styles for the modern family. Combining Ethan Allen's core strengths of craftsmanship, style, and quality with Disney’s rich storytelling, we’ve created an experience that kids and parents will truly love and appreciate. The collection is designed for every room in the home—and everyone who lives there.<br/><br/>It includes a range of whimsical, fashionable, functional looks for nurseries, kids’ rooms, playrooms, and family living spaces. Consumers will also find an array of accessories such as art and wall décor, rugs, lighting, bedding, and chic, clever storage pieces. Many styles feature cool nods to retro Disney designs, playful shapes, and signature Mickey and Minnie details. Many styles are available in a selection of fabrics and finishes and handcrafted in the company’s own North American workshops.",
"id": "9509",
"product_name": "Character Chest / Ethan Allen | Disney Collection",
"video_url": "https://youtu.be/sp-ysevN5nI"
}