{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9511",
"category": "Product > furniture: contract/desking",
"company_name": "Humanscale",
"company_url": "www.humanscale.com",
"description_html": "Humanscale, the leading brand in ergonomic design and manufacturing, has pioneered the sit/stand revolution with its popular Float and QuickStand workplace solutions. Continuing in its commitment to functionality, simplicity and longevity, Humanscale is now introducing the next generation of sit/stand desks: QuickStand Eco. The new height-adjustable solution is sleek and easy to use. It’s made with healthy, sustainable materials and utilizes minimal parts and pieces, limiting it’s environmental footprint. Ready for action right out of the box, QuickStand Eco features a simple setup and is easy to transport, making it a flexible option for both corporate and home offices. The effortless height adjustability encourages users to sit and stand more often and can be integrated with Humanscale’s innovative OfficeIQ software, which sends periodic alerts when it is time to adjust one’s position. The simple, clean design complements a variety of workplaces. <br/><br/>Starting at $399, QuickStand Eco is the most accessible sit/stand model from Humanscale yet; making it an affordable wellness solution that will blend into any work environment, improving employee performance and helping to develop a more active workspace. The launch of QuickStand Eco coincides with a new wave in flexible workplace design, as many companies continue to move away from the “one size fits all” standard and now offer sit/stand workstations by request. With an increased public interest in health and well-being, more and more employees seek solutions that will make their workday both more active and more comfortable.<br/><br/>QuickStand Eco is designed to accommodate users of varying heights. It can hold up to 35 lbs, is available in laptop, single or dual monitor configuration and offers 18” of adjustability. With a selection of sit/stand offerings for all types of workplaces and styles, Humanscale ensures workers can now find the workspace solution best suited to their individual needs, and stay healthy in the process.",
"id": "9511",
"product_name": "QuickStand Eco",
"video_url": "https://www.youtube.com/watch?v=yqArGEXUPas&t=1s"
}