{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9546",
"category": "Product > flooring: carpet/rugs",
"company_name": "Tai Ping",
"company_url": "houseoftaiping.com",
"description_html": "Tai Ping, beloved internationally for its design-driven custom handmade carpets, launches its first collaboration with Hong Kong-based inter-disciplinary design firm Lim + Lu. Two editions of Reform, a geometric rug created to be adaptable to different spaces and usages, were exhibited at Design Shanghai between 8-11 March, ICFF in New York City between May 21st to 24th and Maison et Objets in Paris between September 8th to 12th, 2017.<br/><br/>Architects Vincent Lim and Elaine Lu were inspired by everyday surroundings, and questioned why carpets had to be rectangular and static. “We wanted to create rugs that can be transformed to fit in different spaces,” says Lu. “Reform means to make changes in order to improve something. We wanted to create a rug that would be able to conform to any space without sacrificing its inherent character. The result was the creation of a modular rug consisting of three modules that would allow users to piece together their perfect rug no matter the shape of their space.” <br/><br/>Additionally, Lim + Lu looked to traditional colour wheels and overlapping circles to introduce colour into a room. “Colour charts of overlapping circles normally associated with visual teaching was the first inspiration for the rugs,” notes Lim. “We started with overlapping circles and experimented with a range of colours, textures and patterns reminiscent of marble and precious stones.” <br/><br/>Reform I illustrates how different materials can be combined, with a colour palette of pastel pinks and blues that mimic stone against metals such as brass and silver. The mixture of materials include different yarn count and pile height wool, dull silk, spun silk, flax and shiny fine lurex. Techniques such as cut and loop in different pile heights, twisted yarn, overtuft loop and sculpting—a combination of hand carving, bevelling and embossing—were used to achieve a medley of textures. Reform II features colour blocking with vivid hues on 100 percent wool. Both rugs were entirely handcrafted in Tai Ping’s Xiamen artisan workshop.<br/><br/>“We were inspired by Tai Ping’s technical capacity—its craftsmanship and attention to detail were amazing,” enthuses Lu. “They were very open to our ideas, and expertly carried complicated designs.” Lim believes that Reform exemplifies the range of what Tai Ping can achieve through juxtaposition of materials and techniques. “You really get the rug’s tactile quality with the different textures you feel under your feet,” he states.",
"id": "9546",
"product_name": "Reform by Lim+Lu",
"video_url": ""
}