{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9550",
"category": "Product > architectural products",
"company_name": "Planika Fires",
"company_url": "http://www.planikafires.com",
"description_html": "The most sophisticated product in the fireplace industry.<br/>Its uniqueness consists in combining the patented BEV Technology™ with the system of integrated decorative elements. Without any contact between the fuel and the flame, no smoke, smell or ash are produced. Also, the need for any hard connections is eliminated. All of it ensures maximum comfort, safety and of course… the long line of the most beautiful natural flames closed behind glass. Something that the industry has never seen before. <br/><br/>There are several features that make it stand out.<br/><br/>FLA 3<br/>Its heart, Fire Line Automatic 3, is the most advanced bio fireplace available on the market. With the patented BEV Technology™, intelligent features, and remote control solutions, the user can benefit from a very efficient and safe fire.<br/><br/>XL<br/>To guarantee maximum comfort of use, we equipped the fireplace with a large external fuel tank. What it does is provide a noticeably longer burning time, compared to other standard products. You can now enjoy up to 25 hours of continuous fire.<br/><br/>SUITE<br/>FLA 3 XL Suite Logs is a glass-enclosed fireplace, providing a very stable and safe flame. Our customers are free to choose from three different glazing options, including one, two or three-sided fire view.<br/><br/>LOGS<br/>The fire can be even more beautiful with our set of accessories. The burner of the fireplace was developed in such a way as to allow for integrating it with a system of very authentic-looking decorative elements, including ceramic eco logs, black vermiculite and glowing embers.<br/><br/>http://www.planikafires.com/ethanol-fireplaces/fla-3-xl-suite-logs/",
"id": "9550",
"product_name": "Fire Line Automatic 3",
"video_url": "https://www.youtube.com/watch?v=JbizKAiT7RA"
}