{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9561",
"category": "Product > furniture: outdoor",
"company_name": "Sutherland Furniture®",
"company_url": "www.sutherlandfurniture.com",
"description_html": "The Great Camp collection is a line of Adirondack chairs from Sutherland Furniture®. Designed by Joe Doyle for John Hutton™, the chairs are a sophisticated, luxurious take on the classic Adirondack design of the Northeast, putting them in a class all their own. With grand, regal features and a commodious yet sleek design, this collection truly makes a bold statement in terms of presence and scale.<br/><br/>Inspired by the Great Camps of the Adirondack Mountains, Sutherland's Great Camp collection embodies the 19th Century notion of \"roughing it\" in the wilderness while surrounded by luxury. The collection combines the rustic, Americana feel of the original Adirondack chair with the high-end, modern design style and quality of Sutherland craftsmanship.<br/><br/>These are not your typical Adirondack chairs. There are hundreds of variations of this outdoor staple, but the chairs Sutherland has created for the Great Camp collection truly set themselves above the rest in terms of design refinement. They are slick and distinguished with a simple execution, and their volume and scale gives them a grand presence as well as an inviting, all-enveloping sense of comfort. They perfectly emulate the high-end feel, classic architecture and mountain charm of the Great Camps.<br/><br/>The chair highlights the remarkable outdoor performance characteristics Sutherland Furniture® is known for. The chairs merge the ideas of style and comfort together, featuring wide, straight arms, an ample and inviting depth and a back-to-seat pitch angle ideal for lounging and relaxing in the great outdoors. The new collection is offered in both teak wood and powder-coated aluminum frames in 20 different colors designed to add a specific distinction to any outdoor design aesthetic or atmosphere.<br/><br/>The Great Camp Chair can go where the original wouldn't dare. Sutherland and Joe Doyle wanted this chair to be both laid back and stately, and a permanent fixture in the landscape. They put curves only where anatomy demanded, all else is clean and straight. They also made the pitch more erect and borrowed the tall narrow back from an old favorite, Thomas Lee's Westport Chair. “The result, we think, is an Adirondack Chair after finishing school.\" – Joe Doyle",
"id": "9561",
"product_name": "Great Camp Adirondack Chair",
"video_url": ""
}