{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9567",
"category": "Product > seating: contract/lounge",
"company_name": "Sossego | Modern Brazilian Design",
"company_url": "http://sossegodesign.com",
"description_html": "Sossego is the exclusive US distributor of Brazilian designer Aristeu Pires. Following a long and eminently successful career in computer engineering, Aristeu discovered his passion and exceptional talent for creating modern furnishings from warm Brazilian woods. For 15 years his designs have brought everyday comfort to the finest hotels, restaurants and workspaces across South America where contemporaries in the A+D community have dubbed him “King of Chairs.” It’s all about exceptional styling: comfort for the body and beauty to the eye.<br/><br/>Pitu collection: <br/>The Pitu collection by Aristeu Pires extends the incredible culture of Brazil to North America: relaxed, warm, and welcoming, but always with a purpose. Aristeu observed how happy and comfortable his baby daughter was in her infant swing or perch seat that hooks to a tabletop. She played in it happily for hours. He thought, “there has to be a chair for adults that brings such comfort!” “Pitu” is the sweet Portuguese nickname for Aristeu’s youngest daughter. The collection is intended to spark joy as it comfortably envelops the guest who has the pleasure of using it.<br/><br/>Hand finished of rich Brazilian hardwood, plush down, and supple leather, the Pitu is engineered with a swing reminiscent of a suspended rope bridge or hammock. Cushion available upholstered in natural Brazilian leather or over 100 fabric options and is supported by a canvas swing. <br/><br/>5 axis CNC machining paired with old world craftsmanship, create Pitu’s seamless joinery and tactile appeal of Brazilian jequitibá and louro freijó hardwoods. Jequitibá is a sustainably harvested Brazilian hardwood (akin to fine maple or royal mahogany) that features a natural luster and clear grain structure. Louro freijó is referred to as “Brazilian walnut” for its rich grain and is sustainably harvested with strict oversight by Brazil’s Ministry of Environment. Available in 14 wood finishes to grace the home, office, boutique hotels or lobbies. <br/><br/>Pitu lounge chair<br/>Pitu is the lounge chair you’ll never want to leave. With generous width, the Pitu lounge chair facilitates ease and relaxation in lobbies, collaborative offices, and community areas. <br/><br/>Pitu armchair<br/>Comfortable as a hug, it offers just a slight bit of swing to the body, adjusting as the sitter moves within it. The Pitu armchair creates unrushed human interactions at dining tables, restaurants, and ancillary workspaces.<br/> <br/>Pitu chaise lounge chair<br/>The Pitu chaise lounge chair is excellent for alone time after a long day's work. It offers deep comfort and was inspired by the hammock that some Brazilian families will hang in every room of their house including their outdoor space. Ergonomically designed for reclining and dreaming of a soothing Brazilian rainforest or faraway beach, this chaise lounge chair calls for a living room, break room, or getaway space.<br/><br/>Pitu armchair 36.0\" H 25.1\" W 27.3\" D 21.3\" SH<br/>Pitu lounge chair 38.0\" H 29.8\" W 35.2\" D 20.1\" SH<br/>Pitu chaise lounge chair 33.46\" H 29.72\" W 36.61\" L 19\" SH<br/>Pitu footstool 17.71\" H 27.95\" W 19.68\" L",
"id": "9567",
"product_name": "Pitu Collection",
"video_url": "http://sossegodesign.com/designers/"
}