{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9577",
"category": "Product > (NEW) automotive: interiors",
"company_name": "General Motors",
"company_url": "http://www.chevrolet.com/suvs/traverse-mid-size-suv",
"description_html": "Traverse customers have many needs for their vehicle’s interior. It must be roomy and comfortable for all passengers, with plenty of space to store both large and small items. <br/><br/>Customers in this segment want the utility of a truck with the beautiful design of a car. The interior design team used long, horizontal, solid truck-like forms as the foundation for the interior theme, but then softened those forms and wrapped them in premium materials and accented with décor and jewelry-like details.<br/><br/>The touch-screen center display and controls are oriented vertically to make them easy to see and use. Infotainment and climate controls are grouped separately in ergonomic, easy-to-find locations. The display was carefully placed to make sure it was within a comfortable reach and to eliminate unwanted glare. One of the most popular features available to our customers is the storage compartment hidden behind the touch-screen display.<br/><br/>The 2018 Chevy Traverse features an enhanced Smart Slide seat that lets customers tilt and slide the second-row passenger-side seat forward for easy access to the third row, even when a child car seat is mounted in place.<br/><br/>Another unique storage area is the subfloor compartment located beneath the rear cargo floor, which offers about 3.2 cu. ft. of additional space. When customers need to transport larger items, they can fold down the second- and third-row seats to create a flat load floor with the largest cargo area in this class.<br/><br/>The upholstery demonstrates great attention to detail, with precise stitching at the seams, and the durability that customers need and expect. Premium materials are in areas customers are most likely to see and come in contact with. The more durable materials are located down low, where shoes and cargo materials are likely to rub against them.<br/><br/>The large décor accents throughout the interior are finished with Galvano chrome, which has a soft satin appearance, while the smaller details and controls are accented with bright chrome. Piano Black is used throughout all trims on the infotainment center, outer vents, and cluster hood. The result is a very clean and modern appearance.<br/><br/>Traverse is a family vehicle, so most customers will have kids sliding in and out of the vehicle on a regular basis. Soil-repellant Premium Cloth and high-wear bolsters offer customers the durability they need. Premier and High Country trim levels offer a more premium look with perforated leather-appointed seating. <br/><br/>With Jet Black anticipated to be a volume-selling color, designers focused on making it as expressive as possible. On models equipped with Jet Black Cloth seats, added an embellished insert with a unique heathered appearance that not only looks softer and more inviting but also helps hide dirt and debris. This new styling element was applied to the other two fabric colors as well.",
"id": "9577",
"product_name": "2018 Chevrolet Traverse",
"video_url": "http://media.chevrolet.com/media/us/en/chevrolet/bcportal.html/currentVideoId/5542942609001/currentChannelId/Most%20Recent.gsaOff.html"
}