{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9597",
"category": "Product > lighting: architectural",
"company_name": "Ketra",
"company_url": "www.ketra.com",
"description_html": "Ketra has developed the most advanced lighting system in the world that precisely mimics the color temperature and intensity of Natural Light. Ketra LEDs dynamically shift throughout the day, providing the full range of sunlight—crisp and bright during the day, soft and warm at night. The inventive lights provide wellness benefits of Natural Light to indoor occupants, synchronizing their circadian rhythms to support better health and rest. Ketra’s tunable-spectrum LED offers infinite color choices, including saturated colors as well as pastels. Easily adds color to the home without having to repaint—great for entertaining guests, kids’ parties, and more. <br/><br/>Ketra has created a new category of lighting: Natural Light. Ketra offers the most accurate, fully tunable light source with the ability to produce full-saturated, pastel, and high CRI white light. The core element of the Ketra system is a custom semiconductor driver chip, which allows the user the option of controlling the intensity and color spectrum of all Ketra lamps and luminaires. The technology in each lamp also offers the system the capability of being completely wirelessly controlled. This industry-leading chip offers built-in optical feedback, custom emitter and optics, mechanical housings, embedded software to control the lights and manage a redundant wireless network as well as commissioning tools and calibration software. <br/><br/>Aside from its advanced technology, Ketra is also the leading voice in setting standards and education for wellness. Ketra supports wellness benefits derived from the human body’s natural “body clock,” the circadian rhythm, which tells our bodies when to wake and sleep and help to regulate physiological processes. Ketra is the best solution to meet the Delos pioneered WELL Building Standard® (WELL), the first building standard to focus exclusively on human health and wellness for indoors. WELL combines design and construction best practices with evidence-based medical research on human wellness.<br/><br/>Ketra lights are fully customizable, offering complete control to the end user. Users can adjust the lighting at any time—not just at the time of the fixture schedule. Ketra is the only lighting company to offer multiple warm dimming curves for a single product, enabling deeper control in any environment. All lamps are individually addressable through wireless control, regardless of how they are physically wired.",
"id": "9597",
"product_name": "Ketra Lighting System",
"video_url": "https://vimeo.com/197429579"
}