{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9633",
"category": "Product > lighting: pendant (single bulb)",
"company_name": "BuzziSpace",
"company_url": "www.buzzi.space",
"description_html": "Designed by Sas Adriaenssens for BuzziSpace, BuzziChandelier fuses stunning visuals with sound-absorptive materials. <br/><br/>It is a reimagined take on the classic Moorish lantern creates a bold focal point while adding acoustic softness to any space. The fixture’s shade, constructed out of two layers of BuzziFelt -- the brand’s signature acoustic felt, made of 100% upcycled plastic bottle waste -- dampens noise, making BuzziChandelier an ideal acoustic solution for large, open plan environments. <br/><br/>This is not limited to just contract settings, but extends to restaurant and hospitality spaces as well – with its shade’s arabesque design, inspired by Adriaenssen’s travels in Granada, Spain, and new marble-like finishes, BuzziChandelier also provides ambiance and sophistication by casting artful light and shadows. Hang just one pendant for a singular design statement, or group them in multiples for added romance. <br/><br/>BuzziChandelier is available with a plain or perforated shade, and comes in a variety of colors, including two new marble-inspired printed finishes, Emperador and Carrara. <br/><br/>Since their introduction of the original BuzziLight in 2008, BuzziSpace has been a pioneer in the acoustic lighting field – central to the brand’s core mission, acoustics and lighting have been found to greatly influence well-being and productivity in the workplace. The re-launch of BuzziChandelier not only represents BuzziSpace’s commitment to reimagining and refining their designs so as to provide the best acoustic lighting products on the market, but also represents the company’s evolution beyond the modern office. By fusing exceptional acoustic performance – a hallmark of the brand– with a dual-function form that serves both as a lighting fixture and provider of ambiance, BuzziChandelier addresses today’s growing demand for versatile, dynamic, multi-functional designs that can fit into a wide range of environments – commercial, contract, or residential. <br/><br/>And with its sustainable, eco-felt shade, BuzziChandelier also represents BuzziSpace’s continued commitment to sustainable design. From the company’s beginnings in 2007 to today, their team follows the philosophy of “cradle to cradle,” which stands for recycling and environmentally friendly processing of materials and the conscious use of raw materials and energy. Ecology, acoustics, and flexibility – these are three principles that guide BuzziSpace’s approach to every product they produce, as illustrated by BuzziChandelier’s multi-faceted design.",
"id": "9633",
"product_name": "BuzziChandelier",
"video_url": ""
}