{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9634",
"category": "Product > acoustical applications",
"company_name": "BuzziSpace",
"company_url": "www.buzzi.space",
"description_html": "Designed by Martin Lesjak and Anastasia Su of 13&amp;9 for BuzziSpace, BuzziPleat is a series of acoustic solutions that delivers light and sound control with an architectural edge. It is available in two styles: BuzziPleat Ripple and BuzziPleat Edel.<br/><br/>Blending beauty and performance into one adaptable collection, these large-scale, yet lightweight sculptural pendants are innovative for their unorthodox stylistic -- and in turn, functional—influences. Made of sound-absorbing BuzziFelt, the BuzziPleat series features reinterpreted ancient techniques used in fashion design, like smocking and pleating, to maximize surface area, allowing both configurations to deliver exceptional acoustic performance.<br/><br/>Specifically, the traditional craft of hand pleating—the principle of gathering up volume, then reining it in—is applied to freely construct a complex architectural form. The BuzziPleat framework relies on tension of its own fabrication, rather than an internal support structure. Fashion has long adopted this method to create neat, yet flexible forms. Here, the application brings an organic quality to an otherwise synthetic material.<br/><br/>“Pleating brings movement to still objects, animating them from within,” said Martin Lesjak, lead architect and designer, 13&amp;9. “It can therefore be seen as the symbol of a major social shift towards a rebounding society giving movement and elasticity to structure.”<br/><br/>In addition to serving as an acoustic solution, BuzziPleat can also be configured with an optional light source add-on to marry sound control and illumination into one multi-purpose product. Both configurations in the series can be affixed to a wall or suspended from the ceiling, and come in two available sizes: a 100 cm or 150 cm diameter. Users can also choose from a range of BuzziFelt and BuzziFabric combinations, ranging from neutral tones to bright hues, so that their BuzziPleat model can meet the individual aesthetic needs of any given space.<br/><br/>BuzziPleat represents BuzziSpace’s continued commitment to acoustic solutions for the workplace, as well as for commercial spaces, hospitality settings, and more. From a larger perspective, however, BuzziPleat also represents the brand’s evolution towards highly functional designs that meet the increasingly dynamic needs of work and life, without sacrificing the refined aesthetics that make BuzziSpace’s products so versatile and universally appealing. By fusing exceptional acoustic performance – a hallmark of the brand– with a dual-function form that can serve both as a lighting fixture and eye-catching focal point, BuzziPleat is a synthesis of BuzziSpace’s rich history in acoustic design, and its continued commitment to reimagining designs to be more functional and fun.",
"id": "9634",
"product_name": "BuzziPleat",
"video_url": ""
}