{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9662",
"category": "Product > flooring: carpet/rugs",
"company_name": "kinder MODERN",
"company_url": "www.kindermodern.com",
"description_html": "CODY HOYT + LORA APPLETON<br/>kinder MODERN Founder and Creative Director Lora Appleton launched the Artist Collection with renowned American ceramicist Cody Hoyt. Appleton, known for award-winning geometric rugs and innovative child design, worked to skillfully interpret Hoyt’s renowned ceramic patterns into an incredible collection of bespoke luxury rugs. Made from 100% hand-tufted New Zealand wool and featuring light carving that accentuates the patterns’<br/>subtle details and preserves their serene flow, these exceptional pieces transform the humble carpet into true art for the floor. Before transitioning to ceramics, Brooklyn-based Cody Hoyt trained as a printmaker and a painter. His process-based approach leads to fascinating and beautiful explorations in material, pattern, and color. Hoyt prides himself on his non-traditional process and takes inspiration from a wide range of art, design, and literature.<br/>Appleton was particularly interested in the ways in which Hoyt’s patterns transcended material; she knew they would be just as powerful in wool as they are in clay. The complex creative process began by subtly reworking the elements of his vessels to create new forms for the floor. The collaboration honors the integrity of the original designs as exceptional transformation of his work in this new and exciting medium. As specialists in creating distinct designs that expand functional pieces into heirloom objets d’art, kinder MODERN is thrilled to offer this engaging collection. All styles are customizable in bespoke color combinations, drawn from the ARS color system. Custom sizes are also available.",
"id": "9662",
"product_name": "kinder MODERN Artist Rug Collection: Cody Hoyt + Lora Appleton",
"video_url": ""
}