{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9664",
"category": "Product > flooring: hard",
"company_name": "Armstrong Flooring",
"company_url": "www.armstrongflooring.com",
"description_html": "The new Spettro flooring design is part of the Natural Creations with Diamond 10 Technology Mystix collection. This design captures the textural and visual softness of carpet with easy maintenance and endless creative options. Each design comes in two sizes, 18 inches by 18 inches and 6 inches by 36 inches and is available in four colors. Coordinate these colors across our luxury flooring collection or our full portfolio. Also new for 2017, Armstrong Flooring offers customizable visuals to help you bring your creative vision to life with the Create Your Own Color Luxury Flooring program. Combining two favorites from the Natural Creations® with Diamond 10® Technology Mystix Collection, Spettro and Mixer, Create Your Own Color Luxury Flooring stretches your imagination. Spettro captures the textural and visual softness of carpet, while Mixer offers a playful palette of colors. Both feature the patent-pending Diamond 10 Technology which offers the highest scratch, stain and scuff resistance in the industry, keeping your floors looking newer longer. Natural Creations with Diamond 10 Technology Spettro and Mixer from our Mystix Collection are low-cost maintenance solutions with the option to polish.<br/><br/>Natural Creations® with Diamond 10® Technology was designed in direct response to commercial interior performance needs and design trends. Featuring patent-pending Diamond 10® Technology which harnesses one of nature’s strongest substances, cultured diamonds, Natural Creations with Diamond 10 Technology has reset the industry standard by offering the industry’s highest scratch, stain and scuff resistance.",
"id": "9664",
"product_name": "Spettro by Armstrong Commercial Flooring",
"video_url": "https://www.armstrongflooring.com/commercial/en-us/resources/commercial-flooring-video-library/video/5249097424001.html"
}