{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9669",
"category": "Product > furniture: contract/systems",
"company_name": "SnapCab",
"company_url": "www.SnapCab.com",
"description_html": "Is it possible to have an open workspace environment and privacy? Collaborative areas and distraction-free zones? It is with the SnapCab® Pod. Easily assembled, moveable and configurable, the Pod empowers you to create a space that works for you.<br/><br/>The SnapCab Pod S (1-2 people), Pod M (2-4 people) and Pod L (4-6 people) deliver quiet, private spaces for phone calls, video conferencing, meetings, focus time and more. Step inside, close the door against noise and disruptions, and get to work. With simple, streamlined designs and high-quality materials your open workspace just got a lot more flexible.<br/><br/>Sound-masking design. The Pod features seals around the door, panels on the inside and outside walls, an acoustical felt ceiling, and carpeting on the floor that all help to dampen sounds.<br/><br/>Lighting. Low-profile LED fixtures offer indirect light, and the drop ceiling design with downlights disguises the perimeter light fixture for a clean look.<br/><br/>Exhaust fan and venting. You’ll have plenty of ventilation while you work, since the SnapCab Pod is equipped with a fan. The fan also provides white noise, helping with sound suppression. Both lighting and fan are motion-activated for maximum convenience and efficiency.<br/><br/>Power source and USB charging. Feel free to power up your devices, plug in your computer and settle in for a productive session. A bit of quiet can help you recharge your own batteries as well.<br/><br/>Add-on accessories. Opt to include bench seating and a wall-mounted solid phenolic laminate table. The furniture is custom-made, simple, and right-sized for your needs.<br/><br/>You get to play Tetris. Several Pods in different sizes could create a well-finished office space in 48 hours or less. Further, you have the freedom to configure your space as efficiently and effectively as possible—like a game of Tetris. For example, you position a few Pods corner to corner, you create additional nooks in between. Mix it up for a perfect fit.<br/><br/>They roll. Effortlessly. Move the Pod where you want it, lock it in place and start using. It’s that simple. If you need to move it, whether across the room or to a new site, it’s as easy as moving a desk.<br/><br/>SnapCab® was founded on our commitment to craftsmanship and simplified installation in the early 80’s. The SnapCab® Pod continues this approach with its simple, yet beautiful design which allows for quick assembly. Add in the shortest lead-time in the category, and you have the ability to build<br/>out or convert vast spaces in tight time frames. Electrical and ventilation components come assembled for a simple plug and-play installation eliminating your need for specialized labor.",
"id": "9669",
"product_name": "SnapCab Pod",
"video_url": "https://vimeo.com/214697203"
}