{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9675",
"category": "Product > kitchen: appliances",
"company_name": "BlueStar",
"company_url": "www.bluestarcooking.com",
"description_html": "BlueStar®, manufacturer of high-performance appliances for the home, is now offering a 36-inch Induction Cooktop, featuring advanced cooking technology with maximum power and precision, a coveted option for serious home cooks who no longer have to sacrifice performance when electric cooking is the only or preferred choice. The BlueStar® 36-inch Induction Cooktop combines the sleek design and efficient performance of induction with the precise control and power that is the hallmark of the BlueStar® brand. The induction cooktop offers the most powerful single burner in the industry, thanks to the exclusive Power Boost feature: a 5,500 Watts burner can bring one gallon of water in a large pot to a rolling boil in only three and half minutes.<br/>The seamless two burner bridging technology is perfect for grilling or searing with the unique dual zone plancha/grill, sold separately. The cooktop offers exceptional temperature control with 12 cooking settings.<br/>BlueStar’s induction cooktop features Smart Power Management that automatically calculates and disperses the maximum amount of power across the number of burners in use. The home chef also has the ability to kick start the cooking process on all cooking zones, boosting the power immediately for no-wait cooking and optimal flexibility. There are two levels of even, low temperatures, a true simmer burner at 200 degrees and a warming burner at 150 degrees. Foods like sauces and melted chocolate can be held at a simmer for hours without scorching.<br/><br/>Robust safety features include a “knob lock” and pan detection technology so the unit will not start unless a pan is on a burner. No heat is wasted during cooking because energy is supplied only to the cooking receptacle.<br/>The simple, yet stunning design offers unmatched customization in the category, with the opportunity to personalize the unit with 190 colored knob options and 10 different metal trims, including brass, copper and stainless steel. The cooktop comes standard with sleek, easy-to-use stainless steel knobs and “natural white” display lighting.<br/><br/>Inspired by Chefs, Powered by BlueStar®, for Seamless Cooling to Cooking<br/>BlueStar® cooking and refrigeration products are designed for discerning home cooks who demand high performance and great design in their own kitchens. The company’s spectrum of highly innovative appliances stays true to an authentic commercial-style kitchen experience at home. In business since 1880, the Pennsylvania-based manufacturer specializes in handcrafted gas ranges, cooktops, electric and gas wall ovens, complementary kitchen ventilation hoods, premium refrigeration, and now induction.",
"id": "9675",
"product_name": "BlueStar 36” INDUCTION COOKTOP",
"video_url": ""
}