{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9682",
"category": "Product > kitchen: appliances",
"company_name": "BlueStar",
"company_url": "www.bluestarcooking.com",
"description_html": "BlueStar®, manufacturer of high-performance kitchen appliances, is raising the standard once again for ultra-premium home kitchens with the introduction of a new Double Electric Wall Oven, bringing its iconic brand of true professional performance to electric cooking. The essence of the BlueStar® brand is putting the tools of the professional restaurant chef within reach of the home cook. Now, home cooks can design a complete electric kitchen with authentic, commercial-style accruements. Combine the new double electric wall oven with the new 36-inch Induction Cooktop, which features the most powerful single burner in the industry, for a complete commercial-grade electric kitchen.<br/><br/>New Double Electric Wall Oven: Professional Performance, Unmatched Capacity<br/>The BlueStar® Double Electric Wall Oven offers unmatched performance and capacity for the home chef. The powerful 2,500 watt bake element and the intense 5,000 watt infrared broiler provide restaurant-quality results every time. The 1800 watt heat assist element in the back of the cavity means faster preheating and less time waiting. Twelve different cooking modes including Bake, Convection Bake, Roast, Convection Roast, Broil, StoneBake™, Proof and Sabbath, provide numerous cooking options for unmatched versatility. <br/><br/>The oven features True European Convection for optimal heat circulation and faster and more even results. A precision temperature probe offers the ideal way to obtain the perfect temperature for any meat. The extra-large cooking cavity is perfect for roasting, baking and broiling for a crowd and can accommodate a full-size 18″ x 26″ commercial-size baking sheet. <br/><br/>A professional-quality, integrated artesian baking stone can used to create perfectly crisp breads and pizza which can be cooked right on top of the baking stone for restaurant style results. The stone mimics the conditions in brick ovens by absorbing heat from the oven to bake bread – and practically anything else – directly on top of the heat source. The built-in temperature probe on the baking stone helps insure perfect results every time.<br/>The exclusive, eco-friendly Continu Clean™ helps keep the oven cleaner without extreme temperatures or harsh cleaning chemicals. Continu Clean™ works every time the oven is on, saving the hassle of a dedicated cleaning cycle. Or, if preferred, the available Self Clean mode can be used so that the oven is cleaned automatically by a special high-temperature setting.<br/><br/>Like all BlueStar® products, the BlueStar® Double Electric Wall oven can be tailored to suit any individual style or cooking preference. To maximize the cooking experience, the oven is available in single or double drop down doors, and chef-preferred French doors: pull the left door open and the right one swings open automatically, adding functionality and style. A new feature, an intuitive, single controller, makes it easy to operate both the top and bottom oven. <br/><br/>Customize any BlueStar® Electric Wall Oven with over 750 colors and finishes. Even the knobs are available in 190 colors, and both knobs and trims are offered in 10+ designer metals. You can “Build Your Own BlueStar” online.",
"id": "9682",
"product_name": "BlueStar Double Electric Wall Oven",
"video_url": "https://youtu.be/RstclyzG25k"
}