{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9700",
"category": "Product > wall covering: paper",
"company_name": "Nottene",
"company_url": "http://nottene.net",
"description_html": "Our 2016 collection, called Matchsticks, features the signature and delicate motifs which are a continuation of our interest in finding patterns in the small details of everyday life. Rather than print the patterns digitally, we aim to push the boundaries of what is possible in screenprinted wallpaper. After creating the initial design in the studio and establishing the color palette, we work to see how much of the details and pleasant imperfections can be brought out during the creation of the screens and printing process. The idea is that the combination of hand-drawn patterns, delicate line work, textured brush strokes and the imperfection of the handmade results in a wallpaper that brings a sense of intimacy through simplicity to a residential or commercial space.  <br/><br/>Kim started a daily drawing practice to simply appreciate the things around her, and now our studio work comes from a practice of storytelling through drawing. We are interested in the connection of everyday things with the broader experience of society and life. One of our primary interests is in home and community and how we navigate the public and private worlds. We believe decorative objects are an important tool for communicating how we as a society believe things are organized and should be celebrated. Places we travel, food we eat or things in our home all become content for the drawings we make which eventually become the wallpaper our studio handprints. Connecting to a place through drawing the objects in it and collecting them into a group on the wall, allows viewers to connect to the everyday things around them in new ways. Developing this emotional connection is integral to our process and working with objects in the home or in specific locations is an exciting challenge to find and expose the stories that have always existed.",
"id": "9700",
"product_name": "Towns/Matchsticks Collection",
"video_url": ""
}