{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9767",
"category": "Product > flooring: carpet/modular",
"company_name": "EGE AMERICAS INC",
"company_url": "WWW.EGECARPETS.COM",
"description_html": "Rawline Scala features the unique combination of a woven carpet construction and beautiful patterns dyed onto the textile by ege’s advanced colour technology. The rawness of the flat woven look and feel with all the acoustical and practical advantages on top make the carpet material superior to any interior design.<br/><br/>Inspired by universal textiles<br/>The basic and linear look of denim. The classic stitch of a gentleman’s suit. Folded and pleated fabrics with interesting reflections of light and dark. Worn vintage textiles with embedded stories and colours changed by time. Rawline Scala comprises three design themes, Minimal, Reflex and Heritage, each celebrating the eternal textures favoured by fashion and different cultures in all times. The references to the textiles’ textures and weaving structures are evident in the design expressions embracing three pattern scales from small to medium and large. The collection urges to explore space with subtle and artistic patterns that can be mixed and<br/>matched but also stand beautifully alone.<br/><br/>The green choice<br/>Rawline Scala is produced from regenerated and regenerable ECONYL® yarns partly based on used fishing nets that are collected, cleaned and reborn as strong carpet yarns. All carpet tiles come with ege’s patented and Cradle to Cradle CertifiedTM Ecotrust backing created through an innovative technique transforming water bottles to a soft yet strong PET felt with superior acoustic performance.<br/><br/>Facts<br/>Rawline Scala combines the minimalist flat woven carpet construction with patterns of various scales. The collection comes in 11 designs and five colours (beige, grey, black, blue and green) as broadloom, tiles and Figura – ege’s innovative tile concept in geometric shapes. We have signed up Rawline Scala in the carpet/modular category as the 48x48 cm tiles and 96x96 cm tiles, not to forget the Figura tiles, all offer extremely beautiful floorings.<br/><br/>Link to Rawline Scala film: http://image.egecarpet.com/files/shared/78751/1691459c366260b4a5/ (Rawline Scala.mp4)<br/><br/>Link to images: http://image.egecarpet.com/files/folders/shared/4407/3123759c36675ef731/",
"id": "9767",
"product_name": "Rawline Scala",
"video_url": "https://www.youtube.com/watch?v=nmgwUiLV0U0"
}