{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9774",
"category": "Product > flooring: carpet/broadloom",
"company_name": "EGE AMERICAS INC",
"company_url": "WWW.EGECARPETS.COM",
"description_html": "Taking their successful and long-standing collaboration to the next level, Monsieur Christian Lacroix and ege carpets enter the floor together with a collection of expressive and rich carpet designs.<br/><br/>Lush motifs with embedded personal meaning<br/>The Atelier collection features 16 designs and three design themes – Textile, Mineral and Gravure – each of them inspired by the passions of Monsieur Christian Lacroix. Having clear references to fashion, the Textile designs are created from a personal archive of ethnic and folk fabrics transformed into patterns of patchwork, velvet draping and paisleys being one of Monsieur Christian Lacroix’s favourite design elements through all times. Fascinated by collecting stones, Monsieur Christian Lacroix brings the beauty of this natural element into<br/>the collection in the Mineral design theme embracing beautiful mosaics of beach stones, chaussé stones and quarry tiles. Finally, Gravure features fantasy engraving motifs inspired by monuments from Monsieur Christian Lacroix’s home town, 1900 century fashion with birds and butterflies as well as mountain landscapes in Provence.<br/><br/>A limitless world<br/>Regarding the collaboration with ege carpets Monsieur Christian Lacroix explains: “When I started collaborating with ege carpets 13 years ago, I discovered that anything was possible – I was entering a limitless world! To me the carpet is a way of communicating: it’s like words, it’s like music.” The designer further states: “A carpet is like make-up too, it changes the surface. It makes the room larger, wider or smaller. It underlines what you want to express. Just as classic music gives something formal to a movie, a classic carpet adds a conservative and nice<br/>atmosphere to your room. It’s like the make-up of music.”<br/><br/>Monsieur Christian Lacroix<br/>Born in Arles on 16 May 1951. After studying classical literature and art history in Montpellier, then at the Sorbonne and the Ecole du Louvre, Monsieur Christian Lacroix migrated towards costume design and created his own fashion house in 1987. Since the 1980s, he has put his signature to the costumes and scenography of numerous theatrical, opera, ballet and museum productions. Since 2000, he has also been involved with more industrial design projects: TGV trains, hotels and cinemas.<br/><br/>ege carpets<br/>ege carpets is one of Europe’s leading companies in the design, development and manufacture of unique, high-quality carpets with focus on sustainability. The company was founded in 1938 and uses the most advanced technology in the carpet industry. ege carpets is doing its utmost to minimise the environmental impact of carpet production. Furthermore, ege carpet’s declared objective is to contribute to a more sustainable world by continually striving to improve how we handle environmental, social and financial challenges, for the benefit of future generations.",
"id": "9774",
"product_name": "Atelier by Monsieur Christian Lacroix",
"video_url": "http://image.egecarpet.com/files/folders/shared/3119/1113559c372f5393a4/"
}