{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9794",
"category": "Product > lighting: table",
"company_name": "BOVER BARCELONA LIGHTS",
"company_url": "https://www.bover.es/",
"description_html": "The Drip is born of conversations and reflections, of drawings on terraces of restaurants and of being carried away by the idea that \"one thing leads to another\". That's how a design with more than ten references is reached that satisfies both residential and contract sector needs. A family of lamps that speak the same language but in which each one has its own personality.<br/><br/><br/>With the Drip, the goal was clear from the beginning: make a cascade pendant lamp. One of the most outstanding features of the Drip is its diversity of sizes. We find versions of 1, 6, 7, 12, 24, 36 and 48 lights only in suspension. The biggest has a diameter of 1 meter, which gives it a great visual impact. Any of them, although they are drawn from standard measures, can be customized at the request of the client. And so, starting from this initial premise, ideas of new typologies began to emerge: several wall lamps, two table lamps, a floor version with a support tray and USB connection, and also a specific solution for libraries.<br/><br/><br/>Drip's small screen is made of borosilicate glass, finer and more delicate than blown glass. \"I wanted the material to be very tasteful, almost like a candy,\" says Christophe. The choice of glass is intimately related to the light that creates the Drip. In the words of its creator: \"I was looking for a very bright light, and the translucent glass and its shape contribute to it. The light source is an LED that is hidden so that light is the only protagonist. Then, when the light is projected and reflected in the materials that are found along the way, it creates a set of sparkles and shadows. All of which enriches the object. \" Its light is intimate, but it also has a practical utility for those who are nearby. \"I always bear in mind the space where a lamp is going to be located because that is where it becomes meaningful\" explains Christophe. The Drip is intended for application in both residential and contract projects. Thanks to its multiple applications it works very well in all hotel spaces, in public areas as well as in rooms.<br/><br/><br/>The relationship with the Drip, as Christophe says, goes in crescendo. First, it seduces you from a distance, enough for you to want to get closer to it. Once you are by its side you like its design, and that motivates you to take the last step and turn it on. Then, the magic reaches its maximum splendor",
"id": "9794",
"product_name": "Drip Biblio",
"video_url": ""
}