{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9816",
"category": "Product > seating: contract/lounge",
"company_name": "National Office Furniture",
"company_url": "www.nationalofficefurniture.com",
"description_html": "Kozmic’s combination of spines, seating, and tables provides the ability to configure a solution that is comfortable for all users, whether they are in a space for a short period of time or an extended stay. By offering versatile shapes and thoughtful elements, it can easily be transformed to provide solutions for any space and any user. From the nomadic worker to the focused student, Kozmic’s sitting, leaning, standing, and perching capabilities are uniquely comfortable. <br/><br/>The conceptual idea of Kozmic grew from observations of everyday people. National’s design team researched and observed how people interact with each other, with technology, and with furniture. By recognizing that individuals prefer spaces that allow them to be comfortable in a variety of positions and choose what works best for them, our design team developed a versatile solution that is flexible, comfortable, and provides easy access to technology. <br/><br/>Kozmic’s spine-based design allows for creative vignettes, large and small. Kozmic can be arranged to accommodate architectural elements and style needs, as the design supports both linear and angular configurations. The integrated seating option incorporates the spine with seating to create a seamless transition. The back of the spine and seating elements provides contoured support for seated users at a comfortable, ergonomic angle. <br/><br/>Impromptu seating options allow the user to truly design the space around their preferences. Mobile or static impromptu seating elements can be added to create a more versatile vignette. Users have the flexibility to adjust the layout to fit their specific needs. <br/><br/>Worksurface height tables or standing height bistro tables accommodate the need for additional work space. With sizes that accommodate single users or small groups, Kozmic provides spaces for gathering, collaborating, or for a quick touch down. <br/><br/>Optional power and USB outlets provide straightforward solutions to the ever-growing need to plug in and charge up. These grommets are integrated into Kozmic’s design, making them easy to locate and simple to use. <br/><br/>Kozmic provides flexible solutions for today’s ever-changing spaces. Interact, focus, power up, or touch down with Kozmic.",
"id": "9816",
"product_name": "Kozmic Collaborative Collection",
"video_url": "https://www.youtube.com/watch?time_continue=24&v=Ua5X9WIu11s"
}