{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9819",
"category": "Product > lighting: chandelier (multiple bulbs)",
"company_name": "HOLLY HUNT",
"company_url": "www.hollyhunt.com",
"description_html": "This September, Alison Berger, the renowned glass artist, will introduce a new body of work, called the Lyra series. This new series expands Alison’s existing body of work – drawing on historic forms to create a contemporary expression -- but continues Berger’s career-long exploration of the qualities of light.<br/><br/>The Lyra constellation of stars, which is said to look like Orpheus’ lyre, inspired the name of this series. Berger has long been inspired by the cosmos, as well as by the instruments that man has devised to see the unseen, such as microscopes and telescopes. As always, she marries her interest in scientific esoterica with her profound talent as a designer to create new forms and finishes that create an interplay with light.<br/><br/>The entire Lyra Series is based on a delicate bronze armature, from which hang circular lenses and reflectors. The series is scalable – from a one “star” sconce to a 7’4” structure with 13 “optical comets” (called Lyra No. 13) – with two sizes in between, Lyra No.3 and Lyra No. 5. Hand-carved optical crystal lenses surround the filament bulb, to capture and magnify the kinetic energy of illumination, and mirror reflectors punctuate the illumination.<br/><br/>For the first time in her career, Berger is experimenting with colored metal finishes for this line. In addition to her standard medium amber bronze patina, this series includes lacquered bronze in oxblood, white, and green with golden bronze highlights. These finishes lend the pieces an additional sense of luminescence; they all seem to glow from within. In this use of color, Berger was inspired by tones of the velvet boxes that were used to transport these devices of measurement.",
"id": "9819",
"product_name": "Lyra Chandelier",
"video_url": ""
}