{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9837",
"category": "Product > bath: accessories and hardware",
"company_name": "USG & Infinity Drain",
"company_url": "http://usgid.com",
"description_html": "The USG Durock™ Brand Infinity Drain™ Shower System pairs high-performance USG Durock™ Brand Shower System components with decorative linear drains from Infinity Drain. This completely waterproofed, linear drain shower system is easier and faster to install than traditional shower construction. This innovative system offers architects, designers and contractors one complete waterproof shower installation made easy. <br/><br/>With traditional mud bed shower construction, there are several steps needed to form a consistent pitch or perfectly flat substrate. From mixing and forming screeds to pulling the mortar, it can take up to three days to install a shower bed. The USG Durock™ Brand Infinity Drain™ Shower System offers a bonded waterproofing system made for tiled shower installations that eliminates many traditional application challenges. <br/><br/>The USG Durock™ Brand Infinity Drain™ Shower System is comprised of: <br/><br/>USG Durock™ Brand Infinity Drain™ Linear Drain Kit<br/>•\tDecorative linear grates that are available in four finishes—satin stainless, polished stainless, satin bronze and oil-rubbed bronze—with adjustable feet to match tile thickness<br/>•\tPitched channel, channel support, hair strainer and lift-out key included<br/>•\tIntegrated waterproofing membrane<br/><br/>USG Durock™ Brand Infinity Drain™ Shower Floor<br/>•\tFor use with the USG Durock™ Brand Infinity Drain™ Linear Drain Kit<br/>•\tHigh density foam that installs more easily than conventional shower bases made of dry pack mortar<br/>•\tOptimal two percent sloped design that is available in three sizes<br/><br/>USG Durock™ Brand UltraLight Foam Tile Backerboard (Wall)<br/>•\tStrong, lightweight, waterproof and vapor retardant<br/>•\tRugged facer on extruded foam core<br/>•\tCuts easily, is dust free and fastens without washers<br/><br/>USG Durock™ Brand Waterproofing Membrane and Accessories<br/>•\tPliable and durable waterproofing membrane<br/>•\tMinimizes build up at seams<br/>•\tResistant to tears and low permeability rating makes it ideal for wet areas, including continuous-use steam showers<br/><br/>The USG Durock™ Brand Infinity Drain™ Shower System is where smarter design meets peace of mind.",
"id": "9837",
"product_name": "USG Durock Brand Infinity Drain Shower System",
"video_url": "https://www.dropbox.com/s/9tjayga2ufb4b38/USG-ID_InstallHowTo60sec.mp4?dl=0"
}