{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9839",
"category": "Product > flooring: tile and stone",
"company_name": "Porcelanosa",
"company_url": "www.porcelanosa-usa.com",
"description_html": "Porcelanosa is proud to introduce a new addition to their vast number of products, the Seedwood collection. Seedwood pays tribute to the work and dedication of sophisticated craftsmen to create everlasting pieces of art. With its high quality and beauty, it is a wood-look porcelain tile collection that evokes the true elements of natural hardwood, unlike any other. Its distinct features are found within the artistry of the tile, making it a truly unique product line. Over 1,500 different trees were studied in order to develop the intricate patterns and rich colors that make up the collection. The manufacturing process imitates carefully handcrafted results, reproducing all of the details of wood knots and whirls with absolute precision. This allows for the collection to express the realism of nature through each of its series.<br/><br/>The four series of the Seedwood collection are Tanzania, Vancouver, Nebraska and Minnesota. These are available in different colors and have four complementary accent wall and floor tile options: Ice, Desert, Noa, and Eden. The aim of this aesthetic versatility is that any of the collection’s pieces can be combined with each other and can fit into any space. The visual appeal of top-quality wood has been combined with the technical properties of porcelain tile, guaranteeing a long-lasting life and easy day-to-day care. This profound strength makes Seedwood the ideal wood-look porcelain tile collection for walls and floors in both indoor and outdoor areas.<br/><br/>Other benefits of the collection include its high resistance to water, fire, and scratches - as well as being available in anti-slip and natural matte, shaded finishes. Seedwood is also available in a 10″ by 59″ size, which is larger than most standard wood-look porcelain tiles currently on the market. With a total of eleven different colors that complete the collection, Seedwood is truly a remarkable product.",
"id": "9839",
"product_name": "Seedwood",
"video_url": "http://seedwood.com/artesania-eterna/"
}