{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9847",
"category": "Product > seating: contract/guest",
"company_name": "Moroso",
"company_url": "morosousa.com",
"description_html": "The 8mm chair is a lightweight, stackable aluminium chair designed by AL_A for Moroso.<br/>The chair is minimal in both size and means. Developed with Feruglio Engineering, an 8mm thick aluminium sheet is laser cut to create the profile and the pattern of cuts before it is folded into shape in a single motion around a form. The chair was designed by AL_A for the Victoria and Albert Museum’s Exhibition Road building project in London, due to open in July 2017. AL_A have designed the Exhibition Road project that will create ambitious new spaces opening in July 2017 for the V&amp;A, the world’s leading museum of art, design and performance. The diagonal incisions in the plate are designed to reduce the chair’s weight and will cast beautiful shadows. The aluminium, which is typically used in aeronautical construction projects, is a very light alloy that is nonetheless able to withstand a great deal of mechanical pressure. After laser cutting into the shape needed to make each piece, the sheet is bent using a one-step process. Finally, the metal surface is smoothed, to eliminate signs of the laser cutting, and anodized or powder coated in two color variations. <br/>Flexible and comfortable, the back has been cambered with a slight spring at the junction with the seat. <br/>The chair can be used both inside and outside, with an interiors only edition in red leather bonded to the aluminium. <br/>To accompany the chair, the 8mm Table is formed by the same process and incised with the same pattern of cuts. Multiple tables can be placed end-to-end to form a longer version. <br/>The 8mm chair and table are suitable for both indoor and outdoor use and for both contract and residential applications.",
"id": "9847",
"product_name": "8MM",
"video_url": ""
}