{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9848",
"category": "Product > bath: fixtures",
"company_name": "TOTO USA",
"company_url": "http://www.totousa.com",
"description_html": "TOTO’s popular addition to the Connect+ line, the MH Connect+ wall-mount high-efficiency dual flush toilet and D-shaped WASHLET, combines powerful DualMax 3D Tornado flushing performance with an elegant, seamless appearance—modern, clean, simple, and timeless.<br/><br/>The new MH Connect+ wall-mount high-efficinecy toilet has a chic design, characterized by a fully skirted bowl with clean, simple lines, which offers design flexibility. This stylish model saves precious space in the bathroom as its DuoFit In-Wall Tank System is concealed along with the mounting bolts and connection for its Connect+ D-Shaped WASHLET bidet seat. Lifted from the floor, the wall-mount MH Connect+ HET makes cleaning beneath a simple and easy. This versatile unit may be mounted at standard or Universal Height.<br/><br/>The Connect+ D-Shaped WASHLET bidet seat offers warm aerated water to cleanse and warm air to dry. Activated by a simple touch of its silver wireless remote, users control the temperature and pressure of the soothing warm aerated water, self-cleaning dual-action spray wand, heated seat, warm air dryer, and built-in deodorizing system. The D-shaped design of its contoured heated seat offers maximum comfort, and its SoftClose lid closes gently after use, eliminating toilet seat slam. <br/><br/>The MH Connect+ HET's vitreous china bowl is coated with CeFiONtect, TOTO’s nano-technology glaze that seals the porcelain with an ionized barrier. This creates a super-slippery, non-porous surface that repels visible and invisible waste. When protected by CeFiONtect, the water that cleanses the bowl and rim during the flush also removes waste, stains, residue, and limescale buildup. Owners will need fewer harsh detergents when cleaning the bowl, which are expensive and harmful to the planet. <br/><br/>The Connect+ D-Shaped WASHLET offers TOTO’s proprietary Premist technology, which helps keep the toilet’s bowl clean by pre-misting it with tap water prior to use. Pre-misting the bowl prevents matter from adhering to its surface approximately 80% better than dry porcelain.<br/><br/>Inspired by nature's tornados, TOTO engineers harnessed the power of gravity and water to spin away waste by designing a seamless bowl interior with a concave rim to channel high-speed water jets. Each flush effectively removes matter, debris, stains, residue, and limescale, as it provides superior bowl and rim cleansing action.<br/><br/> The new MH Connect+ wall-mount toilet provides interior designers and consumers with a chic, metropolitan design option that is at home in a variety of bathroom interiors and is ideal for a powder room or small bath.",
"id": "9848",
"product_name": "Connect+ MH Wall-Mount Toilet & WASHLET",
"video_url": "https://www.youtube.com/watch?v=mX8W6FRfkNw&index=4&list=PLOhpdPgRBSj5wZb_mX4iM2JRTyUiG6B6M"
}