{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9861",
"category": "Product > acoustical applications",
"company_name": "DARRAN Furniture",
"company_url": "www.darran.com",
"description_html": "In a lively setting, ThinkingQuietly’s range of acoustic furniture turns the volume down on peripheral sound. Acoustic engineers assisted in the design challenge of reducing noise in the open office, targeting the workstation itself. Advanced sound absorbent materials were used to provide noise comfort, while a stylish retro design fits perfectly in the modern office. ThinkingQuietly gives peace at last. Time to get thinking!<br/><br/>ThinkingQuietly Workstations create solitude for up to six users while maintaining a polished, well-analyzed design. Workstations feature contemporary desk pads made of signature noise-cancelling acoustic material. A solid wood Y-frame creates an overhead umbrella that traps sound as it naturally travels upward. Mobile briefcases also function as storage and power can be placed between units to partition individual users in moments that call for confidentiality, without subtracting from collaboration and communication vital to success in today’s office. The 4-person workstation with an acoustic umbrella provides up to 44% improvement over standard stations with screens.<br/><br/>ThinkingQuietly's signature acoustic material is produced from recycled plastic that is crushed and spun into fibers that form the felt based material. The pressure die cast aluminum components that form framework are manufactured from 40% post-consumer aluminum. The solid oak used to manufacture the legs, canopy frame and desktop accessories are sourced from environmentally responsible suppliers who harvest the material from renewable forests. <br/><br/>ThinkingQuietly is also an optimal choice for libraries and information centers where solitude is sought. Cable trays utilize the acoustical material to conceal power and data, reducing floor level noise. Integrated task lights give users control over lighting, and ultimately their personal work environment. Beautifully finished from top to bottom, ThinkingQuietly is a clear choice.<br/><br/>ThinkingQuietly introduces an inventive solution to the growing challenge of common space noise. As a national trend, office real estate is shrinking. Businesses are answering this, coupled with research demanding team collaboration and communication, by opting for open office plans as opposed to private offices. A growing amount of people operating together in a single space permits collaboration and free-flowing ideas, but also produces considerable sound pressure in high-traffic areas. To combat the problem of noisy open offices without subtracting from team tasking, ThinkingQuietly integrates acoustic noise-cancelling elements into a brilliant benching design.<br/><br/>An array of options including desk pads and overhead umbrellas canvased in exclusive acoustic material cancels noise in a busy office space and gives users privacy for confidential phone calls, or lets them escape the noise and focus on personal tasks. ThinkingQuietly gives an unparalleled, ultra-attractive solution to open office environments in need of synergy with a side privacy.<br/><br/>Acoustic engineers have advised the design of ThinkingQuietly. In an open office environment, workers often leave their area in search of a vacant room or quiet spot to escape noise and distractions. ThinkingWorks gives acoustic relief to open office workers seeking quiet privacy to focus without sacrificing openness.",
"id": "9861",
"product_name": "ThinkingQuietly",
"video_url": "https://www.youtube.com/watch?v=jPKkg9nuwBs&t=2s"
}