{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9894",
"category": "Product > flooring: carpet/modular",
"company_name": "Shaw Contract",
"company_url": "shawinc.com",
"description_html": "The Active collection, through its graphic, linear patterning and vibrant fluorescent colors, brings visual cues to the interior space, akin to a wayfinding system. The nervous system is stimulated and react to either a density of color or pattern that inspires movement across the floor surface, or gathering towards a collaborative meeting or focus point. Active provides opportunities for zoning, wayfinding, and activity-based delineation in the workplace. Scale and impact can be manipulated through mixing both styles and colors.<br/><br/>Active takes a conscious approach to wellness in the workplace through helping to activate spaces and create energetic surfaces that inspire and motivate. Active is highly customisable through its variety of styles and functional in its patterning and vibrant colors that can draw attention to various settings. <br/><br/>Active offers four unique styles ranging from a subtle texture, to crisp, graphic high-visibility linear pattern. We treat these design tools – pattern and color to promote pathways, shape visual cues to create intuitive experiences. The patterns can build into bold statements with neutral breaks. Clean neutrals and bold color can shift from small proportion to large scale for flexible environments. Constructed with EcoWorx backing &amp; Eco Solution Q nylon, Active has superior durability, style and recyclability. The Shaw Contract lifetime commercial limited warranty covers abrasive wear, tuft-bind, edge ravel and delamination.<br/><br/>From the concept development stage, our design team was inspired by activewear, focusing on modes of activity and wellness for color and pattern, and the shift towards ‘athleisure.' We envisioned how the synthesis of pattern, texture, shape and color can be used to truly activate a space. We also looked at the language around race trace tracks, whose lines shape and guide runners. Three new fluorescent colors were developed for this collection and added to our color library. There were strategic pile height plantings in the pattern to manipulate the machine into creating a cleaner look. <br/><br/>The Advance style is inspired by performance fabrics such as jersey knits, or high-tech meshes, creating a subtle texture foundation for the collection. The Dash tile features long sweeping linear shifts that break throughout the length of the tile, Turn is a large scale open grid and Track is a medium-scale pattern with converging diagonal and vertical lines that condense and open, creating a variety of density options. <br/><br/>Active takes a conscious approach to wellness in the workplace through helping to activate spaces and create energetic surfaces that inspire and motivate. Active is highly customisable through its variety of styles and functional in its patterning and vibrant colors that can draw attention to various settings.",
"id": "9894",
"product_name": "Active",
"video_url": ""
}