{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9898",
"category": "Product > flooring: carpet/modular",
"company_name": "Shaw Contract",
"company_url": "shawcontract.com",
"description_html": "To appreciate light we must pass through shadows, moments of tranquility contrasted with moments of buoyancy. Mood-setting or playful, Emergence surprises us as color and pattern appear from an elusive background. It is a rich, botanical design that takes its abstract direction from the art world to subvert realism in an aesthetically engaging form. It piques our curiosity, visually leading us through a lush landscape of tonality and pattern, with the promise that wherever we emerge, we will feel inspired.<br/><br/>This collection experiments with the perception and use of pattern in our environments. This collection is expressive, infusing the atmosphere with curiosity and delight. <br/>This collection is offered in a extra large, 36”x36” which allows this bold pattern to render in a dynamic way, enabling powerful visual impact. In order to create moments of respite, we explore how pattern can influence our emotions. The focus on decorative pattern, with the flexibility, practicality and performance of carpet tile, allows hospitality cues to influence the workplace – catering to silent zone, breakout, lounge/library and hospitality areas. <br/><br/>The visual impact of this pattern is highly modular: three different variations on the floral pattern can combine or be used alone to generate varying degrees impact and clarity of the pattern. Both the palette, diverse scale of pattern and tile size allow for flexible spaces and experiences. Strong colors can be tempered by cool neutrals. <br/><br/>Constructed with EcoWorx backing &amp; Eco Solution Q nylon, Emergence has superior durability, style and recyclability. The Shaw Contract lifetime commercial limited warranty covers abrasive wear, tuft-bind, edge ravel and delamination.<br/><br/>Manipulating the density of the color and texture through the pattern rendering challenged our capabilities and we adapted our existing technology to artfully present subtle color and densities of textures that then optically render these incredible florals. <br/><br/>Baroque florals, photo-real subject matter, the endless dark palette of the Dutch masters, edgy florals in menswear and a whole new consideration of our floral vocabulary unapologetically takes focus in our design interpretation. The range of color depth through subtle shifts in color density, creates a velvety backdrop for patterns to emerge. Subtle texture and a natural, tonal palette can create moments of respite. We wanted to completely relook at the opportunity for floral pattern in interior spaces, evolving from a feminine association to a play on tradition and nostalgia – using the scale which pattern can be depicted on the floor to allow this pattern to breathe and have the ability to create elegant or playful moment. We played with background and foreground to abstract and filter the shapes of the flower, creating a bold hybrid of masculine and feminine.",
"id": "9898",
"product_name": "Emergence",
"video_url": ""
}