{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9903",
"category": "Product > flooring: hard",
"company_name": "Shaw Contract",
"company_url": "shawcontract.com",
"description_html": "Inspired by the structure of modern architecture, Shift &amp; Tilt harmoniously blend light and shadow with metallic accents adding a nuance to space. Shift features horizontal line work that moves across the plank with subtle color accents. Tilt is a striation of delicate lines creating a chevron pattern. Tilt features equal parts left &amp; right diagonal tiles per box the pattern can be controlled by alternating left &amp; right tiles or randomly installed. The 9x36 format and the unique visual allow for fun and flexible installations. Foam cushion backing provides extra comfort underfoot, minimizes the sound of foot traffic, and allows for decreased sound transfer (IIC) between floors. 5mm thickness provides a smoother transition between carpet and hard surface without the use of a transition strip.<br/><br/>In a world of high performance environments, products that perform well while adding hints of opulent materials and architectural forms can be few and far between. Shift &amp; Tilt provides large scale pattern options and material sheens for places that need the durability and functionality of commercial space demands.<br/><br/>Large scale pattern creation can be difficult to both specify and achieve with most LVT products on the market today. Shift &amp; Tilt is the first pattern driven LVT of our collections. By mixing 2 directional patterns within a single box, multiple installation types can be achieved for large scale book-match and directional pattern work can be achieve with simplicity to the designer and the installer.<br/><br/>Shift &amp; Tilt provides enhanced functionality in three key ways. The 5mm thickness allows this product to be used in conjunction with our modular carpet tile products seamlessly and without the need for additional transitions strips when used together.<br/><br/>The unique cushion backing provides increased comfort underfoot, supporting spaces that reduce stress and impact for standing and heavy walking traffic all while supporting a higher IIC rating than traditional LVT products, providing noise-reducing acoustic translation from floor-to-floor<br/>This product is FloorScore certified and phthalate-free, contributing to the Leadership in Energy and Environmental Design (LEED) Green Building Rating System. Additionally, Shaw Contract resilient products and their installation adhesives emit low VOCs, making them safe for even the most sensitive areas such as hospitals and schools.<br/><br/>As an environmentally conscious manufacturer, Shaw ensures its promise of durable style through long-lasting and beautiful floorcoverings. Lasting products with elegant styling mean low product turnover—the longer the life is on the floor, the less waste is produced.",
"id": "9903",
"product_name": "Shift + Tilt",
"video_url": ""
}