{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9908",
"category": "Product > hardware",
"company_name": "Otto LLC",
"company_url": "www.meetotto.com",
"description_html": "Otto is the most secure digital lock designed around the family experience.<br/><br/>Designed by a team of award-winning engineers from Apple, Microsoft and Nokia, Otto spent four years in development before unveiling in August 2017. <br/><br/>Founder and CEO, Sam Jadallah, was inspired to create Otto after being involved in his family’s door manufacturing company. Sam, a former Microsoft executive and VC, realized locks on the market were insecure, bulky, and dated. He vowed to create something better, focusing on security, design and performance. <br/> <br/><br/><br/>Sam rounded up a team of designers and engineers (who share 175 patents and 13-years average experience) and investors from Greylock Partners, to reimagine home access and the relationship between people and spaces. <br/><br/>Nico Lylyk, Otto’s head of design, is an award-winning (Yellow Pencil Award, IDEA Award and AIDA Gold Award) Argentine designer who previously worked at Nokia. Tasked with creating a category-defining product, Nico focused on differentiating Otto with quality materials and timeless, minimalistic design.<br/><br/>But first Nico had to remove the object we most associate with locks: the key. Eliminating the key was a bold decision with security in mind–keys and keypads are the most vulnerable aspects of locks. Otto is the first digital lock designed without a key. And it’s no larger than the deadbolt it replaces.<br/><br/>Otto was designed to be a singular home access solution. It has built-in Wi-Fi (unique to the industry), and users can remotely check the status of their lock and lock/unlock from anywhere. By enabling Otto with Wi-Fi and ample processing power, the lock receives ongoing upgrades to features and security.<br/><br/>Otto recognizes authorized users as they arrive, allowing them to press to unlock without needing to pull out their phone--a feature unique to Otto. Using the Otto App, owners can grant access to guests 24x7 or designated times. Users can also gain access using a 4-digit entry code, with an intuitive interface akin to entering a code on a safe. <br/><br/>Otto set a new industry standard in lock testing. The team developed its own fleet of robots to test the device, slamming it over 100,000 times at 60Gs of force (two or three times more than the average door slam), and putting it through 250,000+ cycles of locking and unlocking to test durability. Otto’s design is built to last: durable, reliable, and secure.<br/><br/>A well-designed product delivers an “ah-ha” moment. Otto feels different yet familiar. It achieves the unexpected, but in ways that anticipate your needs. <br/><br/>The best product of the year should raise the bar. It should change our lives in small but meaningful ways. After experiencing Otto, we can’t imagine going back to what was. Despite years of hype, digital locks have yet to be adopted. Homeowners have been stuck with the nearly century-old deadbolt &amp; key. <br/><br/>Until now. The Otto Digital Lock is unlike any other, demonstrating clear advances in security, design, and performance.",
"id": "9908",
"product_name": "Otto",
"video_url": "https://meetotto.com/how-it-works"
}