{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9917",
"category": "Product > technology",
"company_name": "SnapCab",
"company_url": "www.SnapCab.com",
"description_html": "Imagine a brainstorming session where you can write on the wall panels, sketch out solutions, and reach out to colleagues across the world — these are the possibilities that the SnapCab® Portal represents for you.<br/><br/>The Portal comes in 12 standard sizes with 2 height options, is non-proprietary and future-proof. You are free to add and upgrade the technology you want. You can integrate a mini PC, Apple® TV, camera, external mics, and more to present ideas in your conference rooms, display important messages, video conference, or welcome guests.<br/><br/>The entire surface is made of Corning® Gorilla® Glass and provides an superior whiteboard surface. Gorilla Glass is made to be tough enough to withstand every day wear and tear, providing a scratch resistant covering.<br/><br/>SnapCab® was founded on our commitment to craftsmanship and simplified installation in the early 80’s. The SnapCab® Portal continues this approach with its simple, yet beautiful design which allows for assembly within 4 — 6 hours. With its modern, clean appearance and future-proof design, the Portal is sure to encourage creative thinking and increase productivity.<br/><br/>With its clean and contemporary look, the SnapCab Portal will transform a regular wall into an intelligent, integrated multimedia wall. From enhancing conference capability to providing way-finding and interactive accent walls for businesses, institutions, and organizations – the application potential is limited only by imagination and ingenuity. The standard Portal comes in two colors: Bright White or Noir Black. And two finish options: gloss or matte (anti-glare). You can further exercise your creativity by specifying any pantone color for an exact match. Provide your own high resolution imagery or logo. Choose from one of our gigapixel photographs, patterns, wood or stone images, or specify your own. Your options are limitless!<br/><br/>You’ll enjoy Quantum Dot nano-crystal technology for crisp, vibrant color, 4K ultra-high definition for laser-sharp images, and multiple connection possibilities. Flush to the Corning® Gorilla® Glass surface, this TV provides a truly immersive experience.<br/><br/>Full connectivity. Leverage the versatility of HDMI, USB, WiFi, and Bluetooth connectivity. You can integrate mini computers, Apple TV, Fire Stick, additional monitors, external mics, and more to display video conference, messages, stream videos… the list goes on and on.<br/><br/>Integrated speakers. With the Portal, ultra-thin, ultra-versatile Corning® Gorilla® Glass becomes the speakers. Seamlessly integrated, there are no holes or grills to mar the smooth surface.<br/><br/>Writable surface. Both the standard gloss and anti-glare Gorilla® Glass offer an exceptional surface for writing – a next-gen whiteboard. Scribble down notes from a conference, brainstorm with your team, plot out a plan, or make a to-do list. For markers and erasers, hinged magnetic side trims provide hidden storage.",
"id": "9917",
"product_name": "SnapCab Portal",
"video_url": "https://vimeo.com/214056814"
}