{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9926",
"category": "Product > flooring: carpet/broadloom",
"company_name": "Milliken",
"company_url": "www.millikenfloors.com",
"description_html": "Immix converges man-made and natural influences to redefine connections between people, nature, and technology. A geometric splicing of color and interlocking structures create dynamic forms that provide familiar structure to the floor. Nuanced gradation and edge-transitions fuse texture, pattern, and color for a graceful asymmetry that maximizes spatial flexibility. The resulting harmony invites us to flourish in our daily experience, striking an essential balance between technology, nature, and our true selves.<br/><br/>The human journey is intrinsically linked to technology. Chaotic or arranged, our lives merge natural and man-made influences. We respond with a desire for balance as personal and collective needs morph with new definitions of purpose; we redefine the connections between people, nature, and technology to reflect our individuality. <br/><br/>Immix explores this trichotomy through blending bold geometry and flowing organics, softened through new design innovations and industry-leading digital dye injection technology – proprietary tools only through which such heightened dimensionality is possible.<br/><br/>Various design elements enhance the flexibility of Immix with several avenues to create multiple dimensionalities: two distinct pattern groupings, edge transition capabilities, and four textured bases. <br/><br/>Two pattern groupings evolve complementary aesthetics in large, medium and small scales. Vertex, a geometry expression for where two or more lines meet, interprets where humanity, technology, and nature collide. Graphic and dimensional, scales of intricate hexagonal shapes warp and spiral to achieve a modern, innovative dimensionality on the floor. Flourish highlights the outcome when various facets of one’s surrounding influences meet and connect in harmony. The progression of Vertex into a series of patterns that are more organic, Flourish illustrates the positive effect of one embracing technology in a way that fits his or her world, not defines.<br/><br/>Milliken’s signature nuanced gradation and edge transition capabilities fuse texture, pattern, and color for eloquent design transitions in an interior. Four levels of textured carpet bases in hexagonal, linear, and understated forms invite designers to layer pattern and color atop tactile texture. <br/><br/>The PVC-free collection also boasts numerous sustainable features, including NSF 140 and CRI Green Label Plus certification for indoor air quality. The collection also carries an Environmental Product Declaration (EPD) and Declare Living Building Challenge Compliant label for material transparency, and contributes to LEED v4, Living Building Challenge, and other green building certifications. Manufactured by Milliken, the collection is produced using renewable energy and with zero process waste to landfill. <br/><br/>Available in 13’6” broadloom and 1-meter by 1-meter modular carpet tiles.",
"id": "9926",
"product_name": "Immix",
"video_url": ""
}