{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9928",
"category": "Product > lighting: chandelier (multiple bulbs)",
"company_name": "Barn-barn design",
"company_url": "www.barn-barn.com",
"description_html": "Barn-Barn design is excited to announce the launch of the Orbital series: a modular kinetic lighting<br/>system. These dynamic lamps distribute light with functionality and grace while conjuring the movements of<br/>celestial bodies.<br/>The Orbital series is an evolution of the mobile. At its heart is the proprietary rotatable connector. Minimal,<br/>sturdy and unhindered by wires it allows the wood members to rotate around each other smoothly and<br/>steadily. The interplay of the arms is captivating and welcomes interaction. Virtually frictionless, you can give<br/>them a nudge to spin around effortlessly or set them in a desired configuration.<br/><br/>There are two variations in the series and gravitationally speaking they are opposites. The suspended<br/>model is Orbit. Remarkably, when inverted it maintains its balance to become Floorbit, the floor standing<br/>version. They are each made up of one to five arms, of solid glue laminated wood, in either straight or<br/>curved options. New for the fall is the Strata: the CNC cut version made from maple plywood. The quality of the LED light is bright, warm and dimmable. Components are made from machined brushed aluminium. Beyond the models available for retail sale, a multitude of custom creations are possible, including a motorized option.<br/><br/>The lamps’ unique effects recall dewdrops on blades of grass, the motion of clock gears and the playfulness<br/>of spirograph. The Orbital series embodies the spirit of its origins through craftsmanship and choice of<br/>local birch, Douglas fir, western red cedar or Sitka spruce. Custom creations are now easy to make thanks to several years of experience and development.<br/><br/> Barn-Barn design is lead by Mich DuVernet who embraces a hands-on approach to his work that merges<br/>old-school techniques with new technologies. Nestled in the mountains of Canada near Nelson BC, his<br/>converted barn now design studio and workshop has evolved into a space for exploration, fabrication and<br/>play.<br/><br/>The Orbital series will have a sculptural and ever changing presence in any space. Barn-Barn design<br/>invites inquiry about how the Orbital series can compliment or inform your vision.",
"id": "9928",
"product_name": "Orbital series",
"video_url": ""
}