{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9929",
"category": "Product > flooring: carpet/modular",
"company_name": "Milliken",
"company_url": "www.millikenfloors.com",
"description_html": "Moraine is a contemporary celebration of the earth’s contrasting contours and unique surface qualities. Four fresh patterns offer a range of geometric abstractions and density of line to create new planes, textures, and perspectives for the floor. The pattern variety, 18 standard colorways, and eight optional accent colors forms a kit of parts that allows designers to create custom-inspired flooring with the ease of a standard collection.<br/><br/>Maps identify location and help us to navigate the Earth’s surface - a variety of regions which come to life through dynamic terrain and unique surface qualities that morph our experience. This contrast of contours creates a geological rhythm, explored in Moraine’s four patterns.<br/><br/>Explorer is the geometric abstraction of the organic contour lines within a topographical map for a modern take on an ageless cartographic medium. Relief, both the antithesis and compliment to Explorer, plays with a greater line density that creates visual planes while emphasizing the geometry and rhythm of Explorer. Navigator, based on a three-dimensional point field map, uses a series of pixel points to create plane and perspective within a single tile. A combination of tiles creates a dynamic space with tilting and shifting visual planes. Lastly, Regions shifts the scale and density of Navigator for a unique surface quality.<br/><br/>Designed by the Milliken Asia Pacific Design Team, Moraine showcases the capabilities of Milliken’s global design studio, regionalizing a cartography-inspired collection for the Americas. Doing so allows global companies to create and maintain interior brand standards in locations worldwide. <br/><br/>Brought to life with Milliken’s proprietary Digital Dye Infusion (DDI) technology, patterns in Moraine can be completely customized without extended lead times. Each of the 12 neutral colorways can be enhanced with one of eight accents to delineate spaces, simplify wayfinding, or add a pop of color. For additional customization, overlay text or navigator symbols to deliver messages, or combine tile shapes and patterns for an even more dynamic floor.<br/><br/>The PVC-free collection features a total recycled content of 41% and boasts numerous sustainable features, including NSF 140 and CRI Green Label Plus certification for indoor air quality. The collection also carries an Environmental Product Declaration (EPD) and Declare Living Building Challenge Compliant label for material transparency, and contributes to LEED v4, Living Building Challenge, and other green building certifications. Manufactured by Milliken, the collection is produced using up to 52% renewable energy and with zero process waste to landfill. <br/><br/>Available in 50 cm x 50 cm and 50 cm x 1 m modular carpet tiles.",
"id": "9929",
"product_name": "Moraine",
"video_url": "https://www.dropbox.com/s/7k2mzv42t61r4nx/Moraine_c03.mp4?dl=0"
}