{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9930",
"category": "Product > accessories",
"company_name": "Pangea Maps",
"company_url": "www.pangeamaps.com",
"description_html": "Founded in Australia in 2014 by Industrial Designer Tom Percy, Pangea showcases the ocean floor in stunning detail with a line of wooden 3D contour maps of iconic lakes and coastlines in Canada, the United States and Australia, as well as custom maps, offering any seascape or lakeside locale a person calls home (or home away from home). With a passion for water and the often unseen beauty that lies below the surface, Percy sees the maps as a way of connecting people with their environment. <br/><br/>Combining modern surveying techniques and CAD technology with the art of cartography, Pangea Maps are made from layers of plywood. Carefully considering the scale and composition of each map, Percy sources accurate bathymetric data (underwater topography) for each location before laser-cutting the plywood sheets to form the contours of the ocean floor. When finished, each map goes into a hardwood frame and is finished with a layer of glass. Maps are shipped in a beautiful wooden box, making it the perfect gift. <br/><br/>With an early focus on the Australian coastline, in December of 2016 Pangea Maps turned its attention to North America, introducing a new line of maps featuring coastlines and lakes including Vancouver, San Francisco, Los Angeles, the Great Lakes, Boston, and New York. This summer, Tom introduced a new Hamptons map for beach-goers, and this fall he introduced new maps of the Hawaiian Islands, Maui, Santa Barbara, Puget Sound, Nantucket and Nova Scotia for the holidays. Pricing for North American maps start at $360. Australian maps start at $240 and custom maps start at $390.<br/><br/>For each custom map sold, Pangea will donate $50 to the Ocean Cleanup, an organization developing advanced technologies to rid the world’s oceans of plastic, with an aim to clean up 50% of the Great Pacific Garbage Patch in 5 years.",
"id": "9930",
"product_name": "Pangea Maps North American Maps",
"video_url": "https://www.dropbox.com/s/454lkb8b4dqrm5q/Pangea%20Maps%20Production_Long.mp4?dl=0"
}