{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9935",
"category": "Product > green innovation",
"company_name": "Milliken",
"company_url": "www.millikenfloors.com",
"description_html": "Achieving the highest level of material transparency with the newest LEED v4 credit, Encryption illustrates the increasingly blurred line between people and technology while challenging the status quo of sustainable flooring. A technological exploration of shadow and highlights, layers of pixelated color blocks create pseudo-random patterns for familiar yet novel structure, while digitally encoded texture lends elevated dimensionality. <br/><br/>Encryption fulfills the stringent requirements of the newest LEED v4 credit addressing material traceability and transparency: LEED v4 MRc4 Building Product Disclosure and Optimization - Material Ingredients credit (Option 3). The next tier of material transparency, this credit dives into the chemical makeup of supplier materials for an elevated understanding of their resulting human and environmental health impacts. Milliken is the first flooring manufacturer that can contribute to this credit. <br/><br/>The new LEED v4 credit is designed to reward manufacturers who optimize supplier material chemistry. The rigorous process includes:<br/><br/>• Formalizing a plan to optimize supplier chemistry,<br/>• Understanding what is in 99 percent by mass of all chemical ingredients in a supplier’s product, such as nylon yarn,<br/>• Understanding the chemical composition and potential associated hazards in a supplier’s product, <br/>• Notifying suppliers if hazardous ingredients are found in formulations, per Table 1 GHS Hazard Criteria for Endpoint for Option 3 Screening, and<br/>• Confirming that manufacturers and suppliers had the appropriate environment and health and safety systems in place to cover potentially hazards ingredients.<br/><br/>This transparency level is revolutionary in the marketplace, but essential to fully understand the true health impact of materials. <br/><br/>The result of Milliken’s unparalleled design, research and development capabilities to solve some of the most pressing issues of interior flooring, Encryption merges a sustainable, performance-driven construction with innovative design.<br/><br/>To minimize raw materials without compromising performance, Encryption features 39.3% total recycled content. A proprietary moisture vapor-wicking cushion backing extends its usable life up to 40% more than other carpets and eliminates conditions in which mold and mildew grow. <br/><br/>The PVC-free construction also prioritizes occupant well-being. An optional TractionBack® bio-based, adhesive-free installation technology improves indoor air quality by reducing or eliminating volatile organic compound off-gassing. There is also no waste, such as peel/stick backings.<br/><br/>For environmental and material health impacts, Encryption carries a third-party verified Environmental Product Declaration and third-party verified Red List Compliant Declare Label to provide transparency for any ingredient that constitutes 0.01% of the carpet. Milliken believes in intelligent sourcing, and this deep understanding extends to the materials our suppliers use to create products, from yarn to recycled content. Encryption is also made with up to 52% renewable energy through Milliken-owned hydroelectric energy generation. <br/><br/>Zero process waste from the manufacturing of Encryption is sent to landfill – an achievement of Milliken’s for a quarter of a century. With Milliken’s Landfill Diversion Program, the company reclaims used carpet and identifies the eco-friendliest form of diversion. <br/><br/>Available in 25 cm x 1 m modular carpet tiles.",
"id": "9935",
"product_name": "Encryption",
"video_url": ""
}