{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9943",
"category": "Product > furniture: outdoor",
"company_name": "Restoration Hardware",
"company_url": "https://www.restorationhardware.com/catalog/category/collections.jsp?cellBackground=false&parentCatId;=cat10920133&topCatId;=cat180003&categoryId;=cat11210008&sale;=false",
"description_html": "THE CLODAGH COLLECTION FOR RH, RESTORATION HARDWARE<br/>The Clodagh Sofa, Clodagh Lounge Chair, Clodagh Armchair, Clodagh Ottoman, Clodagh Chaise and Clodagh Sectionals comprise the Clodagh Collection for RH Outdoor. <br/><br/>We translated a contemporary metal chair originally designed for the indoors into an outdoor collection, featuring a variety of silhouettes rendered in resin. Reflecting the centuries-old art of basketry, the complex weave features straps of varying widths that crisscross to form a bold, open lattice. The warm bronze finish lends it the look of burnished metal, while the weave's negative space imparts airiness to the low, linear profile. <br/>“I love the warm bronze finish of my collection for RH. There’s quite a universality about it, and bronze is a kind color. I’ve always believed that if something’s too perfect, it’s rather dull, which is why I incorporate Wabi Sabi as part of my design practice. Weaving takes care of that problem, because it’s never perfect.”- Clodagh<br/><br/>MANUFACTURER DESIGN DETAILS:<br/>•\tArtisans weave all-weather resin straps by hand in 6 different widths over a rustproof, powder-coated aluminum inner frame<br/>•\tAll-weather resin is durable and resists fading, cracking and tearing<br/>•\tResin straps are finished with a finely ribbed texture that imparts a metallic-like sheen<br/>•\tLofty, zippered and poly-filled seat and back cushions come in a choice of luxury performance Perennials® or Sunbrella® fabrics that resist mildew, stains and fading even after years of exposure to the elements",
"id": "9943",
"product_name": "Clodagh Collection for Restoration Hardware",
"video_url": "https://www.youtube.com/watch?time_continue=5&v=xmqgbFE14LI"
}