{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9969",
"category": "Product > bath: fittings",
"company_name": "Watermark Designs",
"company_url": "wwww.watermark-designs.com",
"description_html": "Watermark Designs’ newest collection, Elements, offers the ability to play with color, form and texture all in the creation of a unique design statement. The Elements collection is the first self-designed faucet collection; redefining custom design by giving the consumer an endless possibility of faucet choice combinations – in fact more than 387,000! The Elements collection is comprised of fourteen handle styles, called Covers which were designed by the Watermark Designs Studio. The Covers are grouped into four material categories:<br/><br/>RAW<br/>Created by JM Lifestyles, USA<br/>Hand poured, sealed and reinforced concrete<br/>Choose from: Chalk, Military, Poured &amp; Screed<br/><br/>ROCK<br/>Created by Marmi Serafini, Italy<br/>Uniquely hand-finished natural stones and marbles<br/>Choose from: Carrara, Exquisite Rose, Jungle &amp; Volcano<br/><br/>LUMBER<br/>Created by WoodForm, USA<br/>Real wood grain and texture captured and sealed into concrete<br/>Choose from: Charred, Ground, Smoked &amp; Teak<br/><br/>FORGED<br/>Created by Anka, UK<br/>Handworked and lacquered liquid metal<br/>Choose from: Oil Slick &amp; Oxblood<br/><br/>Each Cover has a base made of brass which is available in any of Watermark’s 24 finishes. Along with the base, there are two options for Inserts, which are decorative and also help provide additional grip. The Inserts are available in two styles: Bridge style and Scallop style. These Inserts are also available in any of Watermark’s 24 finishes. The Inserts are snapped into place and held using Watermark’s patent pending rare earth magnets.There are also several faucet Body choices – also available in 24 finishes and when taken together, the number of design options is almost 387,072!<br/><br/>With the many options available for Elements, the design team – a collaboration with Watermark Designs’ UK partner, The Watermark-Collection, and Watermark Designs – developed a website exclusively for Elements. The site acts as a tool to help people design their individual Element collection.<br/><br/>You can experience the website here: www.watermark-designs.com/configurator",
"id": "9969",
"product_name": "Elements",
"video_url": "http://www.drsandassociates.com/news-media/watermark-widespread-faucet-animatedgif_05_2017.gif"
}