{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9978",
"category": "Product > acoustical applications",
"company_name": "Snowsound USA",
"company_url": "www.snowsoundusa.com",
"description_html": "Snowsound Art™ is an acoustic panel collection with unique graphic art. Snowsound Art displays Gillo Dorfles’ designs and serves as an example of how a dialog between art an industry is necessary and should be the basis for any mass-produced product. In our case, Dorfles participated in all phases of the project, from concept to creation. <br/><br/>Gillo Dorfles has always conceived and created books, exhibitions, cultural events, and, most of all, his paintings, doing so with a penchant for mass production. The work of art is always unique; however, the ability to reproduce it using old or new techniques knows no bounds. This is where Dorfles' openness to the world and his ability to always stay in step with the times comes from. He worked with the curator of his exhibitions, Luigi Sansone, to choose four designs created between 1937 and 1998, which he has lent to this series of Snowsound panels.<br/><br/>Dorfles is distinguished as the oldest living art critic at 107 years old. Born in Trieste, Italy in 1910, the painter and artist was a contemporary of Pablo Picasso and Salvador Dali. He founded the \"Movimento Arte Concreta\" (MAC) with Monnet, Soldati and Munari in 1948. He is considered one of the foremost art scholars in the world.<br/><br/>The acoustic panels are 63\" x 48\" or 48\" x 48\" and only 1.4\" thick. The outer panel cover is durable, Trevira CS® polyester fabric. The art pattern is durably ink-jet printed. Each Snowsound® panel is constructed with 100% recyclable polyester and is Greenguard Gold certified. The patented variable density composition meets Class A sound absorption with an NRC of 1.0. Panels have been UL Class A fire and smoke safety tested. Wall brackets and aircraft cable ceiling mounting options are available. Steel frame kits for ceiling mounting include plates and cables. Wall brackets are available in satin nickel or matte white finishes.",
"id": "9978",
"product_name": "Snowsound Art",
"video_url": ""
}