{
"boy_page_url": "https://boyawards.secure-platform.com/a/gallery/rounds/12/details/9984",
"category": "Product > lighting: sconce",
"company_name": "KANEKA OLED",
"company_url": "http://kanekaoled.com/phase2b/",
"description_html": "Kaneka OLED, a division of the Japanese chemical manufacturer Kaneka, launches their newest OLED lighting fixture, KUMIKO, designed by lighting designer MICHIRU TANAKA.<br/>KUMIKO, named in reference to the traditional patterned woodwork found in Japanese screens, is a hightech<br/>decorative update utilizing Kaneka OLED’s revolutionary lighting technology, enabling TANAKA to create a fully-customizable modular tile system that can be vertically-mounted on a surface or built into complex architectural designs in infinite mix-and-match combinations. KUMIKO produces a brilliant diffused light that recalls stained-glass windows when illuminated and transforms into a reflective mirror surface when powered down; a first for the design industry, the line of decorative OLEDs has applications across interiors, retail, hospitality, residential and commercial spaces. As part of the domestic launch of KUMIKO.<br/><br/>TANAKA, known for her work at the Freer and Sackler galleries at The Smithsonian Institute, as well as Grand Central Terminal Centennial Holiday Light Show in New York and Disney World’s Epcot Japan Pavilion Renovation, is committed to using sustainable energy-efficient lighting solutions in all her projects.<br/>Her work exemplifies her goal of creating a unique symbiotic relationship between architecture and lighting<br/>experience. As a native Japanese designer living and practicing in New York, Tanaka wanted to channel both cultural identities into this product.<br/><br/>“Kumiko” is a Japanese term for a traditional, highly crafted piece of functional art made from wood. “I<br/>wanted to bring the spirit of this tradition into contemporary products and technology such as OLED light.”<br/>TANAKA states. “I was able to use the thinness of Kaneka's OLED magnetic module (0.33”) to achieve a<br/>product that can be hung like artwork on a wall. I also imagined my product as a solution for areas where<br/>there is limited access for natural light. I wanted to be able to add KUMIKO like adding back-lit shoji<br/>screens into any space. I carried the KUMIKO pattern through to texture the mirror when the light is off, so<br/>it’s a beautiful design element on or off.”",
"id": "9984",
"product_name": "KUMIKO",
"video_url": ""
}